10-testes.org
#+setupfile: static/setupfile.org
#+html_link_up: index.html
#+title: Testes
#+startup: content

#+property: header-args:rust :tangle src/tests.rs

Arquivo: ~tests.rs~.

A seguir,  enumero alguns testes  unitários para Majestic  Lisp. Estes
testes tentam seguir as orientações e exemplos da especificação ao máximo.

* Importações

#+begin_src rust
use regex::Regex;
use crate::{ maj_list, maj_dotted_list };
use crate::printing::{ maj_format, maj_format_raw };
use crate::core::{ MajState, Maj };
use crate::axioms::predicates::maj_errorp;
use crate::evaluator::maj_eval;
use crate::reader::tokenizer::maj_tokenize;
use crate::reader::parser::maj_parse;
use crate::axioms::primitives::{ maj_car, maj_macroexpand_1 };
#+end_src

* Expressões regulares

- Para testar expressões regulares: https://rustexp.lpil.uk/
- Para mais informações e sintaxe: https://docs.rs/regex/1.4.2/regex/

#+begin_src rust
const RE_IN_STREAM:  &'static str =
    // #<stream (in) {0x...}>
    r"(?u)^#<stream \(in\) \{0x[0-9a-z]*}>$";
const RE_OUT_STREAM: &'static str =
    // #<stream (out) {0x...}>
    r"(?u)^#<stream \(out\) \{0x[0-9a-z]*}>$";
const RE_ENVIRONMENT: &'static str =
    // #<environment {0x...}>
    r"^(?u)#<environment \{0x[0-9a-z]*\}>$";
const RE_CLOSURE: &'static str =
    // #<function (fn (x...)) {0x...}>
    // #<function (fn nil) {0x...}>
    // #<function (fn (x... . blah)) {0x...}>
    r"(?u)^#<function \(fn (nil|\((\w+\s*)+(\. \w+)?\))\) \{0x[0-9a-z]*\}>$";
const RE_MACRO: &'static str =
    // #<macro (mac (x...)) {0x...}>
    // #<macro (mac nil) {0x...}>
    // #<macro (mac (x... . blah)) {0x...}>
    r"(?u)^#<macro \(mac (nil|\((\w+\s*)+(\. \w+)?\))\) \{0x[0-9a-z]*\}>$";
const RE_PRIMITIVE: &'static str =
    // #<function (prim fn-name (arity (required X)))>
    // #<function (prim fn-name (arity (required 0)))>
    // #<function (prim fn-name (arity (variadic X)))>
    // #<function (prim fn-name (arity (variadic 0)))>
    r"(?u)^#<function \(prim ((\w|\W)+) \(arity \((required|variadic) [0-9]*\)\)\)>$";
#+end_src

* Macros de teste

** Comparação direta de formatações

#+begin_src rust
macro_rules! test_format {
    ($state:ident, $x:expr, $y:tt) => {
        let ex = $x;
        let fmt = maj_format(&$state, ex);
        //println!("fmt = {}", fmt);
        assert_eq!(fmt, $y);
    };
}
#+end_src

#+begin_src rust
macro_rules! multi_test {
    ($state:ident; $(($x:expr, $y:tt);)+) => {
        $(test_format!($state, $x, $y);)*
    }
}
#+end_src

** Comparação de interpretações de AST

#+begin_src rust
macro_rules! test_eval_ast {
    ($state:ident, $x:expr, $env:expr, $y:tt) => {
        let ex = $x;
        let result = maj_eval(&mut $state, ex, $env);
        let fmt = maj_format(&$state, result);
        assert_eq!(fmt, $y);
    };
}
#+end_src

#+begin_src rust
macro_rules! multi_eval_ast_test {
    ($state:ident; $(($x:expr, $env:expr, $y:tt);)+) => {
        $(test_eval_ast!($state, $x, $env, $y);)*
    }
}
#+end_src

