doc/html/10-testes.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="pt-br" xml:lang="pt-br">
<head>
<!-- 2022-10-24 seg 00:27 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Testes</title>
<meta name="author" content="Lucas S. Vieira" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="./main.css" />
<link rel="stylesheet" type="text/css" href="./syntax.css" />
<link id="theme-css" rel="stylesheet" type="text/css" href="./dark-theme.css" />
<meta name="viewport" content="width=device-width, initial-scale=1.0">
<meta property="og:image" content="../img/cat-i-mage.jpg">
<meta name="theme-color" content="#14171e">
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="index.html"> UP </a>
 |
 <a accesskey="H" href="index.html"> HOME </a>
</div><div id="content" class="content">
<h1 class="title">Testes</h1>
<p>
Arquivo: <code>tests.rs</code>.
</p>

<p>
A seguir,  enumero alguns testes  unitários para Majestic  Lisp. Estes
testes tentam seguir as orientações e exemplos da especificação ao máximo.
</p>

<div id="outline-container-org7d339d7" class="outline-2">
<h2 id="org7d339d7"><span class="section-number-2">1.</span> Importações</h2>
<div class="outline-text-2" id="text-1">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #569cd6;">use</span> <span style="color: #569cd6;">regex</span>::<span style="color: #4ec9b0;">Regex</span>;
<span style="color: #569cd6;">use</span> <span style="color: #569cd6;">crate</span>::{ maj_list, maj_dotted_list };
<span style="color: #569cd6;">use</span> <span style="color: #569cd6;">crate</span>::<span style="color: #569cd6;">printing</span>::{ maj_format, maj_format_raw };
<span style="color: #569cd6;">use</span> <span style="color: #569cd6;">crate</span>::<span style="color: #569cd6;">core</span>::{ <span style="color: #4ec9b0;">MajState</span>, <span style="color: #4ec9b0;">Maj</span> };
<span style="color: #569cd6;">use</span> <span style="color: #569cd6;">crate</span>::<span style="color: #569cd6;">axioms</span>::<span style="color: #569cd6;">predicates</span>::maj_errorp;
<span style="color: #569cd6;">use</span> <span style="color: #569cd6;">crate</span>::<span style="color: #569cd6;">evaluator</span>::maj_eval;
<span style="color: #569cd6;">use</span> <span style="color: #569cd6;">crate</span>::<span style="color: #569cd6;">reader</span>::<span style="color: #569cd6;">tokenizer</span>::maj_tokenize;
<span style="color: #569cd6;">use</span> <span style="color: #569cd6;">crate</span>::<span style="color: #569cd6;">reader</span>::<span style="color: #569cd6;">parser</span>::maj_parse;
<span style="color: #569cd6;">use</span> <span style="color: #569cd6;">crate</span>::<span style="color: #569cd6;">axioms</span>::<span style="color: #569cd6;">primitives</span>::{ maj_car, maj_macroexpand_1 };
</pre>
</div>
</div>
</div>

<div id="outline-container-org6a6402e" class="outline-2">
<h2 id="org6a6402e"><span class="section-number-2">2.</span> Expressões regulares</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li>Para testar expressões regulares: <a href="https://rustexp.lpil.uk/">https://rustexp.lpil.uk/</a></li>
<li>Para mais informações e sintaxe: <a href="https://docs.rs/regex/1.4.2/regex/">https://docs.rs/regex/1.4.2/regex/</a></li>
</ul>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #569cd6;">const</span> <span style="color: #9cdcfe;">RE_IN_STREAM</span>:  <span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span>'<span style="color: #569cd6;">static</span> <span style="color: #4ec9b0;">str</span> =
    <span style="color: #6a9955;">// </span><span style="color: #6a9955;">#&lt;stream (in) {0x...}&gt;</span>
    <span style="color: #ce9178;">r"(?u)^#&lt;stream \(in\) \{0x[0-9a-z]*}&gt;$"</span>;
<span style="color: #569cd6;">const</span> <span style="color: #9cdcfe;">RE_OUT_STREAM</span>: <span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span>'<span style="color: #569cd6;">static</span> <span style="color: #4ec9b0;">str</span> =
    <span style="color: #6a9955;">// </span><span style="color: #6a9955;">#&lt;stream (out) {0x...}&gt;</span>
    <span style="color: #ce9178;">r"(?u)^#&lt;stream \(out\) \{0x[0-9a-z]*}&gt;$"</span>;
<span style="color: #569cd6;">const</span> <span style="color: #9cdcfe;">RE_ENVIRONMENT</span>: <span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span>'<span style="color: #569cd6;">static</span> <span style="color: #4ec9b0;">str</span> =
    <span style="color: #6a9955;">// </span><span style="color: #6a9955;">#&lt;environment {0x...}&gt;</span>
    <span style="color: #ce9178;">r"^(?u)#&lt;environment \{0x[0-9a-z]*\}&gt;$"</span>;
<span style="color: #569cd6;">const</span> <span style="color: #9cdcfe;">RE_CLOSURE</span>: <span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span>'<span style="color: #569cd6;">static</span> <span style="color: #4ec9b0;">str</span> =
    <span style="color: #6a9955;">// </span><span style="color: #6a9955;">#&lt;function (fn (x...)) {0x...}&gt;</span>
    <span style="color: #6a9955;">// </span><span style="color: #6a9955;">#&lt;function (fn nil) {0x...}&gt;</span>
    <span style="color: #6a9955;">// </span><span style="color: #6a9955;">#&lt;function (fn (x... . blah)) {0x...}&gt;</span>
    <span style="color: #ce9178;">r"(?u)^#&lt;function \(fn (nil|\((\w+\s*)+(\. \w+)?\))\) \{0x[0-9a-z]*\}&gt;$"</span>;
<span style="color: #569cd6;">const</span> <span style="color: #9cdcfe;">RE_MACRO</span>: <span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span>'<span style="color: #569cd6;">static</span> <span style="color: #4ec9b0;">str</span> =
    <span style="color: #6a9955;">// </span><span style="color: #6a9955;">#&lt;macro (mac (x...)) {0x...}&gt;</span>
    <span style="color: #6a9955;">// </span><span style="color: #6a9955;">#&lt;macro (mac nil) {0x...}&gt;</span>
    <span style="color: #6a9955;">// </span><span style="color: #6a9955;">#&lt;macro (mac (x... . blah)) {0x...}&gt;</span>
    <span style="color: #ce9178;">r"(?u)^#&lt;macro \(mac (nil|\((\w+\s*)+(\. \w+)?\))\) \{0x[0-9a-z]*\}&gt;$"</span>;
<span style="color: #569cd6;">const</span> <span style="color: #9cdcfe;">RE_PRIMITIVE</span>: <span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span>'<span style="color: #569cd6;">static</span> <span style="color: #4ec9b0;">str</span> =
    <span style="color: #6a9955;">// </span><span style="color: #6a9955;">#&lt;function (prim fn-name (arity (required X)))&gt;</span>
    <span style="color: #6a9955;">// </span><span style="color: #6a9955;">#&lt;function (prim fn-name (arity (required 0)))&gt;</span>
    <span style="color: #6a9955;">// </span><span style="color: #6a9955;">#&lt;function (prim fn-name (arity (variadic X)))&gt;</span>
    <span style="color: #6a9955;">// </span><span style="color: #6a9955;">#&lt;function (prim fn-name (arity (variadic 0)))&gt;</span>
    <span style="color: #ce9178;">r"(?u)^#&lt;function \(prim ((\w|\W)+) \(arity \((required|variadic) [0-9]*\)\)\)&gt;$"</span>;
</pre>
</div>
</div>
</div>

<div id="outline-container-orgd4bf9d3" class="outline-2">
<h2 id="orgd4bf9d3"><span class="section-number-2">3.</span> Macros de teste</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-orgbf771f8" class="outline-3">
<h3 id="orgbf771f8"><span class="section-number-3">3.1.</span> Comparação direta de formatações</h3>
<div class="outline-text-3" id="text-3-1">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #c586c0;">macro_rules!</span> test_format {
    (<span style="color: #9cdcfe;">$state</span>:ident, <span style="color: #9cdcfe;">$x</span>:expr, <span style="color: #9cdcfe;">$y</span>:tt) =&gt; {
        <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">ex</span> = $x;
        <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">fmt</span> = maj_format(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span>$state, ex);
        <span style="color: #6a9955;">//</span><span style="color: #6a9955;">println!("fmt = {}", fmt);</span>
        <span style="color: #c586c0;">assert_eq!</span>(fmt, $y);
    };
}
</pre>
</div>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #c586c0;">macro_rules!</span> multi_test {
    (<span style="color: #9cdcfe;">$state</span>:ident; $((<span style="color: #9cdcfe;">$x</span>:expr, <span style="color: #9cdcfe;">$y</span>:tt);)+) =&gt; {
        $(test_<span style="color: #c586c0;">format!</span>($state, $x, $y);)*
    }
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orgad816bc" class="outline-3">
<h3 id="orgad816bc"><span class="section-number-3">3.2.</span> Comparação de interpretações de AST</h3>
<div class="outline-text-3" id="text-3-2">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #c586c0;">macro_rules!</span> test_eval_ast {
    (<span style="color: #9cdcfe;">$state</span>:ident, <span style="color: #9cdcfe;">$x</span>:expr, <span style="color: #9cdcfe;">$env</span>:expr, <span style="color: #9cdcfe;">$y</span>:tt) =&gt; {
        <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">ex</span> = $x;
        <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">result</span> = maj_eval(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> $state, ex, $env);
        <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">fmt</span> = maj_format(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span>$state, result);
        <span style="color: #c586c0;">assert_eq!</span>(fmt, $y);
    };
}
</pre>
</div>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #c586c0;">macro_rules!</span> multi_eval_ast_test {
    (<span style="color: #9cdcfe;">$state</span>:ident; $((<span style="color: #9cdcfe;">$x</span>:expr, <span style="color: #9cdcfe;">$env</span>:expr, <span style="color: #9cdcfe;">$y</span>:tt);)+) =&gt; {
        $(<span style="color: #c586c0;">test_eval_ast!</span>($state, $x, $env, $y);)*
    }
}
</pre>
</div>
</div>
</div>
