10-testes.org
** Comparação de parsing

#+begin_src rust
macro_rules! test_parser {
    ($state:ident, $expr:tt, $toks:expr, $y:tt) => {
        let tokens = maj_tokenize($expr).unwrap();
        let expected_tokens: Vec<&str> = $toks;
        assert_eq!(tokens.len(), expected_tokens.len());
        for n in 0..tokens.len() {
            assert_eq!(tokens[n], expected_tokens[n]);
        }
        let parsed = maj_parse(&mut $state, tokens).unwrap();
        let fmt    = maj_format_raw(&$state, parsed, false);
        assert_eq!(fmt, $y);
    }
}
#+end_src

#+begin_src rust
macro_rules! multi_parser_test {
    ($state:ident; $(($expr:tt, $toks:expr, $y:tt);)+) => {
        $(test_parser!($state, $expr, $toks, $y);)*
    }
}
#+end_src

** Comparação de falha de parsing

#+begin_src rust
macro_rules! test_parser_fail {
    ($state:ident, $expr:tt) => {
        let tokens = maj_tokenize($expr).unwrap();
        assert!(maj_parse(&mut $state, tokens).is_err());
    }
}
#+end_src

#+begin_src rust
macro_rules! multi_parser_fail_test {
    ($state:ident; $($expr:tt;)+) => {
        $(test_parser_fail!($state, $expr);)*
    }
}
#+end_src

** Comparação de interpretação

#+begin_src rust
macro_rules! test_eval {
    ($state:ident, $expr:tt, $y:tt) => {
        let tokens = maj_tokenize($expr).unwrap();
        let parsed = maj_parse(&mut $state, tokens).unwrap();
        let result = maj_eval(
            &mut $state,
            Maj::cons(Maj::do_sym(), parsed),
            Maj::nil());
        assert!(!maj_errorp(result.clone()).to_bool());
        let fmt    = maj_format_raw(&$state, result, false);
        assert_eq!(fmt, $y);
    }
}
#+end_src

#+begin_src rust
macro_rules! multi_eval_test {
    ($state:ident; $(($expr:tt, $y:tt);)+) => {
        $(test_eval!($state, $expr, $y);)*
    }
}
#+end_src

** Comparação com falha de interpretação

#+begin_src rust
macro_rules! test_eval_fail {
    ($state:ident, $expr:tt) => {
        let tokens = maj_tokenize($expr).unwrap();
        let parsed = maj_parse(&mut $state, tokens).unwrap();
        let result = maj_eval(
            &mut $state,
            Maj::cons(Maj::do_sym(), parsed),
            Maj::nil());
        assert!(maj_errorp(result).to_bool());
    }
}
#+end_src

#+begin_src rust
macro_rules! multi_eval_fail_test {
    ($state:ident; $($expr:tt;)+) => {
        $(test_eval_fail!($state, $expr);)*
    }
}
#+end_src

** Comparação com expansão de macro (uma vez)

#+begin_src rust
macro_rules! test_macroexpand_1 {
    ($state:ident, $expr:tt, $y:tt) => {
        let tokens = maj_tokenize($expr).unwrap();
        let parsed = maj_parse(&mut $state, tokens).unwrap();
        let parsed = maj_car(parsed);
        let (expanded, worked) =
            maj_macroexpand_1(&mut $state, parsed, Maj::nil());
        if !worked {
            panic!("Failed expansion: {}\nExpected: {}",
                   maj_format_raw(&$state, expanded, false),
                   $y);
        }
        let fmt = maj_format_raw(&$state, expanded, false);
        assert_eq!(fmt, $y);
    }
}
#+end_src

#+begin_src rust
macro_rules! multi_macroexpand_1_test {
    ($state:ident; $(($expr:tt, $y:tt);)+) => {
        $(test_macroexpand_1!($state, $expr, $y);)*
    }
}
#+end_src

