doc/html/10-testes.html

<div id="outline-container-org755860a" class="outline-3">
<h3 id="org755860a"><span class="section-number-3">3.3.</span> Comparação de parsing</h3>
<div class="outline-text-3" id="text-3-3">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #c586c0;">macro_rules!</span> test_parser {
    (<span style="color: #9cdcfe;">$state</span>:ident, <span style="color: #9cdcfe;">$expr</span>:tt, <span style="color: #9cdcfe;">$toks</span>:expr, <span style="color: #9cdcfe;">$y</span>:tt) =&gt; {
        <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">tokens</span> = maj_tokenize($expr).unwrap();
        <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">expected_tokens</span>: <span style="color: #4ec9b0;">Vec</span>&lt;<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #4ec9b0;">str</span>&gt; = $toks;
        <span style="color: #c586c0;">assert_eq!</span>(tokens.len(), expected_tokens.len());
        <span style="color: #569cd6;">for</span> <span style="color: #9cdcfe;">n</span> <span style="color: #569cd6;">in</span> 0..tokens.len() {
            <span style="color: #c586c0;">assert_eq!</span>(tokens[n], expected_tokens[n]);
        }
        <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">parsed</span> = maj_parse(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> $state, tokens).unwrap();
        <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">fmt</span>    = maj_format_raw(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span>$state, parsed, <span style="color: #569cd6;">false</span>);
        <span style="color: #c586c0;">assert_eq!</span>(fmt, $y);
    }
}
</pre>
</div>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #c586c0;">macro_rules!</span> multi_parser_test {
    (<span style="color: #9cdcfe;">$state</span>:ident; $((<span style="color: #9cdcfe;">$expr</span>:tt, <span style="color: #9cdcfe;">$toks</span>:expr, <span style="color: #9cdcfe;">$y</span>:tt);)+) =&gt; {
        $(<span style="color: #c586c0;">test_parser!</span>($state, $expr, $toks, $y);)*
    }
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org791ce3c" class="outline-3">
<h3 id="org791ce3c"><span class="section-number-3">3.4.</span> Comparação de falha de parsing</h3>
<div class="outline-text-3" id="text-3-4">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #c586c0;">macro_rules!</span> test_parser_fail {
    (<span style="color: #9cdcfe;">$state</span>:ident, <span style="color: #9cdcfe;">$expr</span>:tt) =&gt; {
        <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">tokens</span> = maj_tokenize($expr).unwrap();
        <span style="color: #c586c0;">assert!</span>(maj_parse(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> $state, tokens).is_err());
    }
}
</pre>
</div>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #c586c0;">macro_rules!</span> multi_parser_fail_test {
    (<span style="color: #9cdcfe;">$state</span>:ident; $(<span style="color: #9cdcfe;">$expr</span>:tt;)+) =&gt; {
        $(<span style="color: #c586c0;">test_parser_fail!</span>($state, $expr);)*
    }
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org50f91e1" class="outline-3">
<h3 id="org50f91e1"><span class="section-number-3">3.5.</span> Comparação de interpretação</h3>
<div class="outline-text-3" id="text-3-5">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #c586c0;">macro_rules!</span> test_eval {
    (<span style="color: #9cdcfe;">$state</span>:ident, <span style="color: #9cdcfe;">$expr</span>:tt, <span style="color: #9cdcfe;">$y</span>:tt) =&gt; {
        <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">tokens</span> = maj_tokenize($expr).unwrap();
        <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">parsed</span> = maj_parse(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> $state, tokens).unwrap();
        <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">result</span> = maj_eval(
            <span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> $state,
            <span style="color: #4ec9b0;">Maj</span>::cons(<span style="color: #4ec9b0;">Maj</span>::do_sym(), parsed),
            <span style="color: #4ec9b0;">Maj</span>::nil());
        <span style="color: #c586c0;">assert!</span>(!maj_errorp(result.clone()).to_bool());
        <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">fmt</span>    = maj_format_raw(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span>$state, result, <span style="color: #569cd6;">false</span>);
        <span style="color: #c586c0;">assert_eq!</span>(fmt, $y);
    }
}
</pre>
</div>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #c586c0;">macro_rules!</span> multi_eval_test {
    (<span style="color: #9cdcfe;">$state</span>:ident; $((<span style="color: #9cdcfe;">$expr</span>:tt, <span style="color: #9cdcfe;">$y</span>:tt);)+) =&gt; {
        $(<span style="color: #c586c0;">test_eval!</span>($state, $expr, $y);)*
    }
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org31533ec" class="outline-3">
<h3 id="org31533ec"><span class="section-number-3">3.6.</span> Comparação com falha de interpretação</h3>
<div class="outline-text-3" id="text-3-6">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #c586c0;">macro_rules!</span> test_eval_fail {
    (<span style="color: #9cdcfe;">$state</span>:ident, <span style="color: #9cdcfe;">$expr</span>:tt) =&gt; {
        <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">tokens</span> = maj_tokenize($expr).unwrap();
        <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">parsed</span> = maj_parse(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> $state, tokens).unwrap();
        <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">result</span> = maj_eval(
            <span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> $state,
            <span style="color: #4ec9b0;">Maj</span>::cons(<span style="color: #4ec9b0;">Maj</span>::do_sym(), parsed),
            <span style="color: #4ec9b0;">Maj</span>::nil());
        <span style="color: #c586c0;">assert!</span>(maj_errorp(result).to_bool());
    }
}
</pre>
</div>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #c586c0;">macro_rules!</span> multi_eval_fail_test {
    (<span style="color: #9cdcfe;">$state</span>:ident; $(<span style="color: #9cdcfe;">$expr</span>:tt;)+) =&gt; {
        $(<span style="color: #c586c0;">test_eval_fail!</span>($state, $expr);)*
    }
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org2abe7f4" class="outline-3">
<h3 id="org2abe7f4"><span class="section-number-3">3.7.</span> Comparação com expansão de macro (uma vez)</h3>
<div class="outline-text-3" id="text-3-7">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #c586c0;">macro_rules!</span> test_macroexpand_1 {
    (<span style="color: #9cdcfe;">$state</span>:ident, <span style="color: #9cdcfe;">$expr</span>:tt, <span style="color: #9cdcfe;">$y</span>:tt) =&gt; {
        <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">tokens</span> = maj_tokenize($expr).unwrap();
        <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">parsed</span> = maj_parse(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> $state, tokens).unwrap();
        <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">parsed</span> = maj_car(parsed);
        <span style="color: #569cd6;">let</span> (expanded, worked) =
            maj_macroexpand_1(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> $state, parsed, <span style="color: #4ec9b0;">Maj</span>::nil());
        <span style="color: #569cd6;">if</span> !worked {
            <span style="color: #c586c0;">panic!</span>(<span style="color: #ce9178;">"Failed expansion: {}\nExpected: {}"</span>,
                   maj_format_raw(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span>$state, expanded, <span style="color: #569cd6;">false</span>),
                   $y);
        }
        <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">fmt</span> = maj_format_raw(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span>$state, expanded, <span style="color: #569cd6;">false</span>);
        <span style="color: #c586c0;">assert_eq!</span>(fmt, $y);
    }
}
</pre>
</div>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #c586c0;">macro_rules!</span> multi_macroexpand_1_test {
    (<span style="color: #9cdcfe;">$state</span>:ident; $((<span style="color: #9cdcfe;">$expr</span>:tt, <span style="color: #9cdcfe;">$y</span>:tt);)+) =&gt; {
        $(<span style="color: #c586c0;">test_macroexpand_1!</span>($state, $expr, $y);)*
    }
}
</pre>
</div>
</div>
</div>
