10-testes.org
** Comparação por expressão regular

#+begin_src rust
macro_rules! test_regex {
    ($state:ident, $x:expr, $re:tt) => {
        let ex  = $x;
        let fmt = maj_format(&$state, ex);
        let re  = Regex::new($re).unwrap();
        assert!(re.is_match(&fmt));
    };
}
#+end_src

#+begin_src rust
macro_rules! test_fail_regex {
    ($state:ident, $x:expr, $re:tt) => {
        let ex  = $x;
        let fmt = maj_format(&$state, ex);
        let re  = Regex::new($re).unwrap();
        assert!(!re.is_match(&fmt));
    };
}
#+end_src

#+begin_src rust
macro_rules! multi_regex_test {
    ($state:ident; $($pair:expr;)+) => {
        $(
            let (x, y) = $pair;
            test_regex!($state, x, y);
        )*
    }
}
#+end_src

** Comparação com expressão de falha ou não-falha

#+begin_src rust
macro_rules! test_fail {
    ($x:expr) => {
        assert!(maj_errorp($x).to_bool());
    };
}
#+end_src

#+begin_src rust
macro_rules! test_dont_fail {
    ($x:expr) => {
        assert!(!maj_errorp($x).to_bool());
    };
}
#+end_src

#+begin_src rust
macro_rules! multi_fail_test {
    ($($x:expr;)+) => {
        $(test_fail!($x);)*
    }
}
#+end_src

** Arquivos para uso em streams
*** Leitura

#+begin_src fundamental :tangle test-streams-in.txt
Hello world
#+end_src

*** Escrita

#+begin_src fundamental :tangle test-streams-out.txt

#+end_src

** Comparação de resultados de predicados

#+begin_src rust
macro_rules! test_boolean {
    ($x:expr, $v:literal) => {
        let res = $x;
        if maj_errorp(res.clone()).to_bool() {
            panic!("Error raised during assertion");
        }
        assert_eq!(res.to_bool(), $v);
    }
}
#+end_src

#+begin_src rust
macro_rules! multi_boolean_test {
    ($(($x:expr, $v:literal);)+) => {
        $(test_boolean!($x, $v);)*
    }
}
#+end_src

* Formatação

** Símbolos

#+begin_src rust
#[test]
fn formatter_symbol() {
    let mut state = MajState::new();
    multi_test!(
        state;
        (Maj::symbol(&mut state, "foo"),   "foo");
        (Maj::symbol(&mut state, "bar"),   "bar");
        (Maj::symbol(&mut state, "baz"),   "baz");
        (Maj::symbol(&mut state, "t"),     "t");
        (Maj::t(),                         "t");
        (Maj::symbol(&mut state, "nil"),   "nil");
        (Maj::nil(),                       "nil");
        (Maj::symbol(&mut state, "&"),     "&");
        (Maj::symbol(&mut state, "apply"), "apply");
    );
}
#+end_src

** Cons

#+begin_src rust
#[test]
fn formatter_cons_cell() {
    let mut state = MajState::new();
    let foo = Maj::symbol(&mut state, "foo");
    let bar = Maj::symbol(&mut state, "bar");
    let baz = Maj::symbol(&mut state, "baz");

    multi_test!(
        state;
        (Maj::cons(foo.clone(), bar.clone()),
         "(foo . bar)");
        (Maj::cons(foo.clone(),
                   Maj::cons(bar.clone(), baz.clone())),
         "(foo bar . baz)");
    );
}
#+end_src

** Caracteres

#+begin_src rust
#[test]
fn formatter_character() {
    let state = MajState::new();
    multi_test!(
        state;
        (Maj::character('a'),    "#\\a");
        (Maj::character('\x07'), "#\\␇");
        (Maj::character('\t'),   "#\\tab");
        (Maj::character(' '),    "#\\space");
        (Maj::character('\n'),   "#\\newline");
    );
}
#+end_src

