doc/html/10-testes.html

<div id="outline-container-org72ec04e" class="outline-3">
<h3 id="org72ec04e"><span class="section-number-3">3.8.</span> Comparação por expressão regular</h3>
<div class="outline-text-3" id="text-3-8">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #c586c0;">macro_rules!</span> test_regex {
    (<span style="color: #9cdcfe;">$state</span>:ident, <span style="color: #9cdcfe;">$x</span>:expr, <span style="color: #9cdcfe;">$re</span>:tt) =&gt; {
        <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">ex</span>  = $x;
        <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">fmt</span> = maj_format(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span>$state, ex);
        <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">re</span>  = <span style="color: #4ec9b0;">Regex</span>::new($re).unwrap();
        <span style="color: #c586c0;">assert!</span>(re.is_match(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span>fmt));
    };
}
</pre>
</div>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #c586c0;">macro_rules!</span> test_fail_regex {
    (<span style="color: #9cdcfe;">$state</span>:ident, <span style="color: #9cdcfe;">$x</span>:expr, <span style="color: #9cdcfe;">$re</span>:tt) =&gt; {
        <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">ex</span>  = $x;
        <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">fmt</span> = maj_format(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span>$state, ex);
        <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">re</span>  = <span style="color: #4ec9b0;">Regex</span>::new($re).unwrap();
        <span style="color: #c586c0;">assert!</span>(!re.is_match(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span>fmt));
    };
}
</pre>
</div>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #c586c0;">macro_rules!</span> multi_regex_test {
    (<span style="color: #9cdcfe;">$state</span>:ident; $(<span style="color: #9cdcfe;">$pair</span>:expr;)+) =&gt; {
        $(
            <span style="color: #569cd6;">let</span> (x, y) = $pair;
            <span style="color: #c586c0;">test_regex!</span>($state, x, y);
        )*
    }
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org690d704" class="outline-3">
<h3 id="org690d704"><span class="section-number-3">3.9.</span> Comparação com expressão de falha ou não-falha</h3>
<div class="outline-text-3" id="text-3-9">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #c586c0;">macro_rules!</span> test_fail {
    (<span style="color: #9cdcfe;">$x</span>:expr) =&gt; {
        <span style="color: #c586c0;">assert!</span>(maj_errorp($x).to_bool());
    };
}
</pre>
</div>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #c586c0;">macro_rules!</span> test_dont_fail {
    (<span style="color: #9cdcfe;">$x</span>:expr) =&gt; {
        <span style="color: #c586c0;">assert!</span>(!maj_errorp($x).to_bool());
    };
}
</pre>
</div>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #c586c0;">macro_rules!</span> multi_fail_test {
    ($(<span style="color: #9cdcfe;">$x</span>:expr;)+) =&gt; {
        $(<span style="color: #c586c0;">test_fail!</span>($x);)*
    }
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orgd0d7c6a" class="outline-3">
<h3 id="orgd0d7c6a"><span class="section-number-3">3.10.</span> Arquivos para uso em streams</h3>
<div class="outline-text-3" id="text-3-10">
</div>
<div id="outline-container-org3217485" class="outline-4">
<h4 id="org3217485"><span class="section-number-4">3.10.1.</span> Leitura</h4>
<div class="outline-text-4" id="text-3-10-1">
<div class="org-src-container">
<pre class="src src-fundamental">Hello world
</pre>
</div>
</div>
</div>

<div id="outline-container-orgf4d4e05" class="outline-4">
<h4 id="orgf4d4e05"><span class="section-number-4">3.10.2.</span> Escrita</h4>
<div class="outline-text-4" id="text-3-10-2">
<div class="org-src-container">
<pre class="src src-fundamental">
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org139b84d" class="outline-3">
<h3 id="org139b84d"><span class="section-number-3">3.11.</span> Comparação de resultados de predicados</h3>
<div class="outline-text-3" id="text-3-11">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #c586c0;">macro_rules!</span> test_boolean {
    (<span style="color: #9cdcfe;">$x</span>:expr, <span style="color: #9cdcfe;">$v</span>:literal) =&gt; {
        <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">res</span> = $x;
        <span style="color: #569cd6;">if</span> maj_errorp(res.clone()).to_bool() {
            <span style="color: #c586c0;">panic!</span>(<span style="color: #ce9178;">"Error raised during assertion"</span>);
        }
        <span style="color: #c586c0;">assert_eq!</span>(res.to_bool(), $v);
    }
}
</pre>
</div>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #c586c0;">macro_rules!</span> multi_boolean_test {
    ($((<span style="color: #9cdcfe;">$x</span>:expr, <span style="color: #9cdcfe;">$v</span>:literal);)+) =&gt; {
        $(<span style="color: #c586c0;">test_boolean!</span>($x, $v);)*
    }
}
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org0feb590" class="outline-2">
<h2 id="org0feb590"><span class="section-number-2">4.</span> Formatação</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-org78e07d4" class="outline-3">
<h3 id="org78e07d4"><span class="section-number-3">4.1.</span> Símbolos</h3>
<div class="outline-text-3" id="text-4-1">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #c586c0;">#[test]</span>
<span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">formatter_symbol</span>() {
    <span style="color: #569cd6;">let</span> <span style="color: #569cd6;">mut</span> <span style="color: #9cdcfe;">state</span> = <span style="color: #4ec9b0;">MajState</span>::new();
    <span style="color: #c586c0;">multi_test!</span>(
        state;
        (<span style="color: #4ec9b0;">Maj</span>::symbol(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #ce9178;">"foo"</span>),   <span style="color: #ce9178;">"foo"</span>);
        (<span style="color: #4ec9b0;">Maj</span>::symbol(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #ce9178;">"bar"</span>),   <span style="color: #ce9178;">"bar"</span>);
        (<span style="color: #4ec9b0;">Maj</span>::symbol(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #ce9178;">"baz"</span>),   <span style="color: #ce9178;">"baz"</span>);
        (<span style="color: #4ec9b0;">Maj</span>::symbol(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #ce9178;">"t"</span>),     <span style="color: #ce9178;">"t"</span>);
        (<span style="color: #4ec9b0;">Maj</span>::t(),                         <span style="color: #ce9178;">"t"</span>);
        (<span style="color: #4ec9b0;">Maj</span>::symbol(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #ce9178;">"nil"</span>),   <span style="color: #ce9178;">"nil"</span>);
        (<span style="color: #4ec9b0;">Maj</span>::nil(),                       <span style="color: #ce9178;">"nil"</span>);
        (<span style="color: #4ec9b0;">Maj</span>::symbol(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #ce9178;">"&amp;"</span>),     <span style="color: #ce9178;">"&amp;"</span>);
        (<span style="color: #4ec9b0;">Maj</span>::symbol(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #ce9178;">"apply"</span>), <span style="color: #ce9178;">"apply"</span>);
    );
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org141e0c8" class="outline-3">
<h3 id="org141e0c8"><span class="section-number-3">4.2.</span> Cons</h3>
<div class="outline-text-3" id="text-4-2">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #c586c0;">#[test]</span>
<span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">formatter_cons_cell</span>() {
    <span style="color: #569cd6;">let</span> <span style="color: #569cd6;">mut</span> <span style="color: #9cdcfe;">state</span> = <span style="color: #4ec9b0;">MajState</span>::new();
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">foo</span> = <span style="color: #4ec9b0;">Maj</span>::symbol(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #ce9178;">"foo"</span>);
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">bar</span> = <span style="color: #4ec9b0;">Maj</span>::symbol(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #ce9178;">"bar"</span>);
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">baz</span> = <span style="color: #4ec9b0;">Maj</span>::symbol(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #ce9178;">"baz"</span>);

    <span style="color: #c586c0;">multi_test!</span>(
        state;
        (<span style="color: #4ec9b0;">Maj</span>::cons(foo.clone(), bar.clone()),
         <span style="color: #ce9178;">"(foo . bar)"</span>);
        (<span style="color: #4ec9b0;">Maj</span>::cons(foo.clone(),
                   <span style="color: #4ec9b0;">Maj</span>::cons(bar.clone(), baz.clone())),
         <span style="color: #ce9178;">"(foo bar . baz)"</span>);
    );
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orge3ce63d" class="outline-3">
<h3 id="orge3ce63d"><span class="section-number-3">4.3.</span> Caracteres</h3>
<div class="outline-text-3" id="text-4-3">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #c586c0;">#[test]</span>
<span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">formatter_character</span>() {
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">state</span> = <span style="color: #4ec9b0;">MajState</span>::new();
    <span style="color: #c586c0;">multi_test!</span>(
        state;
        (<span style="color: #4ec9b0;">Maj</span>::character(<span style="color: #ce9178;">'a'</span>),    <span style="color: #ce9178;">"#\\a"</span>);
        (<span style="color: #4ec9b0;">Maj</span>::character(<span style="color: #ce9178;">'\x07'</span>), <span style="color: #ce9178;">"#\\&#9223;"</span>);
        (<span style="color: #4ec9b0;">Maj</span>::character(<span style="color: #ce9178;">'\t'</span>),   <span style="color: #ce9178;">"#\\tab"</span>);
        (<span style="color: #4ec9b0;">Maj</span>::character(<span style="color: #ce9178;">' '</span>),    <span style="color: #ce9178;">"#\\space"</span>);
        (<span style="color: #4ec9b0;">Maj</span>::character(<span style="color: #ce9178;">'\n'</span>),   <span style="color: #ce9178;">"#\\newline"</span>);
    );
}
</pre>
</div>
</div>
</div>
