10-testes.org
** Streams

#+begin_src rust
#[test]
fn formatter_stream() {
    use crate::core::types::MajStreamDirection;
    let mut state = MajState::new();
    let stdin  = state.make_stream_stdin();
    let stdout = state.make_stream_stdout();
    let istream = Maj::stream(
        &mut state,
        "test-streams-in.txt",
        MajStreamDirection::In).unwrap();
    let ostream = Maj::stream(
        &mut state,
        "test-streams-out.txt",
        MajStreamDirection::Out).unwrap();

    multi_regex_test!(
        state;
        (stdin,           RE_IN_STREAM);
        (stdout,          RE_OUT_STREAM);
        (istream.clone(), RE_IN_STREAM);
        (ostream.clone(), RE_OUT_STREAM);
    );

    state.close_stream(istream);
    state.close_stream(ostream);
}
#+end_src

** Números

*** Inteiros

#+begin_src rust
#[test]
fn formatter_number_integer() {
    let state = MajState::new();
    multi_test!(
        state;
        (Maj::integer(1), "1");
        (Maj::integer(0), "0");
        (Maj::integer(-1), "-1");
        (Maj::integer(50), "50");
        (Maj::integer(295), "295");
    );
}
#+end_src

*** Frações

Frações  não sofrem  simplificação em  sua criação  para que  não haja
complicações em tipos esperados. Então, ignoramos simplificações.

#+begin_src rust
#[test]
fn formatter_number_fraction() {
    let state = MajState::new();
    multi_test!(
        state;
        (Maj::fraction(2, 3),    "2/3");
        (Maj::fraction(3, 4),    "3/4");
        (Maj::fraction(5, 8),    "5/8");
        (Maj::fraction(99, 100), "99/100");
        (Maj::fraction(5, 2),    "5/2");
        (Maj::fraction(-10, 3),  "-10/3");

        // (Maj::fraction(2, 4),    "1/2");
        // (Maj::fraction(5, 1),    "5");
        // (Maj::fraction(4, -9),   "-4/9");
        // (Maj::fraction(-4, -9),  "4/9");
    );
}
#+end_src

*** Floats

#+begin_src rust
#[test]
fn formatter_number_float() {
    let state = MajState::new();
    multi_test!(
        state;
        (Maj::float(2.0), "2.0");
        (Maj::float(0.5), "0.5");
        (Maj::float(20.2), "20.2");
        (Maj::float(-16.3), "-16.3");
        (Maj::float(-9.0), "-9.0");
        (Maj::float(-7.0), "-7.0");
    );
}
#+end_src

*** Complexos

#+begin_src rust
#[test]
fn formatter_number_complex() {
    let state = MajState::new();
    multi_test!(
        state;
        (Maj::complex(Maj::integer(0),
                      Maj::integer(5)),
         "0J5");
        (Maj::complex(Maj::integer(3),
                      Maj::integer(1)),
         "3J1");
        (Maj::complex(Maj::fraction(2, 3),
                      Maj::float(0.5)),
         "2/3J0.5");
        (Maj::complex(Maj::integer(-2),
                      Maj::integer(-1)),
         "-2J-1");
        (Maj::complex(Maj::float(35.0),
                      Maj::fraction(-2, 9)),
         "35.0J-2/9");
    );
}
#+end_src

** Listas
*** Listas pontuadas

#+begin_src rust
#[test]
fn formatter_dotted_list() {
    let mut state = MajState::new();
    let foo  = Maj::symbol(&mut state, "foo");
    let bar  = Maj::symbol(&mut state, "bar");
    let baz  = Maj::symbol(&mut state, "baz");
    let quux = Maj::symbol(&mut state, "quux");

    multi_test!(
        state;
        (maj_dotted_list!(foo.clone(), bar.clone()),
         "(foo . bar)");
        (maj_dotted_list!(foo.clone(), bar.clone(),
                          baz.clone()),
         "(foo bar . baz)");
        (maj_dotted_list!(foo.clone(), bar.clone(),
                          baz.clone(), quux.clone()),
         "(foo bar baz . quux)");
    );
}
#+end_src

