doc/html/10-testes.html

<div id="outline-container-org6124aa9" class="outline-3">
<h3 id="org6124aa9"><span class="section-number-3">4.4.</span> Streams</h3>
<div class="outline-text-3" id="text-4-4">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #c586c0;">#[test]</span>
<span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">formatter_stream</span>() {
    <span style="color: #569cd6;">use</span> <span style="color: #569cd6;">crate</span>::<span style="color: #569cd6;">core</span>::<span style="color: #569cd6;">types</span>::<span style="color: #4ec9b0;">MajStreamDirection</span>;
    <span style="color: #569cd6;">let</span> <span style="color: #569cd6;">mut</span> <span style="color: #9cdcfe;">state</span> = <span style="color: #4ec9b0;">MajState</span>::new();
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">stdin</span>  = state.make_stream_stdin();
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">stdout</span> = state.make_stream_stdout();
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">istream</span> = <span style="color: #4ec9b0;">Maj</span>::stream(
        <span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state,
        <span style="color: #ce9178;">"test-streams-in.txt"</span>,
        <span style="color: #4ec9b0;">MajStreamDirection</span>::<span style="color: #4ec9b0;">In</span>).unwrap();
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">ostream</span> = <span style="color: #4ec9b0;">Maj</span>::stream(
        <span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state,
        <span style="color: #ce9178;">"test-streams-out.txt"</span>,
        <span style="color: #4ec9b0;">MajStreamDirection</span>::<span style="color: #4ec9b0;">Out</span>).unwrap();

    <span style="color: #c586c0;">multi_regex_test!</span>(
        state;
        (stdin,           <span style="color: #4ec9b0;">RE_IN_STREAM</span>);
        (stdout,          <span style="color: #4ec9b0;">RE_OUT_STREAM</span>);
        (istream.clone(), <span style="color: #4ec9b0;">RE_IN_STREAM</span>);
        (ostream.clone(), <span style="color: #4ec9b0;">RE_OUT_STREAM</span>);
    );

    state.close_stream(istream);
    state.close_stream(ostream);
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org51199f2" class="outline-3">
<h3 id="org51199f2"><span class="section-number-3">4.5.</span> Números</h3>
<div class="outline-text-3" id="text-4-5">
</div>
<div id="outline-container-org3969f11" class="outline-4">
<h4 id="org3969f11"><span class="section-number-4">4.5.1.</span> Inteiros</h4>
<div class="outline-text-4" id="text-4-5-1">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #c586c0;">#[test]</span>
<span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">formatter_number_integer</span>() {
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">state</span> = <span style="color: #4ec9b0;">MajState</span>::new();
    <span style="color: #c586c0;">multi_test!</span>(
        state;
        (<span style="color: #4ec9b0;">Maj</span>::integer(1), <span style="color: #ce9178;">"1"</span>);
        (<span style="color: #4ec9b0;">Maj</span>::integer(0), <span style="color: #ce9178;">"0"</span>);
        (<span style="color: #4ec9b0;">Maj</span>::integer(-1), <span style="color: #ce9178;">"-1"</span>);
        (<span style="color: #4ec9b0;">Maj</span>::integer(50), <span style="color: #ce9178;">"50"</span>);
        (<span style="color: #4ec9b0;">Maj</span>::integer(295), <span style="color: #ce9178;">"295"</span>);
    );
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org54cb902" class="outline-4">
<h4 id="org54cb902"><span class="section-number-4">4.5.2.</span> Frações</h4>
<div class="outline-text-4" id="text-4-5-2">
<p>
Frações  não sofrem  simplificação em  sua criação  para que  não haja
complicações em tipos esperados. Então, ignoramos simplificações.
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #c586c0;">#[test]</span>
<span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">formatter_number_fraction</span>() {
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">state</span> = <span style="color: #4ec9b0;">MajState</span>::new();
    <span style="color: #c586c0;">multi_test!</span>(
        state;
        (<span style="color: #4ec9b0;">Maj</span>::fraction(2, 3),    <span style="color: #ce9178;">"2/3"</span>);
        (<span style="color: #4ec9b0;">Maj</span>::fraction(3, 4),    <span style="color: #ce9178;">"3/4"</span>);
        (<span style="color: #4ec9b0;">Maj</span>::fraction(5, 8),    <span style="color: #ce9178;">"5/8"</span>);
        (<span style="color: #4ec9b0;">Maj</span>::fraction(99, 100), <span style="color: #ce9178;">"99/100"</span>);
        (<span style="color: #4ec9b0;">Maj</span>::fraction(5, 2),    <span style="color: #ce9178;">"5/2"</span>);
        (<span style="color: #4ec9b0;">Maj</span>::fraction(-10, 3),  <span style="color: #ce9178;">"-10/3"</span>);

        <span style="color: #6a9955;">// </span><span style="color: #6a9955;">(Maj::fraction(2, 4),    "1/2");</span>
        <span style="color: #6a9955;">// </span><span style="color: #6a9955;">(Maj::fraction(5, 1),    "5");</span>
        <span style="color: #6a9955;">// </span><span style="color: #6a9955;">(Maj::fraction(4, -9),   "-4/9");</span>
        <span style="color: #6a9955;">// </span><span style="color: #6a9955;">(Maj::fraction(-4, -9),  "4/9");</span>
    );
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org8070859" class="outline-4">
<h4 id="org8070859"><span class="section-number-4">4.5.3.</span> Floats</h4>
<div class="outline-text-4" id="text-4-5-3">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #c586c0;">#[test]</span>
<span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">formatter_number_float</span>() {
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">state</span> = <span style="color: #4ec9b0;">MajState</span>::new();
    <span style="color: #c586c0;">multi_test!</span>(
        state;
        (<span style="color: #4ec9b0;">Maj</span>::float(2.0), <span style="color: #ce9178;">"2.0"</span>);
        (<span style="color: #4ec9b0;">Maj</span>::float(0.5), <span style="color: #ce9178;">"0.5"</span>);
        (<span style="color: #4ec9b0;">Maj</span>::float(20.2), <span style="color: #ce9178;">"20.2"</span>);
        (<span style="color: #4ec9b0;">Maj</span>::float(-16.3), <span style="color: #ce9178;">"-16.3"</span>);
        (<span style="color: #4ec9b0;">Maj</span>::float(-9.0), <span style="color: #ce9178;">"-9.0"</span>);
        (<span style="color: #4ec9b0;">Maj</span>::float(-7.0), <span style="color: #ce9178;">"-7.0"</span>);
    );
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orge22bf2e" class="outline-4">
<h4 id="orge22bf2e"><span class="section-number-4">4.5.4.</span> Complexos</h4>
<div class="outline-text-4" id="text-4-5-4">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #c586c0;">#[test]</span>
<span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">formatter_number_complex</span>() {
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">state</span> = <span style="color: #4ec9b0;">MajState</span>::new();
    <span style="color: #c586c0;">multi_test!</span>(
        state;
        (<span style="color: #4ec9b0;">Maj</span>::complex(<span style="color: #4ec9b0;">Maj</span>::integer(0),
                      <span style="color: #4ec9b0;">Maj</span>::integer(5)),
         <span style="color: #ce9178;">"0J5"</span>);
        (<span style="color: #4ec9b0;">Maj</span>::complex(<span style="color: #4ec9b0;">Maj</span>::integer(3),
                      <span style="color: #4ec9b0;">Maj</span>::integer(1)),
         <span style="color: #ce9178;">"3J1"</span>);
        (<span style="color: #4ec9b0;">Maj</span>::complex(<span style="color: #4ec9b0;">Maj</span>::fraction(2, 3),
                      <span style="color: #4ec9b0;">Maj</span>::float(0.5)),
         <span style="color: #ce9178;">"2/3J0.5"</span>);
        (<span style="color: #4ec9b0;">Maj</span>::complex(<span style="color: #4ec9b0;">Maj</span>::integer(-2),
                      <span style="color: #4ec9b0;">Maj</span>::integer(-1)),
         <span style="color: #ce9178;">"-2J-1"</span>);
        (<span style="color: #4ec9b0;">Maj</span>::complex(<span style="color: #4ec9b0;">Maj</span>::float(35.0),
                      <span style="color: #4ec9b0;">Maj</span>::fraction(-2, 9)),
         <span style="color: #ce9178;">"35.0J-2/9"</span>);
    );
}
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org8933883" class="outline-3">
<h3 id="org8933883"><span class="section-number-3">4.6.</span> Listas</h3>
<div class="outline-text-3" id="text-4-6">
</div>
<div id="outline-container-orge9599f5" class="outline-4">
<h4 id="orge9599f5"><span class="section-number-4">4.6.1.</span> Listas pontuadas</h4>
<div class="outline-text-4" id="text-4-6-1">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #c586c0;">#[test]</span>
<span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">formatter_dotted_list</span>() {
    <span style="color: #569cd6;">let</span> <span style="color: #569cd6;">mut</span> <span style="color: #9cdcfe;">state</span> = <span style="color: #4ec9b0;">MajState</span>::new();
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">foo</span>  = <span style="color: #4ec9b0;">Maj</span>::symbol(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #ce9178;">"foo"</span>);
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">bar</span>  = <span style="color: #4ec9b0;">Maj</span>::symbol(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #ce9178;">"bar"</span>);
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">baz</span>  = <span style="color: #4ec9b0;">Maj</span>::symbol(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #ce9178;">"baz"</span>);
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">quux</span> = <span style="color: #4ec9b0;">Maj</span>::symbol(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #ce9178;">"quux"</span>);

    <span style="color: #c586c0;">multi_test!</span>(
        state;
        (<span style="color: #c586c0;">maj_dotted_list!</span>(foo.clone(), bar.clone()),
         <span style="color: #ce9178;">"(foo . bar)"</span>);
        (<span style="color: #c586c0;">maj_dotted_list!</span>(foo.clone(), bar.clone(),
                          baz.clone()),
         <span style="color: #ce9178;">"(foo bar . baz)"</span>);
        (<span style="color: #c586c0;">maj_dotted_list!</span>(foo.clone(), bar.clone(),
                          baz.clone(), quux.clone()),
         <span style="color: #ce9178;">"(foo bar baz . quux)"</span>);
    );
}
</pre>
</div>
</div>
</div>
