10-testes.org
*** Listas adequadas

#+begin_src rust
#[test]
fn formatter_proper_list() {
    let mut state = MajState::new();
    let foo  = Maj::symbol(&mut state, "foo");
    let bar  = Maj::symbol(&mut state, "bar");
    let baz  = Maj::symbol(&mut state, "baz");
    let quux = Maj::symbol(&mut state, "quux");

    multi_test!(
        state;
        (maj_list!(foo.clone()), "(foo)");
        (maj_list!(foo.clone(), bar.clone()),
         "(foo bar)");
        (maj_list!(foo.clone(), bar.clone(),
                   baz.clone()),
         "(foo bar baz)");
        (maj_list!(foo.clone(), bar.clone(),
                   baz.clone(), quux.clone()),
         "(foo bar baz quux)");
        (maj_list!(Maj::quote(), foo.clone()),
         "'foo");
        (maj_list!(Maj::quasiquote(),
                   maj_list!(
                       foo.clone(),
                       maj_list!(
                           Maj::unquote(),
                           bar.clone()),
                       maj_list!(
                           Maj::unquote_splice(),
                           baz.clone()))),
         "`(foo ,bar ,@baz)");
    );
}
#+end_src

** Vetores
*** Vetores de números inteiros

#+begin_src rust
#[test]
fn formatter_vector_integers() {
    let state = MajState::new();
    multi_test!(
        state;
        (Maj::vector_integer(vec![]), "[]");
        (Maj::vector_integer(vec![1, 2, 3, 4]),
         "[1 2 3 4]");
        (Maj::vector_integer(vec![-10, 2, 5, 93]),
         "[-10 2 5 93]");
    );
}
#+end_src

*** Vetores de pontos flutuantes

#+begin_src rust
#[test]
fn formatter_vector_float() {
    let state = MajState::new();
    multi_test!(
        state;
        (Maj::vector_float(vec![]), "[]");
        (Maj::vector_float(vec![1.0, 2.0, 3.0, 4.0]),
         "[1.0 2.0 3.0 4.0]");
        (Maj::vector_float(vec![-10.0, 2.0, 5.0, 93.0]),
         "[-10.0 2.0 5.0 93.0]");
    );
}
#+end_src

*** Strings

#+begin_src rust
#[test]
fn formatter_string() {
    let state = MajState::new();
    multi_test!(
        state;
        (Maj::string(""), "\"\"");
        (Maj::string("abc"), "\"abc\"");
    );
}
#+end_src

*** Vetores de tipos quaisquer

#+begin_src rust
#[test]
fn formatter_vector_any() {
    let mut state = MajState::new();
    multi_test!(
        state;
        (Maj::vector_any(vec![]), "[]");
        (Maj::vector_any(vec![
            Maj::integer(1),
            Maj::fraction(2, 3),
            Maj::complex(Maj::integer(2),
                         Maj::integer(5)),
            Maj::integer(6),
            maj_list!(Maj::symbol(&mut state, "a"),
                      Maj::symbol(&mut state, "b"),
                      Maj::symbol(&mut state, "c"))]),
         "[1 2/3 2J5 6 (a b c)]");
        (Maj::vector_any(
            vec![Maj::vector_any(vec![]),
                 Maj::vector_any(vec![]),
                 Maj::vector_any(vec![])]),
         "[[] [] []]");
        (Maj::vector_any(
            vec![Maj::character('H'),
                 Maj::character('e'),
                 Maj::character('l'),
                 Maj::character('l'),
                 Maj::character('o')]),
         "[#\\H #\\e #\\l #\\l #\\o]");
    );
}
#+end_src

