doc/html/10-testes.html

<div id="outline-container-orgf443f81" class="outline-4">
<h4 id="orgf443f81"><span class="section-number-4">4.6.2.</span> Listas adequadas</h4>
<div class="outline-text-4" id="text-4-6-2">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #c586c0;">#[test]</span>
<span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">formatter_proper_list</span>() {
    <span style="color: #569cd6;">let</span> <span style="color: #569cd6;">mut</span> <span style="color: #9cdcfe;">state</span> = <span style="color: #4ec9b0;">MajState</span>::new();
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">foo</span>  = <span style="color: #4ec9b0;">Maj</span>::symbol(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #ce9178;">"foo"</span>);
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">bar</span>  = <span style="color: #4ec9b0;">Maj</span>::symbol(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #ce9178;">"bar"</span>);
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">baz</span>  = <span style="color: #4ec9b0;">Maj</span>::symbol(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #ce9178;">"baz"</span>);
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">quux</span> = <span style="color: #4ec9b0;">Maj</span>::symbol(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #ce9178;">"quux"</span>);

    <span style="color: #c586c0;">multi_test!</span>(
        state;
        (<span style="color: #c586c0;">maj_list!</span>(foo.clone()), <span style="color: #ce9178;">"(foo)"</span>);
        (<span style="color: #c586c0;">maj_list!</span>(foo.clone(), bar.clone()),
         <span style="color: #ce9178;">"(foo bar)"</span>);
        (<span style="color: #c586c0;">maj_list!</span>(foo.clone(), bar.clone(),
                   baz.clone()),
         <span style="color: #ce9178;">"(foo bar baz)"</span>);
        (<span style="color: #c586c0;">maj_list!</span>(foo.clone(), bar.clone(),
                   baz.clone(), quux.clone()),
         <span style="color: #ce9178;">"(foo bar baz quux)"</span>);
        (<span style="color: #c586c0;">maj_list!</span>(<span style="color: #4ec9b0;">Maj</span>::quote(), foo.clone()),
         <span style="color: #ce9178;">"'foo"</span>);
        (<span style="color: #c586c0;">maj_list!</span>(<span style="color: #4ec9b0;">Maj</span>::quasiquote(),
                   <span style="color: #c586c0;">maj_list!</span>(
                       foo.clone(),
                       <span style="color: #c586c0;">maj_list!</span>(
                           <span style="color: #4ec9b0;">Maj</span>::unquote(),
                           bar.clone()),
                       <span style="color: #c586c0;">maj_list!</span>(
                           <span style="color: #4ec9b0;">Maj</span>::unquote_splice(),
                           baz.clone()))),
         <span style="color: #ce9178;">"`(foo ,bar ,@baz)"</span>);
    );
}
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org4e967de" class="outline-3">
<h3 id="org4e967de"><span class="section-number-3">4.7.</span> Vetores</h3>
<div class="outline-text-3" id="text-4-7">
</div>
<div id="outline-container-orgfac4303" class="outline-4">
<h4 id="orgfac4303"><span class="section-number-4">4.7.1.</span> Vetores de números inteiros</h4>
<div class="outline-text-4" id="text-4-7-1">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #c586c0;">#[test]</span>
<span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">formatter_vector_integers</span>() {
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">state</span> = <span style="color: #4ec9b0;">MajState</span>::new();
    <span style="color: #c586c0;">multi_test!</span>(
        state;
        (<span style="color: #4ec9b0;">Maj</span>::vector_integer(<span style="color: #c586c0;">vec!</span>[]), <span style="color: #ce9178;">"[]"</span>);
        (<span style="color: #4ec9b0;">Maj</span>::vector_integer(<span style="color: #c586c0;">vec!</span>[1, 2, 3, 4]),
         <span style="color: #ce9178;">"[1 2 3 4]"</span>);
        (<span style="color: #4ec9b0;">Maj</span>::vector_integer(<span style="color: #c586c0;">vec!</span>[-10, 2, 5, 93]),
         <span style="color: #ce9178;">"[-10 2 5 93]"</span>);
    );
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org59e4b88" class="outline-4">
<h4 id="org59e4b88"><span class="section-number-4">4.7.2.</span> Vetores de pontos flutuantes</h4>
<div class="outline-text-4" id="text-4-7-2">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #c586c0;">#[test]</span>
<span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">formatter_vector_float</span>() {
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">state</span> = <span style="color: #4ec9b0;">MajState</span>::new();
    <span style="color: #c586c0;">multi_test!</span>(
        state;
        (<span style="color: #4ec9b0;">Maj</span>::vector_float(<span style="color: #c586c0;">vec!</span>[]), <span style="color: #ce9178;">"[]"</span>);
        (<span style="color: #4ec9b0;">Maj</span>::vector_float(<span style="color: #c586c0;">vec!</span>[1.0, 2.0, 3.0, 4.0]),
         <span style="color: #ce9178;">"[1.0 2.0 3.0 4.0]"</span>);
        (<span style="color: #4ec9b0;">Maj</span>::vector_float(<span style="color: #c586c0;">vec!</span>[-10.0, 2.0, 5.0, 93.0]),
         <span style="color: #ce9178;">"[-10.0 2.0 5.0 93.0]"</span>);
    );
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org15bfa2a" class="outline-4">
<h4 id="org15bfa2a"><span class="section-number-4">4.7.3.</span> Strings</h4>
<div class="outline-text-4" id="text-4-7-3">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #c586c0;">#[test]</span>
<span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">formatter_string</span>() {
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">state</span> = <span style="color: #4ec9b0;">MajState</span>::new();
    <span style="color: #c586c0;">multi_test!</span>(
        state;
        (<span style="color: #4ec9b0;">Maj</span>::string(<span style="color: #ce9178;">""</span>), <span style="color: #ce9178;">"\"\""</span>);
        (<span style="color: #4ec9b0;">Maj</span>::string(<span style="color: #ce9178;">"abc"</span>), <span style="color: #ce9178;">"\"abc\""</span>);
    );
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orgc26c0d3" class="outline-4">
<h4 id="orgc26c0d3"><span class="section-number-4">4.7.4.</span> Vetores de tipos quaisquer</h4>
<div class="outline-text-4" id="text-4-7-4">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #c586c0;">#[test]</span>
<span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">formatter_vector_any</span>() {
    <span style="color: #569cd6;">let</span> <span style="color: #569cd6;">mut</span> <span style="color: #9cdcfe;">state</span> = <span style="color: #4ec9b0;">MajState</span>::new();
    <span style="color: #c586c0;">multi_test!</span>(
        state;
        (<span style="color: #4ec9b0;">Maj</span>::vector_any(<span style="color: #c586c0;">vec!</span>[]), <span style="color: #ce9178;">"[]"</span>);
        (<span style="color: #4ec9b0;">Maj</span>::vector_any(<span style="color: #c586c0;">vec!</span>[
            <span style="color: #4ec9b0;">Maj</span>::integer(1),
            <span style="color: #4ec9b0;">Maj</span>::fraction(2, 3),
            <span style="color: #4ec9b0;">Maj</span>::complex(<span style="color: #4ec9b0;">Maj</span>::integer(2),
                         <span style="color: #4ec9b0;">Maj</span>::integer(5)),
            <span style="color: #4ec9b0;">Maj</span>::integer(6),
            <span style="color: #c586c0;">maj_list!</span>(<span style="color: #4ec9b0;">Maj</span>::symbol(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #ce9178;">"a"</span>),
                      <span style="color: #4ec9b0;">Maj</span>::symbol(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #ce9178;">"b"</span>),
                      <span style="color: #4ec9b0;">Maj</span>::symbol(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #ce9178;">"c"</span>))]),
         <span style="color: #ce9178;">"[1 2/3 2J5 6 (a b c)]"</span>);
        (<span style="color: #4ec9b0;">Maj</span>::vector_any(
            <span style="color: #c586c0;">vec!</span>[<span style="color: #4ec9b0;">Maj</span>::vector_any(<span style="color: #c586c0;">vec!</span>[]),
                 <span style="color: #4ec9b0;">Maj</span>::vector_any(<span style="color: #c586c0;">vec!</span>[]),
                 <span style="color: #4ec9b0;">Maj</span>::vector_any(<span style="color: #c586c0;">vec!</span>[])]),
         <span style="color: #ce9178;">"[[] [] []]"</span>);
        (<span style="color: #4ec9b0;">Maj</span>::vector_any(
            <span style="color: #c586c0;">vec!</span>[<span style="color: #4ec9b0;">Maj</span>::character(<span style="color: #ce9178;">'H'</span>),
                 <span style="color: #4ec9b0;">Maj</span>::character(<span style="color: #ce9178;">'e'</span>),
                 <span style="color: #4ec9b0;">Maj</span>::character(<span style="color: #ce9178;">'l'</span>),
                 <span style="color: #4ec9b0;">Maj</span>::character(<span style="color: #ce9178;">'l'</span>),
                 <span style="color: #4ec9b0;">Maj</span>::character(<span style="color: #ce9178;">'o'</span>)]),
         <span style="color: #ce9178;">"[#\\H #\\e #\\l #\\l #\\o]"</span>);
    );
}
</pre>
</div>
</div>
</div>
</div>
