10-testes.org
** Clausuras

#+begin_src rust
#[test]
fn formatter_closure() {
    let mut state = MajState::new();
    let x = Maj::symbol(&mut state, "x");
    let fst = Maj::symbol(&mut state, "fst");
    let snd = Maj::symbol(&mut state, "snd");
    let rest = Maj::symbol(&mut state, "rest");
    multi_regex_test!(
        state;
        // (lit closure nil (x) ((* x x)))
        // #<function (fn (x)) {0x...}>
        (maj_list!(Maj::lit(), Maj::closure(), Maj::nil(),
                   maj_list!(x.clone()),
                   maj_list!(
                       maj_list!(Maj::symbol(&mut state, "*"),
                                 x.clone(), x.clone()))),
         RE_CLOSURE);
        // (lit closure nil nil (2))
        // #<function (fn nil) {0x...}>
        (maj_list!(Maj::lit(), Maj::closure(), Maj::nil(),
                   Maj::nil(),
                   maj_list!(Maj::integer(2))),
         RE_CLOSURE);
        // (lit closure nil (x . rest) ((x)))
        // #<function (fn (x . rest)) {0x...}>
        (maj_list!(Maj::lit(), Maj::closure(), Maj::nil(),
                   maj_dotted_list!(x.clone(),
                                    rest.clone()),
                   maj_list!(maj_list!(x.clone()))),
         RE_CLOSURE);
        // (lit closure nil (fst snd . rest) ((fst)))
        // #<function (fn (fst snd . rest)) {0x...}>
        (maj_list!(Maj::lit(), Maj::closure(), Maj::nil(),
                   maj_dotted_list!(fst.clone(),
                                    snd.clone(),
                                    rest.clone()),
                   maj_list!(maj_list!(fst.clone()))),
         RE_CLOSURE);
    );
    test_fail_regex!(state,
                     // (lit 2)
                     maj_list!(Maj::lit(), Maj::integer(2)),
                     RE_CLOSURE);
}
#+end_src

** Primitivas

#+begin_src rust
#[test]
fn formatter_primitive() {
    let mut state = MajState::new();

    let prim_fetch = |mut state: &mut MajState, name| {
        let sym = Maj::symbol(&mut state, name);
        let result =
            maj_eval(&mut state, sym, Maj::nil());
        assert!(!maj_errorp(result.clone()).to_bool());
        result
    };
    
    multi_regex_test! {
        state;
        // (lit prim cons required 2) => (defn cons (a b) ...)
        (prim_fetch(&mut state, "cons"), RE_PRIMITIVE);
        // (lit prim coin nil nil) => (defn coin () ...)
        (prim_fetch(&mut state, "coin"), RE_PRIMITIVE);
        // (lit prim print variadic 1) => (defn print (fmt . rest) ...)
        (prim_fetch(&mut state, "print"), RE_PRIMITIVE);
        // (lit prim list variadic 0) => (defn list rest ...)
        (prim_fetch(&mut state, "list"), RE_PRIMITIVE);
    }
}
#+end_src

