doc/html/10-testes.html

<div id="outline-container-orge272689" class="outline-3">
<h3 id="orge272689"><span class="section-number-3">4.8.</span> Clausuras</h3>
<div class="outline-text-3" id="text-4-8">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #c586c0;">#[test]</span>
<span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">formatter_closure</span>() {
    <span style="color: #569cd6;">let</span> <span style="color: #569cd6;">mut</span> <span style="color: #9cdcfe;">state</span> = <span style="color: #4ec9b0;">MajState</span>::new();
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">x</span> = <span style="color: #4ec9b0;">Maj</span>::symbol(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #ce9178;">"x"</span>);
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">fst</span> = <span style="color: #4ec9b0;">Maj</span>::symbol(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #ce9178;">"fst"</span>);
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">snd</span> = <span style="color: #4ec9b0;">Maj</span>::symbol(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #ce9178;">"snd"</span>);
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">rest</span> = <span style="color: #4ec9b0;">Maj</span>::symbol(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #ce9178;">"rest"</span>);
    <span style="color: #c586c0;">multi_regex_test!</span>(
        state;
        <span style="color: #6a9955;">// </span><span style="color: #6a9955;">(lit closure nil (x) ((* x x)))</span>
        <span style="color: #6a9955;">// </span><span style="color: #6a9955;">#&lt;function (fn (x)) {0x...}&gt;</span>
        (<span style="color: #c586c0;">maj_list!</span>(<span style="color: #4ec9b0;">Maj</span>::lit(), <span style="color: #4ec9b0;">Maj</span>::closure(), <span style="color: #4ec9b0;">Maj</span>::nil(),
                   <span style="color: #c586c0;">maj_list!</span>(x.clone()),
                   <span style="color: #c586c0;">maj_list!</span>(
                       <span style="color: #c586c0;">maj_list!</span>(<span style="color: #4ec9b0;">Maj</span>::symbol(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #ce9178;">"*"</span>),
                                 x.clone(), x.clone()))),
         <span style="color: #4ec9b0;">RE_CLOSURE</span>);
        <span style="color: #6a9955;">// </span><span style="color: #6a9955;">(lit closure nil nil (2))</span>
        <span style="color: #6a9955;">// </span><span style="color: #6a9955;">#&lt;function (fn nil) {0x...}&gt;</span>
        (<span style="color: #c586c0;">maj_list!</span>(<span style="color: #4ec9b0;">Maj</span>::lit(), <span style="color: #4ec9b0;">Maj</span>::closure(), <span style="color: #4ec9b0;">Maj</span>::nil(),
                   <span style="color: #4ec9b0;">Maj</span>::nil(),
                   <span style="color: #c586c0;">maj_list!</span>(<span style="color: #4ec9b0;">Maj</span>::integer(2))),
         <span style="color: #4ec9b0;">RE_CLOSURE</span>);
        <span style="color: #6a9955;">// </span><span style="color: #6a9955;">(lit closure nil (x . rest) ((x)))</span>
        <span style="color: #6a9955;">// </span><span style="color: #6a9955;">#&lt;function (fn (x . rest)) {0x...}&gt;</span>
        (<span style="color: #c586c0;">maj_list!</span>(<span style="color: #4ec9b0;">Maj</span>::lit(), <span style="color: #4ec9b0;">Maj</span>::closure(), <span style="color: #4ec9b0;">Maj</span>::nil(),
                   <span style="color: #c586c0;">maj_dotted_list!</span>(x.clone(),
                                    rest.clone()),
                   <span style="color: #c586c0;">maj_list!</span>(<span style="color: #c586c0;">maj_list!</span>(x.clone()))),
         <span style="color: #4ec9b0;">RE_CLOSURE</span>);
        <span style="color: #6a9955;">// </span><span style="color: #6a9955;">(lit closure nil (fst snd . rest) ((fst)))</span>
        <span style="color: #6a9955;">// </span><span style="color: #6a9955;">#&lt;function (fn (fst snd . rest)) {0x...}&gt;</span>
        (<span style="color: #c586c0;">maj_list!</span>(<span style="color: #4ec9b0;">Maj</span>::lit(), <span style="color: #4ec9b0;">Maj</span>::closure(), <span style="color: #4ec9b0;">Maj</span>::nil(),
                   <span style="color: #c586c0;">maj_dotted_list!</span>(fst.clone(),
                                    snd.clone(),
                                    rest.clone()),
                   <span style="color: #c586c0;">maj_list!</span>(<span style="color: #c586c0;">maj_list!</span>(fst.clone()))),
         <span style="color: #4ec9b0;">RE_CLOSURE</span>);
    );
    <span style="color: #c586c0;">test_fail_regex!</span>(state,
                     <span style="color: #6a9955;">// </span><span style="color: #6a9955;">(lit 2)</span>
                     <span style="color: #c586c0;">maj_list!</span>(<span style="color: #4ec9b0;">Maj</span>::lit(), <span style="color: #4ec9b0;">Maj</span>::integer(2)),
                     <span style="color: #4ec9b0;">RE_CLOSURE</span>);
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orgb088d37" class="outline-3">
<h3 id="orgb088d37"><span class="section-number-3">4.9.</span> Primitivas</h3>
<div class="outline-text-3" id="text-4-9">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #c586c0;">#[test]</span>
<span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">formatter_primitive</span>() {
    <span style="color: #569cd6;">let</span> <span style="color: #569cd6;">mut</span> <span style="color: #9cdcfe;">state</span> = <span style="color: #4ec9b0;">MajState</span>::new();

    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">prim_fetch</span> = |<span style="color: #569cd6;">mut</span> <span style="color: #9cdcfe;">state</span>: <span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> <span style="color: #4ec9b0;">MajState</span>, name| {
        <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">sym</span> = <span style="color: #4ec9b0;">Maj</span>::symbol(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, name);
        <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">result</span> =
            maj_eval(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, sym, <span style="color: #4ec9b0;">Maj</span>::nil());
        <span style="color: #c586c0;">assert!</span>(!maj_errorp(result.clone()).to_bool());
        result
    };
    
    <span style="color: #c586c0;">multi_regex_test!</span> {
        state;
        <span style="color: #6a9955;">// </span><span style="color: #6a9955;">(lit prim cons required 2) =&gt; (defn cons (a b) ...)</span>
        (prim_fetch(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #ce9178;">"cons"</span>), <span style="color: #4ec9b0;">RE_PRIMITIVE</span>);
        <span style="color: #6a9955;">// </span><span style="color: #6a9955;">(lit prim coin nil nil) =&gt; (defn coin () ...)</span>
        (prim_fetch(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #ce9178;">"coin"</span>), <span style="color: #4ec9b0;">RE_PRIMITIVE</span>);
        <span style="color: #6a9955;">// </span><span style="color: #6a9955;">(lit prim print variadic 1) =&gt; (defn print (fmt . rest) ...)</span>
        (prim_fetch(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #ce9178;">"print"</span>), <span style="color: #4ec9b0;">RE_PRIMITIVE</span>);
        <span style="color: #6a9955;">// </span><span style="color: #6a9955;">(lit prim list variadic 0) =&gt; (defn list rest ...)</span>
        (prim_fetch(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #ce9178;">"list"</span>), <span style="color: #4ec9b0;">RE_PRIMITIVE</span>);
    }
}
</pre>
</div>
</div>
</div>
