10-testes.org
** Macros

Isso aqui  acaba sendo  um quase  um copypaste  descarado do  teste de
clausuras, mas com algumas modificações.

#+begin_src rust
#[test]
fn formatter_macro() {
    let mut state = MajState::new();

    let x = Maj::symbol(&mut state, "x");
    let fst = Maj::symbol(&mut state, "fst");
    let snd = Maj::symbol(&mut state, "snd");
    let rest = Maj::symbol(&mut state, "rest");
    
    let macro_writer = |lambda_list, body| {
        // (lit macro (lit closure nil <lambda-list> <body>))
        // where <body> is also a list of many expressions
        maj_list!(Maj::lit(), Maj::macro_sym(),
                  maj_list!(
                      Maj::lit(),
                      Maj::closure(),
                      Maj::nil(),
                      lambda_list, body))
    };

    multi_regex_test!(
        state;
        // #<macro (mac (x)) {0x...}>
        // (mac (x) x)
        (macro_writer(
            maj_list!(x.clone()),
            maj_list!(x.clone())),
         RE_MACRO);
        // #<macro (mac nil) {0x...}>
        // (mac () x)
        (macro_writer(
            Maj::nil(),
            maj_list!(x.clone())),
         RE_MACRO);
        
        // #<macro (mac (x . rest)) {0x...}>
        // (mac (x . rest) (x rest))
        (macro_writer(
            maj_dotted_list!(x.clone(), rest.clone()),
            maj_list!(x.clone(), rest.clone())),
         RE_MACRO);
        
        // #<macro (mac (fst snd . rest)) {0x...}>
        // (mac (fst snd . rest) (fst snd rest))
        (macro_writer(
            maj_dotted_list!(fst.clone(), snd.clone(),
                             rest.clone()),
            maj_list!(fst.clone(), snd.clone(), rest.clone())),
         RE_MACRO);
    );
}
#+end_src

** Erros

#+begin_src rust
#[test]
fn formatter_error() {
    let state = MajState::new();

    let error_writer = |format, args| {
        maj_dotted_list!(
            Maj::lit(), Maj::error(),
            format, args)
    };
    
    multi_test!(
        state;
        (error_writer(Maj::string("Hello"),
                      Maj::nil()),
         "Hello");
        (error_writer(Maj::string("Hello, {}"),
                      maj_list!(
                          Maj::string("world"))),
         "Hello, world");
        (error_writer(Maj::string("{} + {} = {}"),
                      maj_list!(
                          Maj::integer(1),
                          Maj::integer(2),
                          Maj::integer(3))),
         "1 + 2 = 3");
        (error_writer(Maj::string("{} is not a list such as {}"),
                      maj_list!(
                          Maj::cons(Maj::integer(1),
                                    Maj::integer(2)),
                          maj_list!(Maj::integer(1),
                                    Maj::integer(2)))),
         "(1 . 2) is not a list such as (1 2)");
    );
}
#+end_src

** TODO Pretty-printing

#+begin_src rust
#[test]
#[ignore]
fn formatter_prettyprinting() {
    unimplemented!();
}
#+end_src

