doc/html/10-testes.html

<div id="outline-container-orgfe16b0d" class="outline-3">
<h3 id="orgfe16b0d"><span class="section-number-3">4.10.</span> Macros</h3>
<div class="outline-text-3" id="text-4-10">
<p>
Isso aqui  acaba sendo  um quase  um copypaste  descarado do  teste de
clausuras, mas com algumas modificações.
</p>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #c586c0;">#[test]</span>
<span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">formatter_macro</span>() {
    <span style="color: #569cd6;">let</span> <span style="color: #569cd6;">mut</span> <span style="color: #9cdcfe;">state</span> = <span style="color: #4ec9b0;">MajState</span>::new();

    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">x</span> = <span style="color: #4ec9b0;">Maj</span>::symbol(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #ce9178;">"x"</span>);
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">fst</span> = <span style="color: #4ec9b0;">Maj</span>::symbol(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #ce9178;">"fst"</span>);
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">snd</span> = <span style="color: #4ec9b0;">Maj</span>::symbol(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #ce9178;">"snd"</span>);
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">rest</span> = <span style="color: #4ec9b0;">Maj</span>::symbol(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #ce9178;">"rest"</span>);
    
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">macro_writer</span> = |lambda_list, body| {
        <span style="color: #6a9955;">// </span><span style="color: #6a9955;">(lit macro (lit closure nil &lt;lambda-list&gt; &lt;body&gt;))</span>
        <span style="color: #6a9955;">// </span><span style="color: #6a9955;">where &lt;body&gt; is also a list of many expressions</span>
        <span style="color: #c586c0;">maj_list!</span>(<span style="color: #4ec9b0;">Maj</span>::lit(), <span style="color: #4ec9b0;">Maj</span>::macro_sym(),
                  <span style="color: #c586c0;">maj_list!</span>(
                      <span style="color: #4ec9b0;">Maj</span>::lit(),
                      <span style="color: #4ec9b0;">Maj</span>::closure(),
                      <span style="color: #4ec9b0;">Maj</span>::nil(),
                      lambda_list, body))
    };

    <span style="color: #c586c0;">multi_regex_test!</span>(
        state;
        <span style="color: #6a9955;">// </span><span style="color: #6a9955;">#&lt;macro (mac (x)) {0x...}&gt;</span>
        <span style="color: #6a9955;">// </span><span style="color: #6a9955;">(mac (x) x)</span>
        (macro_writer(
            <span style="color: #c586c0;">maj_list!</span>(x.clone()),
            <span style="color: #c586c0;">maj_list!</span>(x.clone())),
         <span style="color: #4ec9b0;">RE_MACRO</span>);
        <span style="color: #6a9955;">// </span><span style="color: #6a9955;">#&lt;macro (mac nil) {0x...}&gt;</span>
        <span style="color: #6a9955;">// </span><span style="color: #6a9955;">(mac () x)</span>
        (macro_writer(
            <span style="color: #4ec9b0;">Maj</span>::nil(),
            <span style="color: #c586c0;">maj_list!</span>(x.clone())),
         <span style="color: #4ec9b0;">RE_MACRO</span>);
        
        <span style="color: #6a9955;">// </span><span style="color: #6a9955;">#&lt;macro (mac (x . rest)) {0x...}&gt;</span>
        <span style="color: #6a9955;">// </span><span style="color: #6a9955;">(mac (x . rest) (x rest))</span>
        (macro_writer(
            <span style="color: #c586c0;">maj_dotted_list!</span>(x.clone(), rest.clone()),
            <span style="color: #c586c0;">maj_list!</span>(x.clone(), rest.clone())),
         <span style="color: #4ec9b0;">RE_MACRO</span>);
        
        <span style="color: #6a9955;">// </span><span style="color: #6a9955;">#&lt;macro (mac (fst snd . rest)) {0x...}&gt;</span>
        <span style="color: #6a9955;">// </span><span style="color: #6a9955;">(mac (fst snd . rest) (fst snd rest))</span>
        (macro_writer(
            <span style="color: #c586c0;">maj_dotted_list!</span>(fst.clone(), snd.clone(),
                             rest.clone()),
            <span style="color: #c586c0;">maj_list!</span>(fst.clone(), snd.clone(), rest.clone())),
         <span style="color: #4ec9b0;">RE_MACRO</span>);
    );
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org2603aee" class="outline-3">
<h3 id="org2603aee"><span class="section-number-3">4.11.</span> Erros</h3>
<div class="outline-text-3" id="text-4-11">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #c586c0;">#[test]</span>
<span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">formatter_error</span>() {
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">state</span> = <span style="color: #4ec9b0;">MajState</span>::new();

    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">error_writer</span> = |format, args| {
        <span style="color: #c586c0;">maj_dotted_list!</span>(
            <span style="color: #4ec9b0;">Maj</span>::lit(), <span style="color: #4ec9b0;">Maj</span>::error(),
            format, args)
    };
    
    <span style="color: #c586c0;">multi_test!</span>(
        state;
        (error_writer(<span style="color: #4ec9b0;">Maj</span>::string(<span style="color: #ce9178;">"Hello"</span>),
                      <span style="color: #4ec9b0;">Maj</span>::nil()),
         <span style="color: #ce9178;">"Hello"</span>);
        (error_writer(<span style="color: #4ec9b0;">Maj</span>::string(<span style="color: #ce9178;">"Hello, {}"</span>),
                      <span style="color: #c586c0;">maj_list!</span>(
                          <span style="color: #4ec9b0;">Maj</span>::string(<span style="color: #ce9178;">"world"</span>))),
         <span style="color: #ce9178;">"Hello, world"</span>);
        (error_writer(<span style="color: #4ec9b0;">Maj</span>::string(<span style="color: #ce9178;">"{} + {} = {}"</span>),
                      <span style="color: #c586c0;">maj_list!</span>(
                          <span style="color: #4ec9b0;">Maj</span>::integer(1),
                          <span style="color: #4ec9b0;">Maj</span>::integer(2),
                          <span style="color: #4ec9b0;">Maj</span>::integer(3))),
         <span style="color: #ce9178;">"1 + 2 = 3"</span>);
        (error_writer(<span style="color: #4ec9b0;">Maj</span>::string(<span style="color: #ce9178;">"{} is not a list such as {}"</span>),
                      <span style="color: #c586c0;">maj_list!</span>(
                          <span style="color: #4ec9b0;">Maj</span>::cons(<span style="color: #4ec9b0;">Maj</span>::integer(1),
                                    <span style="color: #4ec9b0;">Maj</span>::integer(2)),
                          <span style="color: #c586c0;">maj_list!</span>(<span style="color: #4ec9b0;">Maj</span>::integer(1),
                                    <span style="color: #4ec9b0;">Maj</span>::integer(2)))),
         <span style="color: #ce9178;">"(1 . 2) is not a list such as (1 2)"</span>);
    );
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org33d147a" class="outline-3">
<h3 id="org33d147a"><span class="section-number-3">4.12.</span> <span class="todo TODO">TODO</span> Pretty-printing</h3>
<div class="outline-text-3" id="text-4-12">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #c586c0;">#[test]</span>
<span style="color: #c586c0;">#[ignore]</span>
<span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">formatter_prettyprinting</span>() {
    <span style="color: #c586c0;">unimplemented!</span>();
}
</pre>
</div>
</div>
</div>
</div>
