10-testes.org
* Coerções numéricas

#+begin_src rust
#[test]
fn number_coercion() {
    use crate::axioms::primitives::maj_number_coerce;
    let mut state = MajState::new();
    let integer  = Maj::symbol(&mut state, "integer");
    let fraction = Maj::symbol(&mut state, "fraction");
    let float    = Maj::symbol(&mut state, "float");
    let complex  = Maj::symbol(&mut state, "complex");

    multi_test!(
        state;
        
        // Integer coercion
        (maj_number_coerce(&mut state, integer.clone(),
                           Maj::integer(5)),
         "5");
        (maj_number_coerce(&mut state, float.clone(),
                           Maj::integer(5)),
         "5.0");
        (maj_number_coerce(&mut state, fraction.clone(),
                           Maj::integer(5)),
         "5/1");
        (maj_number_coerce(&mut state, complex.clone(),
                           Maj::integer(5)),
         "5J0.0");

        // Float coercion
        (maj_number_coerce(&mut state, integer.clone(),
                           Maj::float(5.3)),
         "5");
        (maj_number_coerce(&mut state, float.clone(),
                           Maj::float(5.3)),
         "5.3");
        (maj_number_coerce(&mut state, fraction.clone(),
                           Maj::float(5.3)),
         "53/10");
        (maj_number_coerce(&mut state, complex.clone(),
                           Maj::float(5.3)),
         "5.3J0.0");

        // Fraction coercion
        (maj_number_coerce(&mut state, integer.clone(),
                           Maj::fraction(3, 2)),
         "1");
        (maj_number_coerce(&mut state, float.clone(),
                           Maj::fraction(3, 2)),
         "1.5");
        (maj_number_coerce(&mut state, fraction.clone(),
                           Maj::fraction(3, 2)),
         "3/2");
        (maj_number_coerce(&mut state, complex.clone(),
                           Maj::fraction(3, 2)),
         "3/2J0.0");

        // Complex coercion
        (maj_number_coerce(&mut state, integer.clone(),
                           Maj::complex(
                               Maj::integer(3),
                               Maj::integer(2))),
         "3");
        (maj_number_coerce(&mut state, float.clone(),
                           Maj::complex(
                               Maj::integer(3),
                               Maj::integer(2))),
         "3.0");
        (maj_number_coerce(&mut state, fraction.clone(),
                           Maj::complex(
                               Maj::integer(3),
                               Maj::integer(2))),
         "3/1");
        (maj_number_coerce(&mut state, complex.clone(),
                           Maj::complex(
                               Maj::integer(3),
                               Maj::integer(2))),
         "3J2");
    );
}
#+end_src

* Funções

** Predicados

*** ~symbolp~

#+begin_src rust
#[test]
fn predicates_symbolp() {
    use crate::axioms::predicates::maj_symbolp;
    multi_boolean_test!(
        (maj_symbolp(Maj::t()), true);
        (maj_symbolp(Maj::fraction(2, 3)), false);
    );
}
#+end_src

*** ~eq~

#+begin_src rust
#[test]
fn predicates_eq() {
    use crate::axioms::predicates::maj_eq;
    multi_boolean_test!(
        (maj_eq(Maj::t(), Maj::t()), true);
        (maj_eq(Maj::nil(), Maj::nil()), true);
        (maj_eq(Maj::t(), Maj::nil()), false);
        (maj_eq(Maj::integer(20), Maj::t()), false);
    );
}
#+end_src

*** ~nilp~

#+begin_src rust
#[test]
fn predicates_nilp() {
    use crate::axioms::predicates::maj_nilp;
    multi_boolean_test!(
        (maj_nilp(Maj::nil()), true);
        (maj_nilp(Maj::integer(5)), false);
    );
}
#+end_src

