doc/html/10-testes.html

<div id="outline-container-org3f68952" class="outline-2">
<h2 id="org3f68952"><span class="section-number-2">5.</span> Coerções numéricas</h2>
<div class="outline-text-2" id="text-5">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #c586c0;">#[test]</span>
<span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">number_coercion</span>() {
    <span style="color: #569cd6;">use</span> <span style="color: #569cd6;">crate</span>::<span style="color: #569cd6;">axioms</span>::<span style="color: #569cd6;">primitives</span>::maj_number_coerce;
    <span style="color: #569cd6;">let</span> <span style="color: #569cd6;">mut</span> <span style="color: #9cdcfe;">state</span> = <span style="color: #4ec9b0;">MajState</span>::new();
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">integer</span>  = <span style="color: #4ec9b0;">Maj</span>::symbol(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #ce9178;">"integer"</span>);
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">fraction</span> = <span style="color: #4ec9b0;">Maj</span>::symbol(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #ce9178;">"fraction"</span>);
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">float</span>    = <span style="color: #4ec9b0;">Maj</span>::symbol(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #ce9178;">"float"</span>);
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">complex</span>  = <span style="color: #4ec9b0;">Maj</span>::symbol(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #ce9178;">"complex"</span>);

    <span style="color: #c586c0;">multi_test!</span>(
        state;
        
        <span style="color: #6a9955;">// </span><span style="color: #6a9955;">Integer coercion</span>
        (maj_number_coerce(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, integer.clone(),
                           <span style="color: #4ec9b0;">Maj</span>::integer(5)),
         <span style="color: #ce9178;">"5"</span>);
        (maj_number_coerce(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, float.clone(),
                           <span style="color: #4ec9b0;">Maj</span>::integer(5)),
         <span style="color: #ce9178;">"5.0"</span>);
        (maj_number_coerce(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, fraction.clone(),
                           <span style="color: #4ec9b0;">Maj</span>::integer(5)),
         <span style="color: #ce9178;">"5/1"</span>);
        (maj_number_coerce(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, complex.clone(),
                           <span style="color: #4ec9b0;">Maj</span>::integer(5)),
         <span style="color: #ce9178;">"5J0.0"</span>);

        <span style="color: #6a9955;">// </span><span style="color: #6a9955;">Float coercion</span>
        (maj_number_coerce(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, integer.clone(),
                           <span style="color: #4ec9b0;">Maj</span>::float(5.3)),
         <span style="color: #ce9178;">"5"</span>);
        (maj_number_coerce(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, float.clone(),
                           <span style="color: #4ec9b0;">Maj</span>::float(5.3)),
         <span style="color: #ce9178;">"5.3"</span>);
        (maj_number_coerce(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, fraction.clone(),
                           <span style="color: #4ec9b0;">Maj</span>::float(5.3)),
         <span style="color: #ce9178;">"53/10"</span>);
        (maj_number_coerce(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, complex.clone(),
                           <span style="color: #4ec9b0;">Maj</span>::float(5.3)),
         <span style="color: #ce9178;">"5.3J0.0"</span>);

        <span style="color: #6a9955;">// </span><span style="color: #6a9955;">Fraction coercion</span>
        (maj_number_coerce(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, integer.clone(),
                           <span style="color: #4ec9b0;">Maj</span>::fraction(3, 2)),
         <span style="color: #ce9178;">"1"</span>);
        (maj_number_coerce(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, float.clone(),
                           <span style="color: #4ec9b0;">Maj</span>::fraction(3, 2)),
         <span style="color: #ce9178;">"1.5"</span>);
        (maj_number_coerce(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, fraction.clone(),
                           <span style="color: #4ec9b0;">Maj</span>::fraction(3, 2)),
         <span style="color: #ce9178;">"3/2"</span>);
        (maj_number_coerce(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, complex.clone(),
                           <span style="color: #4ec9b0;">Maj</span>::fraction(3, 2)),
         <span style="color: #ce9178;">"3/2J0.0"</span>);

        <span style="color: #6a9955;">// </span><span style="color: #6a9955;">Complex coercion</span>
        (maj_number_coerce(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, integer.clone(),
                           <span style="color: #4ec9b0;">Maj</span>::complex(
                               <span style="color: #4ec9b0;">Maj</span>::integer(3),
                               <span style="color: #4ec9b0;">Maj</span>::integer(2))),
         <span style="color: #ce9178;">"3"</span>);
        (maj_number_coerce(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, float.clone(),
                           <span style="color: #4ec9b0;">Maj</span>::complex(
                               <span style="color: #4ec9b0;">Maj</span>::integer(3),
                               <span style="color: #4ec9b0;">Maj</span>::integer(2))),
         <span style="color: #ce9178;">"3.0"</span>);
        (maj_number_coerce(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, fraction.clone(),
                           <span style="color: #4ec9b0;">Maj</span>::complex(
                               <span style="color: #4ec9b0;">Maj</span>::integer(3),
                               <span style="color: #4ec9b0;">Maj</span>::integer(2))),
         <span style="color: #ce9178;">"3/1"</span>);
        (maj_number_coerce(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, complex.clone(),
                           <span style="color: #4ec9b0;">Maj</span>::complex(
                               <span style="color: #4ec9b0;">Maj</span>::integer(3),
                               <span style="color: #4ec9b0;">Maj</span>::integer(2))),
         <span style="color: #ce9178;">"3J2"</span>);
    );
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org6efe104" class="outline-2">
<h2 id="org6efe104"><span class="section-number-2">6.</span> Funções</h2>
<div class="outline-text-2" id="text-6">
</div>
<div id="outline-container-org8f1a544" class="outline-3">
<h3 id="org8f1a544"><span class="section-number-3">6.1.</span> Predicados</h3>
<div class="outline-text-3" id="text-6-1">
</div>
<div id="outline-container-org73b278c" class="outline-4">
<h4 id="org73b278c"><span class="section-number-4">6.1.1.</span> <code>symbolp</code></h4>
<div class="outline-text-4" id="text-6-1-1">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #c586c0;">#[test]</span>
<span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">predicates_symbolp</span>() {
    <span style="color: #569cd6;">use</span> <span style="color: #569cd6;">crate</span>::<span style="color: #569cd6;">axioms</span>::<span style="color: #569cd6;">predicates</span>::maj_symbolp;
    <span style="color: #c586c0;">multi_boolean_test!</span>(
        (maj_symbolp(<span style="color: #4ec9b0;">Maj</span>::t()), <span style="color: #569cd6;">true</span>);
        (maj_symbolp(<span style="color: #4ec9b0;">Maj</span>::fraction(2, 3)), <span style="color: #569cd6;">false</span>);
    );
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org6cd10b9" class="outline-4">
<h4 id="org6cd10b9"><span class="section-number-4">6.1.2.</span> <code>eq</code></h4>
<div class="outline-text-4" id="text-6-1-2">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #c586c0;">#[test]</span>
<span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">predicates_eq</span>() {
    <span style="color: #569cd6;">use</span> <span style="color: #569cd6;">crate</span>::<span style="color: #569cd6;">axioms</span>::<span style="color: #569cd6;">predicates</span>::maj_eq;
    <span style="color: #c586c0;">multi_boolean_test!</span>(
        (maj_eq(<span style="color: #4ec9b0;">Maj</span>::t(), <span style="color: #4ec9b0;">Maj</span>::t()), <span style="color: #569cd6;">true</span>);
        (maj_eq(<span style="color: #4ec9b0;">Maj</span>::nil(), <span style="color: #4ec9b0;">Maj</span>::nil()), <span style="color: #569cd6;">true</span>);
        (maj_eq(<span style="color: #4ec9b0;">Maj</span>::t(), <span style="color: #4ec9b0;">Maj</span>::nil()), <span style="color: #569cd6;">false</span>);
        (maj_eq(<span style="color: #4ec9b0;">Maj</span>::integer(20), <span style="color: #4ec9b0;">Maj</span>::t()), <span style="color: #569cd6;">false</span>);
    );
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org5a35015" class="outline-4">
<h4 id="org5a35015"><span class="section-number-4">6.1.3.</span> <code>nilp</code></h4>
<div class="outline-text-4" id="text-6-1-3">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #c586c0;">#[test]</span>
<span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">predicates_nilp</span>() {
    <span style="color: #569cd6;">use</span> <span style="color: #569cd6;">crate</span>::<span style="color: #569cd6;">axioms</span>::<span style="color: #569cd6;">predicates</span>::maj_nilp;
    <span style="color: #c586c0;">multi_boolean_test!</span>(
        (maj_nilp(<span style="color: #4ec9b0;">Maj</span>::nil()), <span style="color: #569cd6;">true</span>);
        (maj_nilp(<span style="color: #4ec9b0;">Maj</span>::integer(5)), <span style="color: #569cd6;">false</span>);
    );
}
</pre>
</div>
</div>
</div>
