10-testes.org
*** ~consp~

#+begin_src rust
#[test]
fn predicates_consp() {
    use crate::axioms::predicates::maj_consp;
    let mut state = MajState::new();
    multi_boolean_test!(
        (maj_consp(Maj::cons(Maj::integer(2),
                             Maj::integer(3))),
         true);
        (maj_consp(Maj::cons(Maj::symbol(&mut state, "a"),
                             Maj::symbol(&mut state, "b"))),
         true);
        (maj_consp(Maj::integer(10)), false);
    );
}
#+end_src

*** ~atomp~

#+begin_src rust
#[test]
fn predicates_atomp() {
    use crate::axioms::predicates::maj_atomp;
    let mut state = MajState::new();
    multi_boolean_test!(
        (maj_atomp(Maj::integer(1)), true);
        (maj_atomp(Maj::symbol(&mut state, "a")), true);
        (maj_atomp(maj_list!(Maj::integer(1),
                             Maj::integer(2),
                             Maj::integer(3))),
         false);
    );
}
#+end_src

*** ~charp~

#+begin_src rust
#[test]
fn predicates_charp() {
    use crate::axioms::predicates::maj_charp;
    multi_boolean_test!(
        (maj_charp(Maj::character('a')), true);
        (maj_charp(Maj::t()), false);
    );
}
#+end_src

*** ~char=~

#+begin_src rust
#[test]
fn predicates_char_equals() {
    use crate::axioms::predicates::maj_char_equals;
    let small_a = Maj::character('a');
    let big_a   = Maj::character('A');
    let bel     = Maj::character('\x07');
    multi_boolean_test!(
        (maj_char_equals(small_a.clone(), small_a.clone()),
         true);
        (maj_char_equals(small_a.clone(), big_a.clone()),
         false);
    );
    multi_fail_test!(
        maj_char_equals(small_a.clone(), Maj::t());
        maj_char_equals(Maj::nil(), bel);
    );
}
#+end_src

*** ~streamp~

#+begin_src rust
#[test]
fn predicates_streamp() {
    use crate::axioms::predicates::maj_streamp;
    use crate::core::types::MajStreamDirection;
    let mut state = MajState::new();
    let ostream = Maj::stream(
        &mut state,
        "test-streams-out.txt",
        MajStreamDirection::Out).unwrap();
    let stdout = state.make_stream_stdout();
    multi_boolean_test!(
        (maj_streamp(ostream.clone()), true);
        (maj_streamp(stdout), true);
        (maj_streamp(Maj::t()), false);
    );
    state.close_stream(ostream);
}
#+end_src

*** ~numberp~

#+begin_src rust
#[test]
fn predicates_numberp() {
    use crate::axioms::predicates::maj_numberp;
    multi_boolean_test!(
        (maj_numberp(Maj::integer(2)), true);
        (maj_numberp(Maj::float(0.5)), true);
        (maj_numberp(Maj::fraction(2, 3)), true);
        (maj_numberp(Maj::complex(Maj::integer(0),
                                  Maj::float(2.0))),
         true);
        (maj_numberp(Maj::t()), false);
    );
}
#+end_src

*** ~integerp~

#+begin_src rust
#[test]
fn predicates_integerp() {
    use crate::axioms::predicates::maj_integerp;
    multi_boolean_test!(
        (maj_integerp(Maj::integer(2)), true);
        (maj_integerp(Maj::fraction(2, 3)), false);
    );
}
#+end_src

*** ~floatp~

#+begin_src rust
#[test]
fn predicates_floatp() {
    use crate::axioms::predicates::maj_floatp;
    multi_boolean_test!(
        (maj_floatp(Maj::float(2.5)), true);
        (maj_floatp(Maj::float(2.0)), true);
        (maj_floatp(Maj::float(0.5)), true);
        (maj_floatp(Maj::integer(3)), false);
    );
}
#+end_src

