doc/html/10-testes.html

<div id="outline-container-org4785bf6" class="outline-4">
<h4 id="org4785bf6"><span class="section-number-4">6.1.4.</span> <code>consp</code></h4>
<div class="outline-text-4" id="text-6-1-4">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #c586c0;">#[test]</span>
<span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">predicates_consp</span>() {
    <span style="color: #569cd6;">use</span> <span style="color: #569cd6;">crate</span>::<span style="color: #569cd6;">axioms</span>::<span style="color: #569cd6;">predicates</span>::maj_consp;
    <span style="color: #569cd6;">let</span> <span style="color: #569cd6;">mut</span> <span style="color: #9cdcfe;">state</span> = <span style="color: #4ec9b0;">MajState</span>::new();
    <span style="color: #c586c0;">multi_boolean_test!</span>(
        (maj_consp(<span style="color: #4ec9b0;">Maj</span>::cons(<span style="color: #4ec9b0;">Maj</span>::integer(2),
                             <span style="color: #4ec9b0;">Maj</span>::integer(3))),
         <span style="color: #569cd6;">true</span>);
        (maj_consp(<span style="color: #4ec9b0;">Maj</span>::cons(<span style="color: #4ec9b0;">Maj</span>::symbol(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #ce9178;">"a"</span>),
                             <span style="color: #4ec9b0;">Maj</span>::symbol(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #ce9178;">"b"</span>))),
         <span style="color: #569cd6;">true</span>);
        (maj_consp(<span style="color: #4ec9b0;">Maj</span>::integer(10)), <span style="color: #569cd6;">false</span>);
    );
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orgab21dbc" class="outline-4">
<h4 id="orgab21dbc"><span class="section-number-4">6.1.5.</span> <code>atomp</code></h4>
<div class="outline-text-4" id="text-6-1-5">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #c586c0;">#[test]</span>
<span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">predicates_atomp</span>() {
    <span style="color: #569cd6;">use</span> <span style="color: #569cd6;">crate</span>::<span style="color: #569cd6;">axioms</span>::<span style="color: #569cd6;">predicates</span>::maj_atomp;
    <span style="color: #569cd6;">let</span> <span style="color: #569cd6;">mut</span> <span style="color: #9cdcfe;">state</span> = <span style="color: #4ec9b0;">MajState</span>::new();
    <span style="color: #c586c0;">multi_boolean_test!</span>(
        (maj_atomp(<span style="color: #4ec9b0;">Maj</span>::integer(1)), <span style="color: #569cd6;">true</span>);
        (maj_atomp(<span style="color: #4ec9b0;">Maj</span>::symbol(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #ce9178;">"a"</span>)), <span style="color: #569cd6;">true</span>);
        (maj_atomp(<span style="color: #c586c0;">maj_list!</span>(<span style="color: #4ec9b0;">Maj</span>::integer(1),
                             <span style="color: #4ec9b0;">Maj</span>::integer(2),
                             <span style="color: #4ec9b0;">Maj</span>::integer(3))),
         <span style="color: #569cd6;">false</span>);
    );
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org72bd964" class="outline-4">
<h4 id="org72bd964"><span class="section-number-4">6.1.6.</span> <code>charp</code></h4>
<div class="outline-text-4" id="text-6-1-6">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #c586c0;">#[test]</span>
<span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">predicates_charp</span>() {
    <span style="color: #569cd6;">use</span> <span style="color: #569cd6;">crate</span>::<span style="color: #569cd6;">axioms</span>::<span style="color: #569cd6;">predicates</span>::maj_charp;
    <span style="color: #c586c0;">multi_boolean_test!</span>(
        (maj_charp(<span style="color: #4ec9b0;">Maj</span>::character(<span style="color: #ce9178;">'a'</span>)), <span style="color: #569cd6;">true</span>);
        (maj_charp(<span style="color: #4ec9b0;">Maj</span>::t()), <span style="color: #569cd6;">false</span>);
    );
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orge6b36d6" class="outline-4">
<h4 id="orge6b36d6"><span class="section-number-4">6.1.7.</span> <code>char=</code></h4>
<div class="outline-text-4" id="text-6-1-7">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #c586c0;">#[test]</span>
<span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">predicates_char_equals</span>() {
    <span style="color: #569cd6;">use</span> <span style="color: #569cd6;">crate</span>::<span style="color: #569cd6;">axioms</span>::<span style="color: #569cd6;">predicates</span>::maj_char_equals;
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">small_a</span> = <span style="color: #4ec9b0;">Maj</span>::character(<span style="color: #ce9178;">'a'</span>);
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">big_a</span>   = <span style="color: #4ec9b0;">Maj</span>::character(<span style="color: #ce9178;">'A'</span>);
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">bel</span>     = <span style="color: #4ec9b0;">Maj</span>::character(<span style="color: #ce9178;">'\x07'</span>);
    <span style="color: #c586c0;">multi_boolean_test!</span>(
        (maj_char_equals(small_a.clone(), small_a.clone()),
         <span style="color: #569cd6;">true</span>);
        (maj_char_equals(small_a.clone(), big_a.clone()),
         <span style="color: #569cd6;">false</span>);
    );
    <span style="color: #c586c0;">multi_fail_test!</span>(
        maj_char_equals(small_a.clone(), <span style="color: #4ec9b0;">Maj</span>::t());
        maj_char_equals(<span style="color: #4ec9b0;">Maj</span>::nil(), bel);
    );
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orgd8bf192" class="outline-4">
<h4 id="orgd8bf192"><span class="section-number-4">6.1.8.</span> <code>streamp</code></h4>
<div class="outline-text-4" id="text-6-1-8">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #c586c0;">#[test]</span>
<span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">predicates_streamp</span>() {
    <span style="color: #569cd6;">use</span> <span style="color: #569cd6;">crate</span>::<span style="color: #569cd6;">axioms</span>::<span style="color: #569cd6;">predicates</span>::maj_streamp;
    <span style="color: #569cd6;">use</span> <span style="color: #569cd6;">crate</span>::<span style="color: #569cd6;">core</span>::<span style="color: #569cd6;">types</span>::<span style="color: #4ec9b0;">MajStreamDirection</span>;
    <span style="color: #569cd6;">let</span> <span style="color: #569cd6;">mut</span> <span style="color: #9cdcfe;">state</span> = <span style="color: #4ec9b0;">MajState</span>::new();
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">ostream</span> = <span style="color: #4ec9b0;">Maj</span>::stream(
        <span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state,
        <span style="color: #ce9178;">"test-streams-out.txt"</span>,
        <span style="color: #4ec9b0;">MajStreamDirection</span>::<span style="color: #4ec9b0;">Out</span>).unwrap();
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">stdout</span> = state.make_stream_stdout();
    <span style="color: #c586c0;">multi_boolean_test!</span>(
        (maj_streamp(ostream.clone()), <span style="color: #569cd6;">true</span>);
        (maj_streamp(stdout), <span style="color: #569cd6;">true</span>);
        (maj_streamp(<span style="color: #4ec9b0;">Maj</span>::t()), <span style="color: #569cd6;">false</span>);
    );
    state.close_stream(ostream);
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orgdebaa75" class="outline-4">
<h4 id="orgdebaa75"><span class="section-number-4">6.1.9.</span> <code>numberp</code></h4>
<div class="outline-text-4" id="text-6-1-9">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #c586c0;">#[test]</span>
<span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">predicates_numberp</span>() {
    <span style="color: #569cd6;">use</span> <span style="color: #569cd6;">crate</span>::<span style="color: #569cd6;">axioms</span>::<span style="color: #569cd6;">predicates</span>::maj_numberp;
    <span style="color: #c586c0;">multi_boolean_test!</span>(
        (maj_numberp(<span style="color: #4ec9b0;">Maj</span>::integer(2)), <span style="color: #569cd6;">true</span>);
        (maj_numberp(<span style="color: #4ec9b0;">Maj</span>::float(0.5)), <span style="color: #569cd6;">true</span>);
        (maj_numberp(<span style="color: #4ec9b0;">Maj</span>::fraction(2, 3)), <span style="color: #569cd6;">true</span>);
        (maj_numberp(<span style="color: #4ec9b0;">Maj</span>::complex(<span style="color: #4ec9b0;">Maj</span>::integer(0),
                                  <span style="color: #4ec9b0;">Maj</span>::float(2.0))),
         <span style="color: #569cd6;">true</span>);
        (maj_numberp(<span style="color: #4ec9b0;">Maj</span>::t()), <span style="color: #569cd6;">false</span>);
    );
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org02e9675" class="outline-4">
<h4 id="org02e9675"><span class="section-number-4">6.1.10.</span> <code>integerp</code></h4>
<div class="outline-text-4" id="text-6-1-10">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #c586c0;">#[test]</span>
<span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">predicates_integerp</span>() {
    <span style="color: #569cd6;">use</span> <span style="color: #569cd6;">crate</span>::<span style="color: #569cd6;">axioms</span>::<span style="color: #569cd6;">predicates</span>::maj_integerp;
    <span style="color: #c586c0;">multi_boolean_test!</span>(
        (maj_integerp(<span style="color: #4ec9b0;">Maj</span>::integer(2)), <span style="color: #569cd6;">true</span>);
        (maj_integerp(<span style="color: #4ec9b0;">Maj</span>::fraction(2, 3)), <span style="color: #569cd6;">false</span>);
    );
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orgf200db8" class="outline-4">
<h4 id="orgf200db8"><span class="section-number-4">6.1.11.</span> <code>floatp</code></h4>
<div class="outline-text-4" id="text-6-1-11">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #c586c0;">#[test]</span>
<span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">predicates_floatp</span>() {
    <span style="color: #569cd6;">use</span> <span style="color: #569cd6;">crate</span>::<span style="color: #569cd6;">axioms</span>::<span style="color: #569cd6;">predicates</span>::maj_floatp;
    <span style="color: #c586c0;">multi_boolean_test!</span>(
        (maj_floatp(<span style="color: #4ec9b0;">Maj</span>::float(2.5)), <span style="color: #569cd6;">true</span>);
        (maj_floatp(<span style="color: #4ec9b0;">Maj</span>::float(2.0)), <span style="color: #569cd6;">true</span>);
        (maj_floatp(<span style="color: #4ec9b0;">Maj</span>::float(0.5)), <span style="color: #569cd6;">true</span>);
        (maj_floatp(<span style="color: #4ec9b0;">Maj</span>::integer(3)), <span style="color: #569cd6;">false</span>);
    );
}
</pre>
</div>
</div>
</div>
