10-testes.org
*** ~fractionp~

#+begin_src rust
#[test]
fn predicates_fractionp() {
    use crate::axioms::predicates::maj_fractionp;
    multi_boolean_test!(
        (maj_fractionp(Maj::fraction(2, 3)), true);
        (maj_fractionp(Maj::fraction(5, 8)), true);
        (maj_fractionp(Maj::integer(8)), false);
    );
}
#+end_src

*** ~complexp~

#+begin_src rust
#[test]
fn predicates_complexp() {
    use crate::axioms::predicates::maj_complexp;
    multi_boolean_test!(
        (maj_complexp(Maj::complex(Maj::float(0.5),
                                   Maj::integer(1))),
         true);
        (maj_complexp(Maj::complex(Maj::integer(-10),
                                   Maj::integer(-3))),
         true);
        (maj_complexp(Maj::integer(5)), false);
        // (maj_complexp(Maj::complex(Maj::integer(5),
        //                            Maj::integer(0))),
        //  false);
        (maj_complexp(Maj::complex(Maj::integer(5),
                                   Maj::float(0.0))),
         true);
    );
}
#+end_src

*** ~vectorp~

#+begin_src rust
#[test]
fn predicates_vectorp() {
    use crate::axioms::predicates::maj_vectorp;
    multi_boolean_test!(
        (maj_vectorp(
            Maj::vector_integer(vec![1, 2, 3])), true);
        (maj_vectorp(Maj::t()), false);
    );
}
#+end_src

*** ~id~

#+begin_src rust
#[test]
fn predicates_id() {
    use crate::axioms::predicates::maj_id;
    let mut state = MajState::new();
    multi_boolean_test!(
        (maj_id(Maj::symbol(&mut state, "a"),
                Maj::symbol(&mut state, "a")),
         true);
        (maj_id(Maj::character('c'),
                Maj::character('c')),
         true);
        (maj_id(maj_list!(Maj::symbol(&mut state, "a"),
                          Maj::symbol(&mut state, "b")),
                maj_list!(Maj::symbol(&mut state, "a"),
                          Maj::symbol(&mut state, "b"))),
         false);
        (maj_id(Maj::integer(5), Maj::integer(5)),
         false);
    );
}
#+end_src

*** ~proper-list-p~

#+begin_src rust
#[test]
fn predicates_proper_list_p() {
    use crate::axioms::predicates::maj_proper_list_p;
    let mut state = MajState::new();
    let a = Maj::symbol(&mut state, "a");
    let b = Maj::symbol(&mut state, "b");
    let c = Maj::symbol(&mut state, "c");
    let d = Maj::symbol(&mut state, "d");
    multi_boolean_test!(
        (maj_proper_list_p(
            maj_list!(a.clone(),
                      b.clone(),
                      c.clone(),
                      d.clone())),
         true);
        (maj_proper_list_p(
            maj_dotted_list!(a, b, c, d)),
         false);
    );
}
#+end_src

*** ~stringp~

#+begin_src rust
#[test]
fn predicates_stringp() {
    use crate::axioms::predicates::maj_stringp;
    use crate::axioms::primitives::maj_vector;
    let mut state = MajState::new();
    let a = Maj::character('a');
    let b = Maj::character('b');
    let c = Maj::character('c');
    let charlist = maj_list!(a.clone(), b.clone(), c.clone());
    let charvec = maj_vector(&mut state, charlist.clone());
    let charvec2 = Maj::vector_any(vec![a, b, c]);
    multi_boolean_test!(
        (maj_stringp(Maj::string("abc")), true);
        (maj_stringp(charvec), true);
        (maj_stringp(charlist), false);
        (maj_stringp(charvec2), false);
        (maj_stringp(Maj::t()), false);
    );  
}
#+end_src

