doc/html/10-testes.html

<div id="outline-container-org6b2e8e9" class="outline-4">
<h4 id="org6b2e8e9"><span class="section-number-4">6.1.12.</span> <code>fractionp</code></h4>
<div class="outline-text-4" id="text-6-1-12">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #c586c0;">#[test]</span>
<span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">predicates_fractionp</span>() {
    <span style="color: #569cd6;">use</span> <span style="color: #569cd6;">crate</span>::<span style="color: #569cd6;">axioms</span>::<span style="color: #569cd6;">predicates</span>::maj_fractionp;
    <span style="color: #c586c0;">multi_boolean_test!</span>(
        (maj_fractionp(<span style="color: #4ec9b0;">Maj</span>::fraction(2, 3)), <span style="color: #569cd6;">true</span>);
        (maj_fractionp(<span style="color: #4ec9b0;">Maj</span>::fraction(5, 8)), <span style="color: #569cd6;">true</span>);
        (maj_fractionp(<span style="color: #4ec9b0;">Maj</span>::integer(8)), <span style="color: #569cd6;">false</span>);
    );
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orgdd9fe47" class="outline-4">
<h4 id="orgdd9fe47"><span class="section-number-4">6.1.13.</span> <code>complexp</code></h4>
<div class="outline-text-4" id="text-6-1-13">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #c586c0;">#[test]</span>
<span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">predicates_complexp</span>() {
    <span style="color: #569cd6;">use</span> <span style="color: #569cd6;">crate</span>::<span style="color: #569cd6;">axioms</span>::<span style="color: #569cd6;">predicates</span>::maj_complexp;
    <span style="color: #c586c0;">multi_boolean_test!</span>(
        (maj_complexp(<span style="color: #4ec9b0;">Maj</span>::complex(<span style="color: #4ec9b0;">Maj</span>::float(0.5),
                                   <span style="color: #4ec9b0;">Maj</span>::integer(1))),
         <span style="color: #569cd6;">true</span>);
        (maj_complexp(<span style="color: #4ec9b0;">Maj</span>::complex(<span style="color: #4ec9b0;">Maj</span>::integer(-10),
                                   <span style="color: #4ec9b0;">Maj</span>::integer(-3))),
         <span style="color: #569cd6;">true</span>);
        (maj_complexp(<span style="color: #4ec9b0;">Maj</span>::integer(5)), <span style="color: #569cd6;">false</span>);
        <span style="color: #6a9955;">// </span><span style="color: #6a9955;">(maj_complexp(Maj::complex(Maj::integer(5),</span>
        <span style="color: #6a9955;">//                            </span><span style="color: #6a9955;">Maj::integer(0))),</span>
        <span style="color: #6a9955;">//  </span><span style="color: #6a9955;">false);</span>
        (maj_complexp(<span style="color: #4ec9b0;">Maj</span>::complex(<span style="color: #4ec9b0;">Maj</span>::integer(5),
                                   <span style="color: #4ec9b0;">Maj</span>::float(0.0))),
         <span style="color: #569cd6;">true</span>);
    );
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org7b2cacb" class="outline-4">
<h4 id="org7b2cacb"><span class="section-number-4">6.1.14.</span> <code>vectorp</code></h4>
<div class="outline-text-4" id="text-6-1-14">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #c586c0;">#[test]</span>
<span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">predicates_vectorp</span>() {
    <span style="color: #569cd6;">use</span> <span style="color: #569cd6;">crate</span>::<span style="color: #569cd6;">axioms</span>::<span style="color: #569cd6;">predicates</span>::maj_vectorp;
    <span style="color: #c586c0;">multi_boolean_test!</span>(
        (maj_vectorp(
            <span style="color: #4ec9b0;">Maj</span>::vector_integer(<span style="color: #c586c0;">vec!</span>[1, 2, 3])), <span style="color: #569cd6;">true</span>);
        (maj_vectorp(<span style="color: #4ec9b0;">Maj</span>::t()), <span style="color: #569cd6;">false</span>);
    );
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org37c161f" class="outline-4">
<h4 id="org37c161f"><span class="section-number-4">6.1.15.</span> <code>id</code></h4>
<div class="outline-text-4" id="text-6-1-15">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #c586c0;">#[test]</span>
<span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">predicates_id</span>() {
    <span style="color: #569cd6;">use</span> <span style="color: #569cd6;">crate</span>::<span style="color: #569cd6;">axioms</span>::<span style="color: #569cd6;">predicates</span>::maj_id;
    <span style="color: #569cd6;">let</span> <span style="color: #569cd6;">mut</span> <span style="color: #9cdcfe;">state</span> = <span style="color: #4ec9b0;">MajState</span>::new();
    <span style="color: #c586c0;">multi_boolean_test!</span>(
        (maj_id(<span style="color: #4ec9b0;">Maj</span>::symbol(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #ce9178;">"a"</span>),
                <span style="color: #4ec9b0;">Maj</span>::symbol(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #ce9178;">"a"</span>)),
         <span style="color: #569cd6;">true</span>);
        (maj_id(<span style="color: #4ec9b0;">Maj</span>::character(<span style="color: #ce9178;">'c'</span>),
                <span style="color: #4ec9b0;">Maj</span>::character(<span style="color: #ce9178;">'c'</span>)),
         <span style="color: #569cd6;">true</span>);
        (maj_id(<span style="color: #c586c0;">maj_list!</span>(<span style="color: #4ec9b0;">Maj</span>::symbol(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #ce9178;">"a"</span>),
                          <span style="color: #4ec9b0;">Maj</span>::symbol(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #ce9178;">"b"</span>)),
                <span style="color: #c586c0;">maj_list!</span>(<span style="color: #4ec9b0;">Maj</span>::symbol(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #ce9178;">"a"</span>),
                          <span style="color: #4ec9b0;">Maj</span>::symbol(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #ce9178;">"b"</span>))),
         <span style="color: #569cd6;">false</span>);
        (maj_id(<span style="color: #4ec9b0;">Maj</span>::integer(5), <span style="color: #4ec9b0;">Maj</span>::integer(5)),
         <span style="color: #569cd6;">false</span>);
    );
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org938c045" class="outline-4">
<h4 id="org938c045"><span class="section-number-4">6.1.16.</span> <code>proper-list-p</code></h4>
<div class="outline-text-4" id="text-6-1-16">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #c586c0;">#[test]</span>
<span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">predicates_proper_list_p</span>() {
    <span style="color: #569cd6;">use</span> <span style="color: #569cd6;">crate</span>::<span style="color: #569cd6;">axioms</span>::<span style="color: #569cd6;">predicates</span>::maj_proper_list_p;
    <span style="color: #569cd6;">let</span> <span style="color: #569cd6;">mut</span> <span style="color: #9cdcfe;">state</span> = <span style="color: #4ec9b0;">MajState</span>::new();
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">a</span> = <span style="color: #4ec9b0;">Maj</span>::symbol(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #ce9178;">"a"</span>);
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">b</span> = <span style="color: #4ec9b0;">Maj</span>::symbol(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #ce9178;">"b"</span>);
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">c</span> = <span style="color: #4ec9b0;">Maj</span>::symbol(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #ce9178;">"c"</span>);
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">d</span> = <span style="color: #4ec9b0;">Maj</span>::symbol(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #ce9178;">"d"</span>);
    <span style="color: #c586c0;">multi_boolean_test!</span>(
        (maj_proper_list_p(
            <span style="color: #c586c0;">maj_list!</span>(a.clone(),
                      b.clone(),
                      c.clone(),
                      d.clone())),
         <span style="color: #569cd6;">true</span>);
        (maj_proper_list_p(
            <span style="color: #c586c0;">maj_dotted_list!</span>(a, b, c, d)),
         <span style="color: #569cd6;">false</span>);
    );
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org947f45c" class="outline-4">
<h4 id="org947f45c"><span class="section-number-4">6.1.17.</span> <code>stringp</code></h4>
<div class="outline-text-4" id="text-6-1-17">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #c586c0;">#[test]</span>
<span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">predicates_stringp</span>() {
    <span style="color: #569cd6;">use</span> <span style="color: #569cd6;">crate</span>::<span style="color: #569cd6;">axioms</span>::<span style="color: #569cd6;">predicates</span>::maj_stringp;
    <span style="color: #569cd6;">use</span> <span style="color: #569cd6;">crate</span>::<span style="color: #569cd6;">axioms</span>::<span style="color: #569cd6;">primitives</span>::maj_vector;
    <span style="color: #569cd6;">let</span> <span style="color: #569cd6;">mut</span> <span style="color: #9cdcfe;">state</span> = <span style="color: #4ec9b0;">MajState</span>::new();
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">a</span> = <span style="color: #4ec9b0;">Maj</span>::character(<span style="color: #ce9178;">'a'</span>);
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">b</span> = <span style="color: #4ec9b0;">Maj</span>::character(<span style="color: #ce9178;">'b'</span>);
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">c</span> = <span style="color: #4ec9b0;">Maj</span>::character(<span style="color: #ce9178;">'c'</span>);
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">charlist</span> = <span style="color: #c586c0;">maj_list!</span>(a.clone(), b.clone(), c.clone());
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">charvec</span> = maj_vector(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, charlist.clone());
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">charvec2</span> = <span style="color: #4ec9b0;">Maj</span>::vector_any(<span style="color: #c586c0;">vec!</span>[a, b, c]);
    <span style="color: #c586c0;">multi_boolean_test!</span>(
        (maj_stringp(<span style="color: #4ec9b0;">Maj</span>::string(<span style="color: #ce9178;">"abc"</span>)), <span style="color: #569cd6;">true</span>);
        (maj_stringp(charvec), <span style="color: #569cd6;">true</span>);
        (maj_stringp(charlist), <span style="color: #569cd6;">false</span>);
        (maj_stringp(charvec2), <span style="color: #569cd6;">false</span>);
        (maj_stringp(<span style="color: #4ec9b0;">Maj</span>::t()), <span style="color: #569cd6;">false</span>);
    );  
}
</pre>
</div>
</div>
</div>
