10-testes.org
*** ~literalp~

#+begin_src rust
#[test]
fn predicates_literalp() {
    use crate::axioms::predicates::maj_literalp;
    let mut state = MajState::new();
    let x = Maj::symbol(&mut state, "x");
    let a = Maj::symbol(&mut state, "a");
    let b = Maj::symbol(&mut state, "b");
    let c = Maj::symbol(&mut state, "c");
    multi_boolean_test!(
        (maj_literalp(
            // (lit closure nil (x) ((* x x)))
            maj_list!(Maj::lit(),
                      Maj::closure(),
                      Maj::nil(),
                      maj_list!(x.clone()),
                      maj_list!(maj_list!(
                          Maj::symbol(&mut state, "*"),
                          x.clone(), x)))),
         true);
        (maj_literalp(maj_list!(a, b, c)), false);
        (maj_literalp(maj_list!(
            Maj::lit(),
            Maj::symbol(&mut state, "blah"))),
         true);       
    );
}
#+end_src

*** ~primitivep~

#+begin_src rust
#[test]
fn predicates_primitivep() {
    use crate::axioms::predicates::maj_primitivep;
    let mut state = MajState::new();
    let x = Maj::symbol(&mut state, "x");
    // Emulate internal definitions of primitivep and +
    // (lit prim primitivep required 1)
    let primitivep = maj_list!(
        Maj::lit(),
        Maj::prim(),
        Maj::symbol(&mut state, "primitivep"),
        Maj::symbol(&mut state, "required"),
        Maj::integer(1));
    // (lit prim + variadic 0)
    let plus = maj_list!(
        Maj::lit(),
        Maj::prim(),
        Maj::symbol(&mut state, "+"),
        Maj::symbol(&mut state, "variadic"),
        Maj::integer(0));
    // Emulate closure definition on top-level
    // (lit closure nil (x) ((+ x x)))
    let closure = maj_list!(
        Maj::lit(),
        Maj::closure(),
        Maj::nil(),
        maj_list!(x.clone()),
        maj_list!(maj_list!(
            Maj::symbol(&mut state, "+"),
            x.clone(), x)));
    multi_boolean_test!(
        (maj_primitivep(primitivep), true);
        (maj_primitivep(closure), false);
        (maj_primitivep(plus), true);
    );
}
#+end_src

*** ~closurep~

#+begin_src rust
#[test]
fn predicates_closurep() {
    use crate::axioms::predicates::maj_closurep;
    let mut state = MajState::new();
    let x = Maj::symbol(&mut state, "x");
    // Emulate closure definition on top-level
    // (lit closure nil (x) ((* x x)))
    let closure = maj_list!(
        Maj::lit(),
        Maj::closure(),
        Maj::nil(),
        maj_list!(x.clone()),
        maj_list!(maj_list!(
            Maj::symbol(&mut state, "*"),
            x.clone(), x)));
    // Emulate internal definitions of cons and +
    // (lit prim cons required 2)
    let cons = maj_list!(
        Maj::lit(),
        Maj::prim(),
        Maj::symbol(&mut state, "cons"),
        Maj::symbol(&mut state, "required"),
        Maj::integer(2));
    // (lit prim + variadic 0)
    let plus = maj_list!(
        Maj::lit(),
        Maj::prim(),
        Maj::symbol(&mut state, "+"),
        Maj::symbol(&mut state, "variadic"),
        Maj::integer(0));
    multi_boolean_test!(
        (maj_closurep(closure), true);
        (maj_closurep(
            maj_list!(Maj::lit(),
                      Maj::symbol(&mut state, "blah"))),
         false);
        (maj_closurep(cons), false);
        (maj_closurep(plus), false);
    );
}
#+end_src

