doc/html/10-testes.html

<div id="outline-container-org9e0dc54" class="outline-4">
<h4 id="org9e0dc54"><span class="section-number-4">6.1.18.</span> <code>literalp</code></h4>
<div class="outline-text-4" id="text-6-1-18">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #c586c0;">#[test]</span>
<span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">predicates_literalp</span>() {
    <span style="color: #569cd6;">use</span> <span style="color: #569cd6;">crate</span>::<span style="color: #569cd6;">axioms</span>::<span style="color: #569cd6;">predicates</span>::maj_literalp;
    <span style="color: #569cd6;">let</span> <span style="color: #569cd6;">mut</span> <span style="color: #9cdcfe;">state</span> = <span style="color: #4ec9b0;">MajState</span>::new();
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">x</span> = <span style="color: #4ec9b0;">Maj</span>::symbol(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #ce9178;">"x"</span>);
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">a</span> = <span style="color: #4ec9b0;">Maj</span>::symbol(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #ce9178;">"a"</span>);
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">b</span> = <span style="color: #4ec9b0;">Maj</span>::symbol(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #ce9178;">"b"</span>);
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">c</span> = <span style="color: #4ec9b0;">Maj</span>::symbol(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #ce9178;">"c"</span>);
    <span style="color: #c586c0;">multi_boolean_test!</span>(
        (maj_literalp(
            <span style="color: #6a9955;">// </span><span style="color: #6a9955;">(lit closure nil (x) ((* x x)))</span>
            <span style="color: #c586c0;">maj_list!</span>(<span style="color: #4ec9b0;">Maj</span>::lit(),
                      <span style="color: #4ec9b0;">Maj</span>::closure(),
                      <span style="color: #4ec9b0;">Maj</span>::nil(),
                      <span style="color: #c586c0;">maj_list!</span>(x.clone()),
                      <span style="color: #c586c0;">maj_list!</span>(<span style="color: #c586c0;">maj_list!</span>(
                          <span style="color: #4ec9b0;">Maj</span>::symbol(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #ce9178;">"*"</span>),
                          x.clone(), x)))),
         <span style="color: #569cd6;">true</span>);
        (maj_literalp(<span style="color: #c586c0;">maj_list!</span>(a, b, c)), <span style="color: #569cd6;">false</span>);
        (maj_literalp(<span style="color: #c586c0;">maj_list!</span>(
            <span style="color: #4ec9b0;">Maj</span>::lit(),
            <span style="color: #4ec9b0;">Maj</span>::symbol(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #ce9178;">"blah"</span>))),
         <span style="color: #569cd6;">true</span>);       
    );
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org21f251c" class="outline-4">
<h4 id="org21f251c"><span class="section-number-4">6.1.19.</span> <code>primitivep</code></h4>
<div class="outline-text-4" id="text-6-1-19">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #c586c0;">#[test]</span>
<span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">predicates_primitivep</span>() {
    <span style="color: #569cd6;">use</span> <span style="color: #569cd6;">crate</span>::<span style="color: #569cd6;">axioms</span>::<span style="color: #569cd6;">predicates</span>::maj_primitivep;
    <span style="color: #569cd6;">let</span> <span style="color: #569cd6;">mut</span> <span style="color: #9cdcfe;">state</span> = <span style="color: #4ec9b0;">MajState</span>::new();
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">x</span> = <span style="color: #4ec9b0;">Maj</span>::symbol(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #ce9178;">"x"</span>);
    <span style="color: #6a9955;">// </span><span style="color: #6a9955;">Emulate internal definitions of primitivep and +</span>
    <span style="color: #6a9955;">// </span><span style="color: #6a9955;">(lit prim primitivep required 1)</span>
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">primitivep</span> = <span style="color: #c586c0;">maj_list!</span>(
        <span style="color: #4ec9b0;">Maj</span>::lit(),
        <span style="color: #4ec9b0;">Maj</span>::prim(),
        <span style="color: #4ec9b0;">Maj</span>::symbol(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #ce9178;">"primitivep"</span>),
        <span style="color: #4ec9b0;">Maj</span>::symbol(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #ce9178;">"required"</span>),
        <span style="color: #4ec9b0;">Maj</span>::integer(1));
    <span style="color: #6a9955;">// </span><span style="color: #6a9955;">(lit prim + variadic 0)</span>
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">plus</span> = <span style="color: #c586c0;">maj_list!</span>(
        <span style="color: #4ec9b0;">Maj</span>::lit(),
        <span style="color: #4ec9b0;">Maj</span>::prim(),
        <span style="color: #4ec9b0;">Maj</span>::symbol(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #ce9178;">"+"</span>),
        <span style="color: #4ec9b0;">Maj</span>::symbol(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #ce9178;">"variadic"</span>),
        <span style="color: #4ec9b0;">Maj</span>::integer(0));
    <span style="color: #6a9955;">// </span><span style="color: #6a9955;">Emulate closure definition on top-level</span>
    <span style="color: #6a9955;">// </span><span style="color: #6a9955;">(lit closure nil (x) ((+ x x)))</span>
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">closure</span> = <span style="color: #c586c0;">maj_list!</span>(
        <span style="color: #4ec9b0;">Maj</span>::lit(),
        <span style="color: #4ec9b0;">Maj</span>::closure(),
        <span style="color: #4ec9b0;">Maj</span>::nil(),
        <span style="color: #c586c0;">maj_list!</span>(x.clone()),
        <span style="color: #c586c0;">maj_list!</span>(<span style="color: #c586c0;">maj_list!</span>(
            <span style="color: #4ec9b0;">Maj</span>::symbol(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #ce9178;">"+"</span>),
            x.clone(), x)));
    <span style="color: #c586c0;">multi_boolean_test!</span>(
        (maj_primitivep(primitivep), <span style="color: #569cd6;">true</span>);
        (maj_primitivep(closure), <span style="color: #569cd6;">false</span>);
        (maj_primitivep(plus), <span style="color: #569cd6;">true</span>);
    );
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orgfbc3e78" class="outline-4">
<h4 id="orgfbc3e78"><span class="section-number-4">6.1.20.</span> <code>closurep</code></h4>
<div class="outline-text-4" id="text-6-1-20">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #c586c0;">#[test]</span>
<span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">predicates_closurep</span>() {
    <span style="color: #569cd6;">use</span> <span style="color: #569cd6;">crate</span>::<span style="color: #569cd6;">axioms</span>::<span style="color: #569cd6;">predicates</span>::maj_closurep;
    <span style="color: #569cd6;">let</span> <span style="color: #569cd6;">mut</span> <span style="color: #9cdcfe;">state</span> = <span style="color: #4ec9b0;">MajState</span>::new();
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">x</span> = <span style="color: #4ec9b0;">Maj</span>::symbol(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #ce9178;">"x"</span>);
    <span style="color: #6a9955;">// </span><span style="color: #6a9955;">Emulate closure definition on top-level</span>
    <span style="color: #6a9955;">// </span><span style="color: #6a9955;">(lit closure nil (x) ((* x x)))</span>
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">closure</span> = <span style="color: #c586c0;">maj_list!</span>(
        <span style="color: #4ec9b0;">Maj</span>::lit(),
        <span style="color: #4ec9b0;">Maj</span>::closure(),
        <span style="color: #4ec9b0;">Maj</span>::nil(),
        <span style="color: #c586c0;">maj_list!</span>(x.clone()),
        <span style="color: #c586c0;">maj_list!</span>(<span style="color: #c586c0;">maj_list!</span>(
            <span style="color: #4ec9b0;">Maj</span>::symbol(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #ce9178;">"*"</span>),
            x.clone(), x)));
    <span style="color: #6a9955;">// </span><span style="color: #6a9955;">Emulate internal definitions of cons and +</span>
    <span style="color: #6a9955;">// </span><span style="color: #6a9955;">(lit prim cons required 2)</span>
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">cons</span> = <span style="color: #c586c0;">maj_list!</span>(
        <span style="color: #4ec9b0;">Maj</span>::lit(),
        <span style="color: #4ec9b0;">Maj</span>::prim(),
        <span style="color: #4ec9b0;">Maj</span>::symbol(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #ce9178;">"cons"</span>),
        <span style="color: #4ec9b0;">Maj</span>::symbol(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #ce9178;">"required"</span>),
        <span style="color: #4ec9b0;">Maj</span>::integer(2));
    <span style="color: #6a9955;">// </span><span style="color: #6a9955;">(lit prim + variadic 0)</span>
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">plus</span> = <span style="color: #c586c0;">maj_list!</span>(
        <span style="color: #4ec9b0;">Maj</span>::lit(),
        <span style="color: #4ec9b0;">Maj</span>::prim(),
        <span style="color: #4ec9b0;">Maj</span>::symbol(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #ce9178;">"+"</span>),
        <span style="color: #4ec9b0;">Maj</span>::symbol(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #ce9178;">"variadic"</span>),
        <span style="color: #4ec9b0;">Maj</span>::integer(0));
    <span style="color: #c586c0;">multi_boolean_test!</span>(
        (maj_closurep(closure), <span style="color: #569cd6;">true</span>);
        (maj_closurep(
            <span style="color: #c586c0;">maj_list!</span>(<span style="color: #4ec9b0;">Maj</span>::lit(),
                      <span style="color: #4ec9b0;">Maj</span>::symbol(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #ce9178;">"blah"</span>))),
         <span style="color: #569cd6;">false</span>);
        (maj_closurep(cons), <span style="color: #569cd6;">false</span>);
        (maj_closurep(plus), <span style="color: #569cd6;">false</span>);
    );
}
</pre>
</div>
</div>
</div>
