10-testes.org
*** ~functionp~

#+begin_src rust
#[test]
fn predicates_functionp() {
    use crate::axioms::predicates::maj_functionp;
    let mut state = MajState::new();
    let x = Maj::symbol(&mut state, "x");
    // Emulate closure definition on top-level
    // (lit closure nil (x) ((* x x)))
    let closure = maj_list!(
        Maj::lit(),
        Maj::closure(),
        Maj::nil(),
        maj_list!(x.clone()),
        maj_list!(maj_list!(
            Maj::symbol(&mut state, "*"),
            x.clone(), x)));
    // Emulate internal definitions of cons and +
    // (lit prim cons required 2)
    let cons = maj_list!(
        Maj::lit(),
        Maj::prim(),
        Maj::symbol(&mut state, "cons"),
        Maj::symbol(&mut state, "required"),
        Maj::integer(2));
    // (lit prim + variadic 0)
    let plus = maj_list!(
        Maj::lit(),
        Maj::prim(),
        Maj::symbol(&mut state, "+"),
        Maj::symbol(&mut state, "variadic"),
        Maj::integer(0));
    multi_boolean_test!(
        (maj_functionp(closure), true);
        (maj_functionp(plus), true);
        (maj_functionp(cons), true);
        (maj_functionp(maj_list!(
            Maj::lit(),
            Maj::symbol(&mut state, "blah"))),
         false);
    );
}
#+end_src

*** ~macrop~

#+begin_src rust
#[test]
fn predicates_macrop() {
    use crate::axioms::predicates::maj_macrop;
    let mut state = MajState::new();
    
    let x         = Maj::symbol(&mut state, "x");
    // Emulate definition of (mac (x) `(list ,x)) on top level
    // (lit macro (lit closure nil (x) ((quasiquote (list (unquote x))))))
    let themacro = maj_list!(
        Maj::lit(),
        Maj::symbol(&mut state, "macro"),
        maj_list!(
            Maj::lit(),
            Maj::closure(),
            Maj::nil(),
            maj_list!(x.clone()),
            maj_list!(
                maj_list!(
                    Maj::quasiquote(),
                    maj_list!(
                        Maj::symbol(&mut state, "list"),
                        maj_list!(
                            Maj::unquote(),
                            x.clone()))))));
    // Emulate internal definitions of cons and +
    // (lit prim cons required 2)
    let cons = maj_list!(
        Maj::lit(),
        Maj::prim(),
        Maj::symbol(&mut state, "cons"),
        Maj::symbol(&mut state, "required"),
        Maj::integer(2));
    // (lit prim + variadic 0)
    let plus = maj_list!(
        Maj::lit(),
        Maj::prim(),
        Maj::symbol(&mut state, "+"),
        Maj::symbol(&mut state, "variadic"),
        Maj::integer(0));
    multi_boolean_test!(
        (maj_macrop(themacro), true);
        (maj_macrop(maj_list!(Maj::lit(),
                              Maj::symbol(&mut state, "blah"))),
         false);
        (maj_macrop(cons), false);
        (maj_macrop(plus), false);
    );
}
#+end_src

*** ~errorp~

#+begin_src rust
#[test]
fn predicates_errorp() {
    use crate::axioms::predicates::maj_errorp;
    use crate::axioms::primitives::maj_err;
    multi_boolean_test!(
        (maj_errorp(maj_err(Maj::string("Some error"),
                            Maj::nil())),
         true);
        (maj_errorp(maj_err(Maj::string("Some other error"),
                            Maj::nil())),
         true);
        (maj_errorp(Maj::integer(2)), false);
    );
}
#+end_src

