doc/html/10-testes.html

<div id="outline-container-org6820f33" class="outline-4">
<h4 id="org6820f33"><span class="section-number-4">6.1.21.</span> <code>functionp</code></h4>
<div class="outline-text-4" id="text-6-1-21">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #c586c0;">#[test]</span>
<span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">predicates_functionp</span>() {
    <span style="color: #569cd6;">use</span> <span style="color: #569cd6;">crate</span>::<span style="color: #569cd6;">axioms</span>::<span style="color: #569cd6;">predicates</span>::maj_functionp;
    <span style="color: #569cd6;">let</span> <span style="color: #569cd6;">mut</span> <span style="color: #9cdcfe;">state</span> = <span style="color: #4ec9b0;">MajState</span>::new();
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">x</span> = <span style="color: #4ec9b0;">Maj</span>::symbol(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #ce9178;">"x"</span>);
    <span style="color: #6a9955;">// </span><span style="color: #6a9955;">Emulate closure definition on top-level</span>
    <span style="color: #6a9955;">// </span><span style="color: #6a9955;">(lit closure nil (x) ((* x x)))</span>
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">closure</span> = <span style="color: #c586c0;">maj_list!</span>(
        <span style="color: #4ec9b0;">Maj</span>::lit(),
        <span style="color: #4ec9b0;">Maj</span>::closure(),
        <span style="color: #4ec9b0;">Maj</span>::nil(),
        <span style="color: #c586c0;">maj_list!</span>(x.clone()),
        <span style="color: #c586c0;">maj_list!</span>(<span style="color: #c586c0;">maj_list!</span>(
            <span style="color: #4ec9b0;">Maj</span>::symbol(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #ce9178;">"*"</span>),
            x.clone(), x)));
    <span style="color: #6a9955;">// </span><span style="color: #6a9955;">Emulate internal definitions of cons and +</span>
    <span style="color: #6a9955;">// </span><span style="color: #6a9955;">(lit prim cons required 2)</span>
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">cons</span> = <span style="color: #c586c0;">maj_list!</span>(
        <span style="color: #4ec9b0;">Maj</span>::lit(),
        <span style="color: #4ec9b0;">Maj</span>::prim(),
        <span style="color: #4ec9b0;">Maj</span>::symbol(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #ce9178;">"cons"</span>),
        <span style="color: #4ec9b0;">Maj</span>::symbol(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #ce9178;">"required"</span>),
        <span style="color: #4ec9b0;">Maj</span>::integer(2));
    <span style="color: #6a9955;">// </span><span style="color: #6a9955;">(lit prim + variadic 0)</span>
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">plus</span> = <span style="color: #c586c0;">maj_list!</span>(
        <span style="color: #4ec9b0;">Maj</span>::lit(),
        <span style="color: #4ec9b0;">Maj</span>::prim(),
        <span style="color: #4ec9b0;">Maj</span>::symbol(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #ce9178;">"+"</span>),
        <span style="color: #4ec9b0;">Maj</span>::symbol(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #ce9178;">"variadic"</span>),
        <span style="color: #4ec9b0;">Maj</span>::integer(0));
    <span style="color: #c586c0;">multi_boolean_test!</span>(
        (maj_functionp(closure), <span style="color: #569cd6;">true</span>);
        (maj_functionp(plus), <span style="color: #569cd6;">true</span>);
        (maj_functionp(cons), <span style="color: #569cd6;">true</span>);
        (maj_functionp(<span style="color: #c586c0;">maj_list!</span>(
            <span style="color: #4ec9b0;">Maj</span>::lit(),
            <span style="color: #4ec9b0;">Maj</span>::symbol(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #ce9178;">"blah"</span>))),
         <span style="color: #569cd6;">false</span>);
    );
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orgadbbe20" class="outline-4">
<h4 id="orgadbbe20"><span class="section-number-4">6.1.22.</span> <code>macrop</code></h4>
<div class="outline-text-4" id="text-6-1-22">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #c586c0;">#[test]</span>
<span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">predicates_macrop</span>() {
    <span style="color: #569cd6;">use</span> <span style="color: #569cd6;">crate</span>::<span style="color: #569cd6;">axioms</span>::<span style="color: #569cd6;">predicates</span>::maj_macrop;
    <span style="color: #569cd6;">let</span> <span style="color: #569cd6;">mut</span> <span style="color: #9cdcfe;">state</span> = <span style="color: #4ec9b0;">MajState</span>::new();
    
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">x</span>         = <span style="color: #4ec9b0;">Maj</span>::symbol(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #ce9178;">"x"</span>);
    <span style="color: #6a9955;">// </span><span style="color: #6a9955;">Emulate definition of (mac (x) `(list ,x)) on top level</span>
    <span style="color: #6a9955;">// </span><span style="color: #6a9955;">(lit macro (lit closure nil (x) ((quasiquote (list (unquote x))))))</span>
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">themacro</span> = <span style="color: #c586c0;">maj_list!</span>(
        <span style="color: #4ec9b0;">Maj</span>::lit(),
        <span style="color: #4ec9b0;">Maj</span>::symbol(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #ce9178;">"macro"</span>),
        <span style="color: #c586c0;">maj_list!</span>(
            <span style="color: #4ec9b0;">Maj</span>::lit(),
            <span style="color: #4ec9b0;">Maj</span>::closure(),
            <span style="color: #4ec9b0;">Maj</span>::nil(),
            <span style="color: #c586c0;">maj_list!</span>(x.clone()),
            <span style="color: #c586c0;">maj_list!</span>(
                <span style="color: #c586c0;">maj_list!</span>(
                    <span style="color: #4ec9b0;">Maj</span>::quasiquote(),
                    <span style="color: #c586c0;">maj_list!</span>(
                        <span style="color: #4ec9b0;">Maj</span>::symbol(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #ce9178;">"list"</span>),
                        <span style="color: #c586c0;">maj_list!</span>(
                            <span style="color: #4ec9b0;">Maj</span>::unquote(),
                            x.clone()))))));
    <span style="color: #6a9955;">// </span><span style="color: #6a9955;">Emulate internal definitions of cons and +</span>
    <span style="color: #6a9955;">// </span><span style="color: #6a9955;">(lit prim cons required 2)</span>
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">cons</span> = <span style="color: #c586c0;">maj_list!</span>(
        <span style="color: #4ec9b0;">Maj</span>::lit(),
        <span style="color: #4ec9b0;">Maj</span>::prim(),
        <span style="color: #4ec9b0;">Maj</span>::symbol(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #ce9178;">"cons"</span>),
        <span style="color: #4ec9b0;">Maj</span>::symbol(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #ce9178;">"required"</span>),
        <span style="color: #4ec9b0;">Maj</span>::integer(2));
    <span style="color: #6a9955;">// </span><span style="color: #6a9955;">(lit prim + variadic 0)</span>
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">plus</span> = <span style="color: #c586c0;">maj_list!</span>(
        <span style="color: #4ec9b0;">Maj</span>::lit(),
        <span style="color: #4ec9b0;">Maj</span>::prim(),
        <span style="color: #4ec9b0;">Maj</span>::symbol(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #ce9178;">"+"</span>),
        <span style="color: #4ec9b0;">Maj</span>::symbol(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #ce9178;">"variadic"</span>),
        <span style="color: #4ec9b0;">Maj</span>::integer(0));
    <span style="color: #c586c0;">multi_boolean_test!</span>(
        (maj_macrop(themacro), <span style="color: #569cd6;">true</span>);
        (maj_macrop(<span style="color: #c586c0;">maj_list!</span>(<span style="color: #4ec9b0;">Maj</span>::lit(),
                              <span style="color: #4ec9b0;">Maj</span>::symbol(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #ce9178;">"blah"</span>))),
         <span style="color: #569cd6;">false</span>);
        (maj_macrop(cons), <span style="color: #569cd6;">false</span>);
        (maj_macrop(plus), <span style="color: #569cd6;">false</span>);
    );
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orgf137614" class="outline-4">
<h4 id="orgf137614"><span class="section-number-4">6.1.23.</span> <code>errorp</code></h4>
<div class="outline-text-4" id="text-6-1-23">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #c586c0;">#[test]</span>
<span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">predicates_errorp</span>() {
    <span style="color: #569cd6;">use</span> <span style="color: #569cd6;">crate</span>::<span style="color: #569cd6;">axioms</span>::<span style="color: #569cd6;">predicates</span>::maj_errorp;
    <span style="color: #569cd6;">use</span> <span style="color: #569cd6;">crate</span>::<span style="color: #569cd6;">axioms</span>::<span style="color: #569cd6;">primitives</span>::maj_err;
    <span style="color: #c586c0;">multi_boolean_test!</span>(
        (maj_errorp(maj_err(<span style="color: #4ec9b0;">Maj</span>::string(<span style="color: #ce9178;">"Some error"</span>),
                            <span style="color: #4ec9b0;">Maj</span>::nil())),
         <span style="color: #569cd6;">true</span>);
        (maj_errorp(maj_err(<span style="color: #4ec9b0;">Maj</span>::string(<span style="color: #ce9178;">"Some other error"</span>),
                            <span style="color: #4ec9b0;">Maj</span>::nil())),
         <span style="color: #569cd6;">true</span>);
        (maj_errorp(<span style="color: #4ec9b0;">Maj</span>::integer(2)), <span style="color: #569cd6;">false</span>);
    );
}
</pre>
</div>
</div>
</div>
