10-testes.org
*** ~zerop~

#+begin_src rust
#[test]
fn predicates_zerop() {
    use crate::axioms::predicates::maj_zerop;
    let mut state = MajState::new();
    multi_boolean_test!(
        (maj_zerop(&mut state, Maj::nil(), Maj::float(0.0)), true);
        (maj_zerop(&mut state, Maj::nil(), Maj::fraction(0, 1)), true);
        (maj_zerop(&mut state, Maj::nil(), Maj::integer(0)), true);
        (maj_zerop(&mut state, Maj::nil(), Maj::integer(5)), false);
    );
    test_fail!(
        maj_zerop(&mut state, Maj::nil(), Maj::t()));
}
#+end_src

** Outras funções primitivas

*** ~cons~

#+begin_src rust
#[test]
fn primitives_cons() {
    use crate::axioms::primitives::{ maj_cons, maj_err };
    let mut state = MajState::new();
    multi_test!(
        state;
        (maj_cons(Maj::symbol(&mut state, "a"),
                  Maj::symbol(&mut state, "b")),
         "(a . b)");
        (maj_cons(Maj::integer(1), Maj::integer(2)),
         "(1 . 2)");
    );
    multi_fail_test!(
        maj_cons(maj_err(Maj::string("Some error"),
                         Maj::nil()),
                 Maj::t());
    );
}
#+end_src

*** ~car~

#+begin_src rust
#[test]
fn primitives_car() {
    use crate::axioms::primitives::{
        maj_cons
    };
    let mut state = MajState::new();
    multi_test!(
        state;
        (maj_car(Maj::cons(Maj::symbol(&mut state, "a"),
                           Maj::symbol(&mut state, "b"))),
         "a");
        (maj_car(maj_cons(Maj::symbol(&mut state, "c"),
                          Maj::symbol(&mut state, "d"))),
         "c");
        (maj_car(Maj::nil()), "nil");
    );
}
#+end_src

*** ~cdr~

#+begin_src rust
#[test]
fn primitives_cdr() {
    use crate::axioms::primitives::{
        maj_cdr, maj_cons
    };
    let mut state = MajState::new();
    multi_test!(
        state;
        (maj_cdr(Maj::cons(Maj::symbol(&mut state, "a"),
                           Maj::symbol(&mut state, "b"))),
         "b");
        (maj_cdr(maj_cons(Maj::symbol(&mut state, "c"),
                          Maj::symbol(&mut state, "d"))),
         "d");
        (maj_cdr(Maj::nil()), "nil");
    );
}
#+end_src

*** ~copy~

#+begin_src rust
#[test]
fn primitives_copy() {
    use crate::axioms::{
        primitives::{
            maj_copy, maj_cons, maj_cdr
        },
        predicates::maj_id
    };
    let mut state = MajState::new();
    let x = maj_cons(Maj::symbol(&mut state, "a"),
                     Maj::symbol(&mut state, "b"));
    let y = maj_copy(x.clone());

    multi_test!(
        state;
        (x.clone(), "(a . b)");
        (y.clone(), "(a . b)");
    );
    multi_boolean_test!(
        (maj_id(x.clone(), y.clone()), false);
        (maj_id(maj_car(x.clone()), maj_car(y.clone())),
         true);
        (maj_id(maj_cdr(x.clone()), maj_cdr(y.clone())),
         true);
    );
    test_fail!(maj_copy(Maj::t()));
}
#+end_src

