doc/html/10-testes.html

<div id="outline-container-orgafe7b12" class="outline-4">
<h4 id="orgafe7b12"><span class="section-number-4">6.1.24.</span> <code>zerop</code></h4>
<div class="outline-text-4" id="text-6-1-24">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #c586c0;">#[test]</span>
<span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">predicates_zerop</span>() {
    <span style="color: #569cd6;">use</span> <span style="color: #569cd6;">crate</span>::<span style="color: #569cd6;">axioms</span>::<span style="color: #569cd6;">predicates</span>::maj_zerop;
    <span style="color: #569cd6;">let</span> <span style="color: #569cd6;">mut</span> <span style="color: #9cdcfe;">state</span> = <span style="color: #4ec9b0;">MajState</span>::new();
    <span style="color: #c586c0;">multi_boolean_test!</span>(
        (maj_zerop(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #4ec9b0;">Maj</span>::nil(), <span style="color: #4ec9b0;">Maj</span>::float(0.0)), <span style="color: #569cd6;">true</span>);
        (maj_zerop(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #4ec9b0;">Maj</span>::nil(), <span style="color: #4ec9b0;">Maj</span>::fraction(0, 1)), <span style="color: #569cd6;">true</span>);
        (maj_zerop(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #4ec9b0;">Maj</span>::nil(), <span style="color: #4ec9b0;">Maj</span>::integer(0)), <span style="color: #569cd6;">true</span>);
        (maj_zerop(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #4ec9b0;">Maj</span>::nil(), <span style="color: #4ec9b0;">Maj</span>::integer(5)), <span style="color: #569cd6;">false</span>);
    );
    <span style="color: #c586c0;">test_fail!</span>(
        maj_zerop(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #4ec9b0;">Maj</span>::nil(), <span style="color: #4ec9b0;">Maj</span>::t()));
}
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgece8471" class="outline-3">
<h3 id="orgece8471"><span class="section-number-3">6.2.</span> Outras funções primitivas</h3>
<div class="outline-text-3" id="text-6-2">
</div>
<div id="outline-container-org8ed43a9" class="outline-4">
<h4 id="org8ed43a9"><span class="section-number-4">6.2.1.</span> <code>cons</code></h4>
<div class="outline-text-4" id="text-6-2-1">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #c586c0;">#[test]</span>
<span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">primitives_cons</span>() {
    <span style="color: #569cd6;">use</span> <span style="color: #569cd6;">crate</span>::<span style="color: #569cd6;">axioms</span>::<span style="color: #569cd6;">primitives</span>::{ maj_cons, maj_err };
    <span style="color: #569cd6;">let</span> <span style="color: #569cd6;">mut</span> <span style="color: #9cdcfe;">state</span> = <span style="color: #4ec9b0;">MajState</span>::new();
    <span style="color: #c586c0;">multi_test!</span>(
        state;
        (maj_cons(<span style="color: #4ec9b0;">Maj</span>::symbol(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #ce9178;">"a"</span>),
                  <span style="color: #4ec9b0;">Maj</span>::symbol(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #ce9178;">"b"</span>)),
         <span style="color: #ce9178;">"(a . b)"</span>);
        (maj_cons(<span style="color: #4ec9b0;">Maj</span>::integer(1), <span style="color: #4ec9b0;">Maj</span>::integer(2)),
         <span style="color: #ce9178;">"(1 . 2)"</span>);
    );
    <span style="color: #c586c0;">multi_fail_test!</span>(
        maj_cons(maj_err(<span style="color: #4ec9b0;">Maj</span>::string(<span style="color: #ce9178;">"Some error"</span>),
                         <span style="color: #4ec9b0;">Maj</span>::nil()),
                 <span style="color: #4ec9b0;">Maj</span>::t());
    );
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orge5d7cdd" class="outline-4">
<h4 id="orge5d7cdd"><span class="section-number-4">6.2.2.</span> <code>car</code></h4>
<div class="outline-text-4" id="text-6-2-2">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #c586c0;">#[test]</span>
<span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">primitives_car</span>() {
    <span style="color: #569cd6;">use</span> <span style="color: #569cd6;">crate</span>::<span style="color: #569cd6;">axioms</span>::<span style="color: #569cd6;">primitives</span>::{
        maj_cons
    };
    <span style="color: #569cd6;">let</span> <span style="color: #569cd6;">mut</span> <span style="color: #9cdcfe;">state</span> = <span style="color: #4ec9b0;">MajState</span>::new();
    <span style="color: #c586c0;">multi_test!</span>(
        state;
        (maj_car(<span style="color: #4ec9b0;">Maj</span>::cons(<span style="color: #4ec9b0;">Maj</span>::symbol(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #ce9178;">"a"</span>),
                           <span style="color: #4ec9b0;">Maj</span>::symbol(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #ce9178;">"b"</span>))),
         <span style="color: #ce9178;">"a"</span>);
        (maj_car(maj_cons(<span style="color: #4ec9b0;">Maj</span>::symbol(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #ce9178;">"c"</span>),
                          <span style="color: #4ec9b0;">Maj</span>::symbol(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #ce9178;">"d"</span>))),
         <span style="color: #ce9178;">"c"</span>);
        (maj_car(<span style="color: #4ec9b0;">Maj</span>::nil()), <span style="color: #ce9178;">"nil"</span>);
    );
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org043e6bf" class="outline-4">
<h4 id="org043e6bf"><span class="section-number-4">6.2.3.</span> <code>cdr</code></h4>
<div class="outline-text-4" id="text-6-2-3">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #c586c0;">#[test]</span>
<span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">primitives_cdr</span>() {
    <span style="color: #569cd6;">use</span> <span style="color: #569cd6;">crate</span>::<span style="color: #569cd6;">axioms</span>::<span style="color: #569cd6;">primitives</span>::{
        maj_cdr, maj_cons
    };
    <span style="color: #569cd6;">let</span> <span style="color: #569cd6;">mut</span> <span style="color: #9cdcfe;">state</span> = <span style="color: #4ec9b0;">MajState</span>::new();
    <span style="color: #c586c0;">multi_test!</span>(
        state;
        (maj_cdr(<span style="color: #4ec9b0;">Maj</span>::cons(<span style="color: #4ec9b0;">Maj</span>::symbol(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #ce9178;">"a"</span>),
                           <span style="color: #4ec9b0;">Maj</span>::symbol(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #ce9178;">"b"</span>))),
         <span style="color: #ce9178;">"b"</span>);
        (maj_cdr(maj_cons(<span style="color: #4ec9b0;">Maj</span>::symbol(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #ce9178;">"c"</span>),
                          <span style="color: #4ec9b0;">Maj</span>::symbol(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #ce9178;">"d"</span>))),
         <span style="color: #ce9178;">"d"</span>);
        (maj_cdr(<span style="color: #4ec9b0;">Maj</span>::nil()), <span style="color: #ce9178;">"nil"</span>);
    );
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org8cc3998" class="outline-4">
<h4 id="org8cc3998"><span class="section-number-4">6.2.4.</span> <code>copy</code></h4>
<div class="outline-text-4" id="text-6-2-4">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #c586c0;">#[test]</span>
<span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">primitives_copy</span>() {
    <span style="color: #569cd6;">use</span> <span style="color: #569cd6;">crate</span>::<span style="color: #569cd6;">axioms</span>::{
        <span style="color: #569cd6;">primitives</span>::{
            maj_copy, maj_cons, maj_cdr
        },
        <span style="color: #569cd6;">predicates</span>::maj_id
    };
    <span style="color: #569cd6;">let</span> <span style="color: #569cd6;">mut</span> <span style="color: #9cdcfe;">state</span> = <span style="color: #4ec9b0;">MajState</span>::new();
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">x</span> = maj_cons(<span style="color: #4ec9b0;">Maj</span>::symbol(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #ce9178;">"a"</span>),
                     <span style="color: #4ec9b0;">Maj</span>::symbol(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #ce9178;">"b"</span>));
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">y</span> = maj_copy(x.clone());

    <span style="color: #c586c0;">multi_test!</span>(
        state;
        (x.clone(), <span style="color: #ce9178;">"(a . b)"</span>);
        (y.clone(), <span style="color: #ce9178;">"(a . b)"</span>);
    );
    <span style="color: #c586c0;">multi_boolean_test!</span>(
        (maj_id(x.clone(), y.clone()), <span style="color: #569cd6;">false</span>);
        (maj_id(maj_car(x.clone()), maj_car(y.clone())),
         <span style="color: #569cd6;">true</span>);
        (maj_id(maj_cdr(x.clone()), maj_cdr(y.clone())),
         <span style="color: #569cd6;">true</span>);
    );
    <span style="color: #c586c0;">test_fail!</span>(maj_copy(<span style="color: #4ec9b0;">Maj</span>::t()));
}
</pre>
</div>
</div>
</div>
