10-testes.org
*** ~length~

#+begin_src rust
#[test]
fn primitives_length() {
    use crate::axioms::primitives::maj_length;
    let mut state = MajState::new();
    multi_test!(
        state;
        (maj_length(maj_list!(Maj::integer(1),
                              Maj::integer(2),
                              Maj::integer(3),
                              Maj::integer(4))),
         "4");
        (maj_length(maj_list!(Maj::symbol(&mut state, "a"),
                              Maj::symbol(&mut state, "b"),
                              Maj::symbol(&mut state, "c"))),
         "3");
        (maj_length(Maj::nil()), "0");
        (maj_length(maj_dotted_list!(Maj::integer(1),
                                     Maj::integer(2),
                                     Maj::integer(3))),
         "2");
    );
    test_fail!(maj_length(Maj::symbol(&mut state, "a")));
}
#+end_src

*** ~depth~

#+begin_src rust
#[test]
fn primitives_depth() {
    use crate::axioms::primitives::maj_depth;
    let state = MajState::new();
    multi_test!(
        state;
        (maj_depth(Maj::nil()), "0");
        (maj_depth(maj_list!(Maj::nil())), "1");
        (maj_depth(maj_list!(maj_list!(Maj::integer(1)))),
         "2");
        (maj_depth(maj_list!(Maj::integer(1),
                             Maj::integer(2),
                             Maj::integer(3),
                             Maj::integer(4),
                             Maj::integer(5))),
         "5");
        (maj_depth(maj_list!(Maj::integer(1),
                             Maj::integer(2),
                             Maj::integer(3),
                             Maj::integer(4),
                             Maj::integer(5),
                             Maj::integer(6))),
         "6");
        (maj_depth(maj_dotted_list!(Maj::integer(1),
                                    Maj::integer(2),
                                    Maj::integer(3),
                                    Maj::integer(4),
                                    Maj::integer(5),
                                    Maj::integer(6))),
         "5");
    );
    test_fail!(maj_depth(Maj::integer(1)));
}
#+end_src

*** ~type~

#+begin_src rust
#[test]
fn primitives_type() {
    use crate::axioms::primitives::maj_type;
    let mut state = MajState::new();
    let a = Maj::symbol(&mut state, "a");
    let b = Maj::symbol(&mut state, "b");
    let c = Maj::symbol(&mut state, "c");
    let stdout = state.make_stream_stdout();
    multi_test!(
        state;
        (maj_type(&mut state, Maj::integer(1)),
         "integer");
        (maj_type(&mut state, Maj::float(2.0)),
         "float");
        (maj_type(&mut state, a.clone()),
         "symbol");
        (maj_type(&mut state, Maj::nil()),
         "symbol");
        (maj_type(&mut state, Maj::fraction(2, 3)),
         "fraction");
        (maj_type(&mut state, maj_list!(a, b, c)),
         "cons");
        (maj_type(&mut state, Maj::character('L')),
         "char");
        (maj_type(&mut state, stdout), "stream");
        (maj_type(&mut state, Maj::complex(Maj::integer(1),
                                           Maj::integer(5))),
         "complex");
        (maj_type(&mut state, Maj::vector_integer(vec![1, 2, 3])),
         "vector");
    );
}
#+end_src

