doc/html/10-testes.html

<div id="outline-container-org29804e0" class="outline-4">
<h4 id="org29804e0"><span class="section-number-4">6.2.5.</span> <code>length</code></h4>
<div class="outline-text-4" id="text-6-2-5">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #c586c0;">#[test]</span>
<span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">primitives_length</span>() {
    <span style="color: #569cd6;">use</span> <span style="color: #569cd6;">crate</span>::<span style="color: #569cd6;">axioms</span>::<span style="color: #569cd6;">primitives</span>::maj_length;
    <span style="color: #569cd6;">let</span> <span style="color: #569cd6;">mut</span> <span style="color: #9cdcfe;">state</span> = <span style="color: #4ec9b0;">MajState</span>::new();
    <span style="color: #c586c0;">multi_test!</span>(
        state;
        (maj_length(<span style="color: #c586c0;">maj_list!</span>(<span style="color: #4ec9b0;">Maj</span>::integer(1),
                              <span style="color: #4ec9b0;">Maj</span>::integer(2),
                              <span style="color: #4ec9b0;">Maj</span>::integer(3),
                              <span style="color: #4ec9b0;">Maj</span>::integer(4))),
         <span style="color: #ce9178;">"4"</span>);
        (maj_length(<span style="color: #c586c0;">maj_list!</span>(<span style="color: #4ec9b0;">Maj</span>::symbol(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #ce9178;">"a"</span>),
                              <span style="color: #4ec9b0;">Maj</span>::symbol(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #ce9178;">"b"</span>),
                              <span style="color: #4ec9b0;">Maj</span>::symbol(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #ce9178;">"c"</span>))),
         <span style="color: #ce9178;">"3"</span>);
        (maj_length(<span style="color: #4ec9b0;">Maj</span>::nil()), <span style="color: #ce9178;">"0"</span>);
        (maj_length(<span style="color: #c586c0;">maj_dotted_list!</span>(<span style="color: #4ec9b0;">Maj</span>::integer(1),
                                     <span style="color: #4ec9b0;">Maj</span>::integer(2),
                                     <span style="color: #4ec9b0;">Maj</span>::integer(3))),
         <span style="color: #ce9178;">"2"</span>);
    );
    <span style="color: #c586c0;">test_fail!</span>(maj_length(<span style="color: #4ec9b0;">Maj</span>::symbol(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #ce9178;">"a"</span>)));
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org01f852e" class="outline-4">
<h4 id="org01f852e"><span class="section-number-4">6.2.6.</span> <code>depth</code></h4>
<div class="outline-text-4" id="text-6-2-6">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #c586c0;">#[test]</span>
<span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">primitives_depth</span>() {
    <span style="color: #569cd6;">use</span> <span style="color: #569cd6;">crate</span>::<span style="color: #569cd6;">axioms</span>::<span style="color: #569cd6;">primitives</span>::maj_depth;
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">state</span> = <span style="color: #4ec9b0;">MajState</span>::new();
    <span style="color: #c586c0;">multi_test!</span>(
        state;
        (maj_depth(<span style="color: #4ec9b0;">Maj</span>::nil()), <span style="color: #ce9178;">"0"</span>);
        (maj_depth(<span style="color: #c586c0;">maj_list!</span>(<span style="color: #4ec9b0;">Maj</span>::nil())), <span style="color: #ce9178;">"1"</span>);
        (maj_depth(<span style="color: #c586c0;">maj_list!</span>(<span style="color: #c586c0;">maj_list!</span>(<span style="color: #4ec9b0;">Maj</span>::integer(1)))),
         <span style="color: #ce9178;">"2"</span>);
        (maj_depth(<span style="color: #c586c0;">maj_list!</span>(<span style="color: #4ec9b0;">Maj</span>::integer(1),
                             <span style="color: #4ec9b0;">Maj</span>::integer(2),
                             <span style="color: #4ec9b0;">Maj</span>::integer(3),
                             <span style="color: #4ec9b0;">Maj</span>::integer(4),
                             <span style="color: #4ec9b0;">Maj</span>::integer(5))),
         <span style="color: #ce9178;">"5"</span>);
        (maj_depth(<span style="color: #c586c0;">maj_list!</span>(<span style="color: #4ec9b0;">Maj</span>::integer(1),
                             <span style="color: #4ec9b0;">Maj</span>::integer(2),
                             <span style="color: #4ec9b0;">Maj</span>::integer(3),
                             <span style="color: #4ec9b0;">Maj</span>::integer(4),
                             <span style="color: #4ec9b0;">Maj</span>::integer(5),
                             <span style="color: #4ec9b0;">Maj</span>::integer(6))),
         <span style="color: #ce9178;">"6"</span>);
        (maj_depth(<span style="color: #c586c0;">maj_dotted_list!</span>(<span style="color: #4ec9b0;">Maj</span>::integer(1),
                                    <span style="color: #4ec9b0;">Maj</span>::integer(2),
                                    <span style="color: #4ec9b0;">Maj</span>::integer(3),
                                    <span style="color: #4ec9b0;">Maj</span>::integer(4),
                                    <span style="color: #4ec9b0;">Maj</span>::integer(5),
                                    <span style="color: #4ec9b0;">Maj</span>::integer(6))),
         <span style="color: #ce9178;">"5"</span>);
    );
    <span style="color: #c586c0;">test_fail!</span>(maj_depth(<span style="color: #4ec9b0;">Maj</span>::integer(1)));
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orgb9ee5e5" class="outline-4">
<h4 id="orgb9ee5e5"><span class="section-number-4">6.2.7.</span> <code>type</code></h4>
<div class="outline-text-4" id="text-6-2-7">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #c586c0;">#[test]</span>
<span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">primitives_type</span>() {
    <span style="color: #569cd6;">use</span> <span style="color: #569cd6;">crate</span>::<span style="color: #569cd6;">axioms</span>::<span style="color: #569cd6;">primitives</span>::maj_type;
    <span style="color: #569cd6;">let</span> <span style="color: #569cd6;">mut</span> <span style="color: #9cdcfe;">state</span> = <span style="color: #4ec9b0;">MajState</span>::new();
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">a</span> = <span style="color: #4ec9b0;">Maj</span>::symbol(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #ce9178;">"a"</span>);
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">b</span> = <span style="color: #4ec9b0;">Maj</span>::symbol(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #ce9178;">"b"</span>);
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">c</span> = <span style="color: #4ec9b0;">Maj</span>::symbol(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #ce9178;">"c"</span>);
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">stdout</span> = state.make_stream_stdout();
    <span style="color: #c586c0;">multi_test!</span>(
        state;
        (maj_type(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #4ec9b0;">Maj</span>::integer(1)),
         <span style="color: #ce9178;">"integer"</span>);
        (maj_type(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #4ec9b0;">Maj</span>::float(2.0)),
         <span style="color: #ce9178;">"float"</span>);
        (maj_type(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, a.clone()),
         <span style="color: #ce9178;">"symbol"</span>);
        (maj_type(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #4ec9b0;">Maj</span>::nil()),
         <span style="color: #ce9178;">"symbol"</span>);
        (maj_type(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #4ec9b0;">Maj</span>::fraction(2, 3)),
         <span style="color: #ce9178;">"fraction"</span>);
        (maj_type(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #c586c0;">maj_list!</span>(a, b, c)),
         <span style="color: #ce9178;">"cons"</span>);
        (maj_type(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #4ec9b0;">Maj</span>::character(<span style="color: #ce9178;">'L'</span>)),
         <span style="color: #ce9178;">"char"</span>);
        (maj_type(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, stdout), <span style="color: #ce9178;">"stream"</span>);
        (maj_type(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #4ec9b0;">Maj</span>::complex(<span style="color: #4ec9b0;">Maj</span>::integer(1),
                                           <span style="color: #4ec9b0;">Maj</span>::integer(5))),
         <span style="color: #ce9178;">"complex"</span>);
        (maj_type(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #4ec9b0;">Maj</span>::vector_integer(<span style="color: #c586c0;">vec!</span>[1, 2, 3])),
         <span style="color: #ce9178;">"vector"</span>);
    );
}
</pre>
</div>
</div>
</div>
