10-testes.org
*** ~intern~

#+begin_src rust
#[test]
fn primitives_intern() {
    use crate::axioms::primitives::maj_intern;
    let mut state = MajState::new();
    let a = Maj::symbol(&mut state, "a");
    multi_test!(
        state;
        (maj_intern(&mut state, Maj::string("blah")),
         "blah");
        (maj_intern(&mut state, Maj::string("foo")),
         "foo");
        (maj_intern(&mut state, Maj::string("")),
         "nil");
    );
    test_fail!(maj_intern(&mut state, a));
}
#+end_src

*** ~name~

#+begin_src rust
#[test]
fn primitives_name() {
    use crate::axioms::primitives::maj_name;
    let mut state = MajState::new();
    let foo = Maj::symbol(&mut state, "foo");
    let thing = Maj::symbol(&mut state, "thing");
    multi_test!(
        state;
        (maj_name(&state, Maj::t()), "\"t\"");
        (maj_name(&state, foo), "\"foo\"");
        (maj_name(&state, thing), "\"thing\"");
        (maj_name(&state, Maj::nil()), "\"nil\"");
    );
    test_fail!(maj_name(&state, Maj::string("Blah")));
}
#+end_src

*** TODO ~get-environment~

#+begin_src rust
#[test]
#[ignore]
fn primitives_get_environment() {
    use crate::core::environment::maj_env_push;
    use crate::axioms::primitives::maj_get_environment;
    let mut state = MajState::new();
    let x = Maj::symbol(&mut state, "x");
    let y = Maj::symbol(&mut state, "y");
    let plus = Maj::symbol(&mut state, "+");
    let sum_test = Maj::symbol(&mut state, "sum-test");
    let global = Maj::symbol(&mut state, "global");
    let lexical = Maj::symbol(&mut state, "lexical");
    let blah = Maj::symbol(&mut state, "blah");
    let mut env = Maj::nil();
    env = maj_env_push(env, x.clone(), Maj::integer(5));
    env = maj_env_push(env, y.clone(), Maj::integer(6));
    multi_regex_test!(
        state;
        (maj_get_environment(&mut state, global, env.clone()),
         RE_ENVIRONMENT);
        (maj_get_environment(&mut state, lexical.clone(), env.clone()),
         RE_ENVIRONMENT);
    );
    test_fail!(maj_get_environment(&mut state, blah, env.clone()));
    test_format!(
        state,
        {
            let lexenv = maj_get_environment(
                &mut state, lexical, env.clone());
            let newenv = maj_env_push(
                env.clone(),
                Maj::symbol(&mut state, "env"),
                lexenv);
            state.push(sum_test.clone(),
                       maj_list!(
                           maj_list!(
                               Maj::quasiquote(),
                               maj_list!(
                                   Maj::lit(),
                                   Maj::closure(),
                                   newenv.clone(),
                                   Maj::nil(),
                                   maj_list!(
                                       maj_list!(
                                           plus, x, y))))));
            sum_test.clone() // TODO: Replace with lookup
        }, "sum-test"); // TODO: Return a closure here and check
    // TODO: Add application (sum-test)
}
#+end_src

