doc/html/10-testes.html

<div id="outline-container-orgcd666b1" class="outline-4">
<h4 id="orgcd666b1"><span class="section-number-4">6.2.8.</span> <code>intern</code></h4>
<div class="outline-text-4" id="text-6-2-8">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #c586c0;">#[test]</span>
<span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">primitives_intern</span>() {
    <span style="color: #569cd6;">use</span> <span style="color: #569cd6;">crate</span>::<span style="color: #569cd6;">axioms</span>::<span style="color: #569cd6;">primitives</span>::maj_intern;
    <span style="color: #569cd6;">let</span> <span style="color: #569cd6;">mut</span> <span style="color: #9cdcfe;">state</span> = <span style="color: #4ec9b0;">MajState</span>::new();
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">a</span> = <span style="color: #4ec9b0;">Maj</span>::symbol(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #ce9178;">"a"</span>);
    <span style="color: #c586c0;">multi_test!</span>(
        state;
        (maj_intern(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #4ec9b0;">Maj</span>::string(<span style="color: #ce9178;">"blah"</span>)),
         <span style="color: #ce9178;">"blah"</span>);
        (maj_intern(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #4ec9b0;">Maj</span>::string(<span style="color: #ce9178;">"foo"</span>)),
         <span style="color: #ce9178;">"foo"</span>);
        (maj_intern(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #4ec9b0;">Maj</span>::string(<span style="color: #ce9178;">""</span>)),
         <span style="color: #ce9178;">"nil"</span>);
    );
    <span style="color: #c586c0;">test_fail!</span>(maj_intern(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, a));
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orgc419275" class="outline-4">
<h4 id="orgc419275"><span class="section-number-4">6.2.9.</span> <code>name</code></h4>
<div class="outline-text-4" id="text-6-2-9">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #c586c0;">#[test]</span>
<span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">primitives_name</span>() {
    <span style="color: #569cd6;">use</span> <span style="color: #569cd6;">crate</span>::<span style="color: #569cd6;">axioms</span>::<span style="color: #569cd6;">primitives</span>::maj_name;
    <span style="color: #569cd6;">let</span> <span style="color: #569cd6;">mut</span> <span style="color: #9cdcfe;">state</span> = <span style="color: #4ec9b0;">MajState</span>::new();
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">foo</span> = <span style="color: #4ec9b0;">Maj</span>::symbol(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #ce9178;">"foo"</span>);
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">thing</span> = <span style="color: #4ec9b0;">Maj</span>::symbol(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #ce9178;">"thing"</span>);
    <span style="color: #c586c0;">multi_test!</span>(
        state;
        (maj_name(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span>state, <span style="color: #4ec9b0;">Maj</span>::t()), <span style="color: #ce9178;">"\"t\""</span>);
        (maj_name(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span>state, foo), <span style="color: #ce9178;">"\"foo\""</span>);
        (maj_name(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span>state, thing), <span style="color: #ce9178;">"\"thing\""</span>);
        (maj_name(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span>state, <span style="color: #4ec9b0;">Maj</span>::nil()), <span style="color: #ce9178;">"\"nil\""</span>);
    );
    <span style="color: #c586c0;">test_fail!</span>(maj_name(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span>state, <span style="color: #4ec9b0;">Maj</span>::string(<span style="color: #ce9178;">"Blah"</span>)));
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org6d5b79b" class="outline-4">
<h4 id="org6d5b79b"><span class="section-number-4">6.2.10.</span> <span class="todo TODO">TODO</span> <code>get-environment</code></h4>
<div class="outline-text-4" id="text-6-2-10">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #c586c0;">#[test]</span>
<span style="color: #c586c0;">#[ignore]</span>
<span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">primitives_get_environment</span>() {
    <span style="color: #569cd6;">use</span> <span style="color: #569cd6;">crate</span>::<span style="color: #569cd6;">core</span>::<span style="color: #569cd6;">environment</span>::maj_env_push;
    <span style="color: #569cd6;">use</span> <span style="color: #569cd6;">crate</span>::<span style="color: #569cd6;">axioms</span>::<span style="color: #569cd6;">primitives</span>::maj_get_environment;
    <span style="color: #569cd6;">let</span> <span style="color: #569cd6;">mut</span> <span style="color: #9cdcfe;">state</span> = <span style="color: #4ec9b0;">MajState</span>::new();
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">x</span> = <span style="color: #4ec9b0;">Maj</span>::symbol(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #ce9178;">"x"</span>);
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">y</span> = <span style="color: #4ec9b0;">Maj</span>::symbol(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #ce9178;">"y"</span>);
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">plus</span> = <span style="color: #4ec9b0;">Maj</span>::symbol(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #ce9178;">"+"</span>);
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">sum_test</span> = <span style="color: #4ec9b0;">Maj</span>::symbol(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #ce9178;">"sum-test"</span>);
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">global</span> = <span style="color: #4ec9b0;">Maj</span>::symbol(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #ce9178;">"global"</span>);
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">lexical</span> = <span style="color: #4ec9b0;">Maj</span>::symbol(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #ce9178;">"lexical"</span>);
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">blah</span> = <span style="color: #4ec9b0;">Maj</span>::symbol(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #ce9178;">"blah"</span>);
    <span style="color: #569cd6;">let</span> <span style="color: #569cd6;">mut</span> <span style="color: #9cdcfe;">env</span> = <span style="color: #4ec9b0;">Maj</span>::nil();
    env = maj_env_push(env, x.clone(), <span style="color: #4ec9b0;">Maj</span>::integer(5));
    env = maj_env_push(env, y.clone(), <span style="color: #4ec9b0;">Maj</span>::integer(6));
    <span style="color: #c586c0;">multi_regex_test!</span>(
        state;
        (maj_get_environment(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, global, env.clone()),
         <span style="color: #4ec9b0;">RE_ENVIRONMENT</span>);
        (maj_get_environment(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, lexical.clone(), env.clone()),
         <span style="color: #4ec9b0;">RE_ENVIRONMENT</span>);
    );
    <span style="color: #c586c0;">test_fail!</span>(maj_get_environment(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, blah, env.clone()));
    test_<span style="color: #c586c0;">format!</span>(
        state,
        {
            <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">lexenv</span> = maj_get_environment(
                <span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, lexical, env.clone());
            <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">newenv</span> = maj_env_push(
                env.clone(),
                <span style="color: #4ec9b0;">Maj</span>::symbol(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #ce9178;">"env"</span>),
                lexenv);
            state.push(sum_test.clone(),
                       <span style="color: #c586c0;">maj_list!</span>(
                           <span style="color: #c586c0;">maj_list!</span>(
                               <span style="color: #4ec9b0;">Maj</span>::quasiquote(),
                               <span style="color: #c586c0;">maj_list!</span>(
                                   <span style="color: #4ec9b0;">Maj</span>::lit(),
                                   <span style="color: #4ec9b0;">Maj</span>::closure(),
                                   newenv.clone(),
                                   <span style="color: #4ec9b0;">Maj</span>::nil(),
                                   <span style="color: #c586c0;">maj_list!</span>(
                                       <span style="color: #c586c0;">maj_list!</span>(
                                           plus, x, y))))));
            sum_test.clone() <span style="color: #6a9955;">// </span><span style="color: #6a9955;">TODO: Replace with lookup</span>
        }, <span style="color: #ce9178;">"sum-test"</span>); <span style="color: #6a9955;">// </span><span style="color: #6a9955;">TODO: Return a closure here and check</span>
    <span style="color: #6a9955;">// </span><span style="color: #6a9955;">TODO: Add application (sum-test)</span>
}
</pre>
</div>
</div>
</div>
