10-testes.org
*** ~coin~

#+begin_src rust
#[test]
fn primitives_coin() {
    use crate::axioms::primitives::maj_coin;
    let state = MajState::new();
    // No better way to test this... just toss a coin
    // for a few times and check whether the output
    // is either t or nil.
    // In the future, we might want to test the distribution
    // of these values.
    let n = 100;
    for _ in 0..n {
        test_regex!(state, maj_coin(), r"^t|nil$");
    }
}
#+end_src

*** ~sys~

#+begin_src rust
#[test]
fn primitives_sys() {
    use crate::axioms::primitives::maj_sys;
    let state = MajState::new();
    multi_test!(
        state;
        (maj_sys(Maj::string("true"), Maj::nil()),  "0");
        (maj_sys(Maj::string("false"), Maj::nil()), "1");
    );
}
#+end_src

*** ~format~

#+begin_src rust
#[test]
fn primitives_format() {
    use crate::axioms::primitives::{
        maj_format_prim,
        maj_type
    };
    let mut state = MajState::new();
    let x = Maj::fraction(1, 2);
    let xtype = maj_type(&mut state, x.clone());
    multi_test!(
        state;
        (maj_format_prim(&state, Maj::string("Hello world"),
                         Maj::nil()),
         "\"Hello world\"");
        (maj_format_prim(&state, Maj::string("The number five: {}"),
                         maj_list!(Maj::integer(5))),
         "\"The number five: 5\"");
        (maj_format_prim(
            &state, Maj::string("The floating point {} is nice"),
            maj_list!(Maj::float(2.0))),
         "\"The floating point 2.0 is nice\"");
        (maj_format_prim(
            &state, Maj::string("The number {} has a subtype {}"),
            maj_list!(x, xtype)),
         "\"The number 1/2 has a subtype fraction\"");
    );
    multi_fail_test!(
        maj_format_prim(&state, Maj::string("Hello {}"),
                        Maj::nil());
        maj_format_prim(&state, Maj::string("Hello {"),
                        maj_list!(Maj::string("World")));
        maj_format_prim(&state, Maj::string("Hello }"),
                        maj_list!(Maj::string("World")));
    );
}
#+end_src

*** ~err~

#+begin_src rust
#[test]
fn primitives_err() {
    use crate::axioms::primitives::maj_err;
    // Should any error creation fail here, the
    // function will panic.
    multi_fail_test!(
        maj_err(Maj::string("{} is not a number"),
                maj_list!(Maj::t()));
        maj_err(
            Maj::string("This is an error, numbers are {} and {}"),
            maj_list!(Maj::integer(2), Maj::integer(3)));
    );
}
#+end_src

*** TODO ~warn~

#+begin_src rust
#[test]
#[ignore]
fn primitives_warn() {
    unimplemented!();
}
#+end_src

*** ~list~

#+begin_src rust
#[test]
fn primitives_list() {
    use crate::axioms::primitives::maj_list;
    let mut state = MajState::new();
    multi_test!(
        state;
        (maj_list(maj_list!(Maj::integer(1),
                            Maj::integer(2),
                            Maj::integer(3))),
         "(1 2 3)");
        (maj_list(maj_list!(
            Maj::symbol(&mut state, "a"),
            Maj::integer(6),
            Maj::symbol(&mut state, "b"))),
         "(a 6 b)");
        (maj_list(Maj::nil()), "nil");
    );
}
#+end_src

