doc/html/10-testes.html

<div id="outline-container-orgeae845d" class="outline-4">
<h4 id="orgeae845d"><span class="section-number-4">6.2.11.</span> <code>coin</code></h4>
<div class="outline-text-4" id="text-6-2-11">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #c586c0;">#[test]</span>
<span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">primitives_coin</span>() {
    <span style="color: #569cd6;">use</span> <span style="color: #569cd6;">crate</span>::<span style="color: #569cd6;">axioms</span>::<span style="color: #569cd6;">primitives</span>::maj_coin;
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">state</span> = <span style="color: #4ec9b0;">MajState</span>::new();
    <span style="color: #6a9955;">// </span><span style="color: #6a9955;">No better way to test this... just toss a coin</span>
    <span style="color: #6a9955;">// </span><span style="color: #6a9955;">for a few times and check whether the output</span>
    <span style="color: #6a9955;">// </span><span style="color: #6a9955;">is either t or nil.</span>
    <span style="color: #6a9955;">// </span><span style="color: #6a9955;">In the future, we might want to test the distribution</span>
    <span style="color: #6a9955;">// </span><span style="color: #6a9955;">of these values.</span>
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">n</span> = 100;
    <span style="color: #569cd6;">for</span> <span style="color: #9cdcfe;">_</span> <span style="color: #569cd6;">in</span> 0..n {
        <span style="color: #c586c0;">test_regex!</span>(state, maj_coin(), <span style="color: #ce9178;">r"^t|nil$"</span>);
    }
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org94f821d" class="outline-4">
<h4 id="org94f821d"><span class="section-number-4">6.2.12.</span> <code>sys</code></h4>
<div class="outline-text-4" id="text-6-2-12">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #c586c0;">#[test]</span>
<span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">primitives_sys</span>() {
    <span style="color: #569cd6;">use</span> <span style="color: #569cd6;">crate</span>::<span style="color: #569cd6;">axioms</span>::<span style="color: #569cd6;">primitives</span>::maj_sys;
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">state</span> = <span style="color: #4ec9b0;">MajState</span>::new();
    <span style="color: #c586c0;">multi_test!</span>(
        state;
        (maj_sys(<span style="color: #4ec9b0;">Maj</span>::string(<span style="color: #ce9178;">"true"</span>), <span style="color: #4ec9b0;">Maj</span>::nil()),  <span style="color: #ce9178;">"0"</span>);
        (maj_sys(<span style="color: #4ec9b0;">Maj</span>::string(<span style="color: #ce9178;">"false"</span>), <span style="color: #4ec9b0;">Maj</span>::nil()), <span style="color: #ce9178;">"1"</span>);
    );
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org094f991" class="outline-4">
<h4 id="org094f991"><span class="section-number-4">6.2.13.</span> <code>format</code></h4>
<div class="outline-text-4" id="text-6-2-13">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #c586c0;">#[test]</span>
<span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">primitives_format</span>() {
    <span style="color: #569cd6;">use</span> <span style="color: #569cd6;">crate</span>::<span style="color: #569cd6;">axioms</span>::<span style="color: #569cd6;">primitives</span>::{
        maj_format_prim,
        maj_type
    };
    <span style="color: #569cd6;">let</span> <span style="color: #569cd6;">mut</span> <span style="color: #9cdcfe;">state</span> = <span style="color: #4ec9b0;">MajState</span>::new();
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">x</span> = <span style="color: #4ec9b0;">Maj</span>::fraction(1, 2);
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">xtype</span> = maj_type(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, x.clone());
    <span style="color: #c586c0;">multi_test!</span>(
        state;
        (maj_format_prim(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span>state, <span style="color: #4ec9b0;">Maj</span>::string(<span style="color: #ce9178;">"Hello world"</span>),
                         <span style="color: #4ec9b0;">Maj</span>::nil()),
         <span style="color: #ce9178;">"\"Hello world\""</span>);
        (maj_format_prim(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span>state, <span style="color: #4ec9b0;">Maj</span>::string(<span style="color: #ce9178;">"The number five: {}"</span>),
                         <span style="color: #c586c0;">maj_list!</span>(<span style="color: #4ec9b0;">Maj</span>::integer(5))),
         <span style="color: #ce9178;">"\"The number five: 5\""</span>);
        (maj_format_prim(
            <span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span>state, <span style="color: #4ec9b0;">Maj</span>::string(<span style="color: #ce9178;">"The floating point {} is nice"</span>),
            <span style="color: #c586c0;">maj_list!</span>(<span style="color: #4ec9b0;">Maj</span>::float(2.0))),
         <span style="color: #ce9178;">"\"The floating point 2.0 is nice\""</span>);
        (maj_format_prim(
            <span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span>state, <span style="color: #4ec9b0;">Maj</span>::string(<span style="color: #ce9178;">"The number {} has a subtype {}"</span>),
            <span style="color: #c586c0;">maj_list!</span>(x, xtype)),
         <span style="color: #ce9178;">"\"The number 1/2 has a subtype fraction\""</span>);
    );
    <span style="color: #c586c0;">multi_fail_test!</span>(
        maj_format_prim(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span>state, <span style="color: #4ec9b0;">Maj</span>::string(<span style="color: #ce9178;">"Hello {}"</span>),
                        <span style="color: #4ec9b0;">Maj</span>::nil());
        maj_format_prim(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span>state, <span style="color: #4ec9b0;">Maj</span>::string(<span style="color: #ce9178;">"Hello {"</span>),
                        <span style="color: #c586c0;">maj_list!</span>(<span style="color: #4ec9b0;">Maj</span>::string(<span style="color: #ce9178;">"World"</span>)));
        maj_format_prim(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span>state, <span style="color: #4ec9b0;">Maj</span>::string(<span style="color: #ce9178;">"Hello }"</span>),
                        <span style="color: #c586c0;">maj_list!</span>(<span style="color: #4ec9b0;">Maj</span>::string(<span style="color: #ce9178;">"World"</span>)));
    );
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org3909d86" class="outline-4">
<h4 id="org3909d86"><span class="section-number-4">6.2.14.</span> <code>err</code></h4>
<div class="outline-text-4" id="text-6-2-14">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #c586c0;">#[test]</span>
<span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">primitives_err</span>() {
    <span style="color: #569cd6;">use</span> <span style="color: #569cd6;">crate</span>::<span style="color: #569cd6;">axioms</span>::<span style="color: #569cd6;">primitives</span>::maj_err;
    <span style="color: #6a9955;">// </span><span style="color: #6a9955;">Should any error creation fail here, the</span>
    <span style="color: #6a9955;">// </span><span style="color: #6a9955;">function will panic.</span>
    <span style="color: #c586c0;">multi_fail_test!</span>(
        maj_err(<span style="color: #4ec9b0;">Maj</span>::string(<span style="color: #ce9178;">"{} is not a number"</span>),
                <span style="color: #c586c0;">maj_list!</span>(<span style="color: #4ec9b0;">Maj</span>::t()));
        maj_err(
            <span style="color: #4ec9b0;">Maj</span>::string(<span style="color: #ce9178;">"This is an error, numbers are {} and {}"</span>),
            <span style="color: #c586c0;">maj_list!</span>(<span style="color: #4ec9b0;">Maj</span>::integer(2), <span style="color: #4ec9b0;">Maj</span>::integer(3)));
    );
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orgf9a8bd5" class="outline-4">
<h4 id="orgf9a8bd5"><span class="section-number-4">6.2.15.</span> <span class="todo TODO">TODO</span> <code>warn</code></h4>
<div class="outline-text-4" id="text-6-2-15">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #c586c0;">#[test]</span>
<span style="color: #c586c0;">#[ignore]</span>
<span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">primitives_warn</span>() {
    <span style="color: #c586c0;">unimplemented!</span>();
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org8cb0475" class="outline-4">
<h4 id="org8cb0475"><span class="section-number-4">6.2.16.</span> <code>list</code></h4>
<div class="outline-text-4" id="text-6-2-16">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #c586c0;">#[test]</span>
<span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">primitives_list</span>() {
    <span style="color: #569cd6;">use</span> <span style="color: #569cd6;">crate</span>::<span style="color: #569cd6;">axioms</span>::<span style="color: #569cd6;">primitives</span>::maj_list;
    <span style="color: #569cd6;">let</span> <span style="color: #569cd6;">mut</span> <span style="color: #9cdcfe;">state</span> = <span style="color: #4ec9b0;">MajState</span>::new();
    <span style="color: #c586c0;">multi_test!</span>(
        state;
        (maj_list(<span style="color: #c586c0;">maj_list!</span>(<span style="color: #4ec9b0;">Maj</span>::integer(1),
                            <span style="color: #4ec9b0;">Maj</span>::integer(2),
                            <span style="color: #4ec9b0;">Maj</span>::integer(3))),
         <span style="color: #ce9178;">"(1 2 3)"</span>);
        (maj_list(<span style="color: #c586c0;">maj_list!</span>(
            <span style="color: #4ec9b0;">Maj</span>::symbol(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #ce9178;">"a"</span>),
            <span style="color: #4ec9b0;">Maj</span>::integer(6),
            <span style="color: #4ec9b0;">Maj</span>::symbol(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #ce9178;">"b"</span>))),
         <span style="color: #ce9178;">"(a 6 b)"</span>);
        (maj_list(<span style="color: #4ec9b0;">Maj</span>::nil()), <span style="color: #ce9178;">"nil"</span>);
    );
}
</pre>
</div>
</div>
</div>
