10-testes.org
*** ~append~

#+begin_src rust
#[test]
fn primitives_append() {
    use crate::axioms::primitives::maj_append;
    let mut state = MajState::new();
    multi_test!(
        state;
        (maj_append(maj_list!(
            maj_list!(Maj::integer(1),
                      Maj::integer(2),
                      Maj::integer(3)),
            maj_list!(Maj::integer(4),
                      Maj::integer(5),
                      Maj::integer(6)))),
         "(1 2 3 4 5 6)");
        (maj_append(maj_list!(
            maj_list!(
                Maj::symbol(&mut state, "a"),
                maj_list!(
                    Maj::symbol(&mut state, "b"),
                    Maj::symbol(&mut state, "c")),
                Maj::symbol(&mut state, "d"),
                maj_list!(
                    Maj::symbol(&mut state, "e"))),
            maj_list!(
                Maj::symbol(&mut state, "f"),
                maj_list!(
                    Maj::symbol(&mut state, "g"),
                    Maj::symbol(&mut state, "h"))))),
         "(a (b c) d (e) f (g h))");
        (maj_append(maj_list!(
            maj_list!(
                Maj::symbol(&mut state, "a"),
                Maj::symbol(&mut state, "b"),
                Maj::symbol(&mut state, "c")),
            Maj::symbol(&mut state, "d"))),
         "(a b c . d)");
    );
}
#+end_src

*** ~last~

#+begin_src rust
#[test]
fn primitives_last() {
    use crate::axioms::primitives::maj_last;
    let mut state = MajState::new();
    let a = Maj::symbol(&mut state, "a");
    let b = Maj::symbol(&mut state, "b");
    let c = Maj::symbol(&mut state, "c");
    let d = Maj::symbol(&mut state, "d");
    multi_test!(
        state;
        (maj_last(maj_list!(a.clone(),
                            b.clone(),
                            c.clone(),
                            d.clone())),
         "(d)");
        (maj_last(maj_dotted_list!(
            a.clone(), b, c, d)),
         "(c . d)");
    );
    test_fail!(maj_last(a));
}
#+end_src

*** ~reverse~

#+begin_src rust
#[test]
fn primitives_reverse() {
    use crate::axioms::primitives::maj_reverse;
    let mut state = MajState::new();
    let a = Maj::symbol(&mut state, "a");
    let b = Maj::symbol(&mut state, "b");
    let c = Maj::symbol(&mut state, "c");
    let d = Maj::symbol(&mut state, "d");
    test_format!(
        state,
        maj_reverse(maj_list!(
            a.clone(), b.clone(), c.clone(), d.clone())),
        "(d c b a)");
    multi_fail_test!(
        maj_reverse(a.clone());
        maj_reverse(maj_dotted_list!(a, b, c, d));
    );
}
#+end_src

