doc/html/10-testes.html

<div id="outline-container-org3dca4d2" class="outline-4">
<h4 id="org3dca4d2"><span class="section-number-4">6.2.17.</span> <code>append</code></h4>
<div class="outline-text-4" id="text-6-2-17">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #c586c0;">#[test]</span>
<span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">primitives_append</span>() {
    <span style="color: #569cd6;">use</span> <span style="color: #569cd6;">crate</span>::<span style="color: #569cd6;">axioms</span>::<span style="color: #569cd6;">primitives</span>::maj_append;
    <span style="color: #569cd6;">let</span> <span style="color: #569cd6;">mut</span> <span style="color: #9cdcfe;">state</span> = <span style="color: #4ec9b0;">MajState</span>::new();
    <span style="color: #c586c0;">multi_test!</span>(
        state;
        (maj_append(<span style="color: #c586c0;">maj_list!</span>(
            <span style="color: #c586c0;">maj_list!</span>(<span style="color: #4ec9b0;">Maj</span>::integer(1),
                      <span style="color: #4ec9b0;">Maj</span>::integer(2),
                      <span style="color: #4ec9b0;">Maj</span>::integer(3)),
            <span style="color: #c586c0;">maj_list!</span>(<span style="color: #4ec9b0;">Maj</span>::integer(4),
                      <span style="color: #4ec9b0;">Maj</span>::integer(5),
                      <span style="color: #4ec9b0;">Maj</span>::integer(6)))),
         <span style="color: #ce9178;">"(1 2 3 4 5 6)"</span>);
        (maj_append(<span style="color: #c586c0;">maj_list!</span>(
            <span style="color: #c586c0;">maj_list!</span>(
                <span style="color: #4ec9b0;">Maj</span>::symbol(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #ce9178;">"a"</span>),
                <span style="color: #c586c0;">maj_list!</span>(
                    <span style="color: #4ec9b0;">Maj</span>::symbol(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #ce9178;">"b"</span>),
                    <span style="color: #4ec9b0;">Maj</span>::symbol(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #ce9178;">"c"</span>)),
                <span style="color: #4ec9b0;">Maj</span>::symbol(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #ce9178;">"d"</span>),
                <span style="color: #c586c0;">maj_list!</span>(
                    <span style="color: #4ec9b0;">Maj</span>::symbol(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #ce9178;">"e"</span>))),
            <span style="color: #c586c0;">maj_list!</span>(
                <span style="color: #4ec9b0;">Maj</span>::symbol(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #ce9178;">"f"</span>),
                <span style="color: #c586c0;">maj_list!</span>(
                    <span style="color: #4ec9b0;">Maj</span>::symbol(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #ce9178;">"g"</span>),
                    <span style="color: #4ec9b0;">Maj</span>::symbol(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #ce9178;">"h"</span>))))),
         <span style="color: #ce9178;">"(a (b c) d (e) f (g h))"</span>);
        (maj_append(<span style="color: #c586c0;">maj_list!</span>(
            <span style="color: #c586c0;">maj_list!</span>(
                <span style="color: #4ec9b0;">Maj</span>::symbol(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #ce9178;">"a"</span>),
                <span style="color: #4ec9b0;">Maj</span>::symbol(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #ce9178;">"b"</span>),
                <span style="color: #4ec9b0;">Maj</span>::symbol(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #ce9178;">"c"</span>)),
            <span style="color: #4ec9b0;">Maj</span>::symbol(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #ce9178;">"d"</span>))),
         <span style="color: #ce9178;">"(a b c . d)"</span>);
    );
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org8c5212e" class="outline-4">
<h4 id="org8c5212e"><span class="section-number-4">6.2.18.</span> <code>last</code></h4>
<div class="outline-text-4" id="text-6-2-18">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #c586c0;">#[test]</span>
<span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">primitives_last</span>() {
    <span style="color: #569cd6;">use</span> <span style="color: #569cd6;">crate</span>::<span style="color: #569cd6;">axioms</span>::<span style="color: #569cd6;">primitives</span>::maj_last;
    <span style="color: #569cd6;">let</span> <span style="color: #569cd6;">mut</span> <span style="color: #9cdcfe;">state</span> = <span style="color: #4ec9b0;">MajState</span>::new();
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">a</span> = <span style="color: #4ec9b0;">Maj</span>::symbol(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #ce9178;">"a"</span>);
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">b</span> = <span style="color: #4ec9b0;">Maj</span>::symbol(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #ce9178;">"b"</span>);
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">c</span> = <span style="color: #4ec9b0;">Maj</span>::symbol(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #ce9178;">"c"</span>);
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">d</span> = <span style="color: #4ec9b0;">Maj</span>::symbol(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #ce9178;">"d"</span>);
    <span style="color: #c586c0;">multi_test!</span>(
        state;
        (maj_last(<span style="color: #c586c0;">maj_list!</span>(a.clone(),
                            b.clone(),
                            c.clone(),
                            d.clone())),
         <span style="color: #ce9178;">"(d)"</span>);
        (maj_last(<span style="color: #c586c0;">maj_dotted_list!</span>(
            a.clone(), b, c, d)),
         <span style="color: #ce9178;">"(c . d)"</span>);
    );
    <span style="color: #c586c0;">test_fail!</span>(maj_last(a));
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org73d8318" class="outline-4">
<h4 id="org73d8318"><span class="section-number-4">6.2.19.</span> <code>reverse</code></h4>
<div class="outline-text-4" id="text-6-2-19">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #c586c0;">#[test]</span>
<span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">primitives_reverse</span>() {
    <span style="color: #569cd6;">use</span> <span style="color: #569cd6;">crate</span>::<span style="color: #569cd6;">axioms</span>::<span style="color: #569cd6;">primitives</span>::maj_reverse;
    <span style="color: #569cd6;">let</span> <span style="color: #569cd6;">mut</span> <span style="color: #9cdcfe;">state</span> = <span style="color: #4ec9b0;">MajState</span>::new();
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">a</span> = <span style="color: #4ec9b0;">Maj</span>::symbol(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #ce9178;">"a"</span>);
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">b</span> = <span style="color: #4ec9b0;">Maj</span>::symbol(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #ce9178;">"b"</span>);
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">c</span> = <span style="color: #4ec9b0;">Maj</span>::symbol(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #ce9178;">"c"</span>);
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">d</span> = <span style="color: #4ec9b0;">Maj</span>::symbol(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #ce9178;">"d"</span>);
    test_<span style="color: #c586c0;">format!</span>(
        state,
        maj_reverse(<span style="color: #c586c0;">maj_list!</span>(
            a.clone(), b.clone(), c.clone(), d.clone())),
        <span style="color: #ce9178;">"(d c b a)"</span>);
    <span style="color: #c586c0;">multi_fail_test!</span>(
        maj_reverse(a.clone());
        maj_reverse(<span style="color: #c586c0;">maj_dotted_list!</span>(a, b, c, d));
    );
}
</pre>
</div>
</div>
</div>
