10-testes.org
*** ~nthcdr~

#+begin_src rust
#[test]
fn primitives_nthcdr() {
    use crate::axioms::primitives::maj_nthcdr;
    let state = MajState::new();
    let list = maj_list!(Maj::integer(1),
                         Maj::integer(2),
                         Maj::integer(3),
                         Maj::integer(4));
    let dlist = maj_dotted_list!(Maj::integer(1),
                                 Maj::integer(2),
                                 Maj::integer(3),
                                 Maj::integer(4));
    multi_test!(
        state;
        (maj_nthcdr(Maj::integer(0), list.clone()),
         "(1 2 3 4)");
        (maj_nthcdr(Maj::integer(1), list.clone()),
         "(2 3 4)");
        (maj_nthcdr(Maj::integer(3), list.clone()),
         "(4)");
    );
    multi_fail_test!(
        maj_nthcdr(Maj::integer(3), dlist);
        maj_nthcdr(Maj::integer(-1), list.clone());
        maj_nthcdr(Maj::fraction(3, 4), list.clone());
    );
    multi_test!(
        state;
        (maj_nthcdr(Maj::integer(4), list.clone()),
         "nil");
        (maj_nthcdr(Maj::integer(5), list), "nil");
        (maj_nthcdr(Maj::integer(50), Maj::nil()), "nil");
    );
}
#+end_src

*** ~nth~

#+begin_src rust
#[test]
fn primitives_nth() {
    use crate::axioms::primitives::maj_nth;
    let state = MajState::new();
    let list = maj_list!(Maj::integer(1),
                         Maj::integer(2),
                         Maj::integer(3),
                         Maj::integer(4));
    let dlist = maj_dotted_list!(Maj::integer(1),
                                 Maj::integer(2),
                                 Maj::integer(3),
                                 Maj::integer(4));
    multi_test!(
        state;
        (maj_nth(Maj::integer(0), list.clone()),
         "1");
        (maj_nth(Maj::integer(3), list.clone()),
         "4");
    );
    multi_fail_test!(
        maj_nth(Maj::integer(3), dlist);
        maj_nth(Maj::integer(-1), list.clone());
        maj_nth(Maj::fraction(3, 4), list.clone());
    );
    multi_test!(
        state;
        (maj_nth(Maj::integer(4), list.clone()),
         "nil");
        (maj_nth(Maj::integer(5), list), "nil");
        (maj_nth(Maj::integer(50), Maj::nil()), "nil");
    );
}
#+end_src

*** TODO ~macroexpand-1~

#+begin_src rust
#[test]
#[ignore]
fn primitives_macroexpand_1() {
    unimplemented!();
}
#+end_src

*** TODO ~macroexpand~

#+begin_src rust
#[test]
#[ignore]
fn primitives_macroexpand() {
    unimplemented!();
}
#+end_src

*** ~not~

#+begin_src rust
#[test]
fn primitives_not() {
    use crate::axioms::primitives::maj_not;
    let mut state = MajState::new();
    multi_test!(
        state;
        (maj_not(Maj::integer(1)), "nil");
        (maj_not(maj_list!(Maj::symbol(&mut state, "a"),
                           Maj::symbol(&mut state, "b"),
                           Maj::symbol(&mut state, "c"))),
         "nil");
        (maj_not(Maj::t()), "nil");
        (maj_not(Maj::nil()), "t");
    );
}
#+end_src

*** ~gensym~

#+begin_src rust
#[test]
fn primitives_gensym() {
    use crate::axioms::primitives::maj_gensym;
    // Generate a few symbols and that's it.
    let mut state = MajState::new();
    let n = 100;
    for _ in 0..n {
        test_regex!(state, maj_gensym(&mut state), r"^:G[0-9]*$");
    }
}
#+end_src

** Funções para vetores

