doc/html/10-testes.html

<div id="outline-container-orgb943c26" class="outline-4">
<h4 id="orgb943c26"><span class="section-number-4">6.2.20.</span> <code>nthcdr</code></h4>
<div class="outline-text-4" id="text-6-2-20">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #c586c0;">#[test]</span>
<span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">primitives_nthcdr</span>() {
    <span style="color: #569cd6;">use</span> <span style="color: #569cd6;">crate</span>::<span style="color: #569cd6;">axioms</span>::<span style="color: #569cd6;">primitives</span>::maj_nthcdr;
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">state</span> = <span style="color: #4ec9b0;">MajState</span>::new();
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">list</span> = <span style="color: #c586c0;">maj_list!</span>(<span style="color: #4ec9b0;">Maj</span>::integer(1),
                         <span style="color: #4ec9b0;">Maj</span>::integer(2),
                         <span style="color: #4ec9b0;">Maj</span>::integer(3),
                         <span style="color: #4ec9b0;">Maj</span>::integer(4));
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">dlist</span> = <span style="color: #c586c0;">maj_dotted_list!</span>(<span style="color: #4ec9b0;">Maj</span>::integer(1),
                                 <span style="color: #4ec9b0;">Maj</span>::integer(2),
                                 <span style="color: #4ec9b0;">Maj</span>::integer(3),
                                 <span style="color: #4ec9b0;">Maj</span>::integer(4));
    <span style="color: #c586c0;">multi_test!</span>(
        state;
        (maj_nthcdr(<span style="color: #4ec9b0;">Maj</span>::integer(0), list.clone()),
         <span style="color: #ce9178;">"(1 2 3 4)"</span>);
        (maj_nthcdr(<span style="color: #4ec9b0;">Maj</span>::integer(1), list.clone()),
         <span style="color: #ce9178;">"(2 3 4)"</span>);
        (maj_nthcdr(<span style="color: #4ec9b0;">Maj</span>::integer(3), list.clone()),
         <span style="color: #ce9178;">"(4)"</span>);
    );
    <span style="color: #c586c0;">multi_fail_test!</span>(
        maj_nthcdr(<span style="color: #4ec9b0;">Maj</span>::integer(3), dlist);
        maj_nthcdr(<span style="color: #4ec9b0;">Maj</span>::integer(-1), list.clone());
        maj_nthcdr(<span style="color: #4ec9b0;">Maj</span>::fraction(3, 4), list.clone());
    );
    <span style="color: #c586c0;">multi_test!</span>(
        state;
        (maj_nthcdr(<span style="color: #4ec9b0;">Maj</span>::integer(4), list.clone()),
         <span style="color: #ce9178;">"nil"</span>);
        (maj_nthcdr(<span style="color: #4ec9b0;">Maj</span>::integer(5), list), <span style="color: #ce9178;">"nil"</span>);
        (maj_nthcdr(<span style="color: #4ec9b0;">Maj</span>::integer(50), <span style="color: #4ec9b0;">Maj</span>::nil()), <span style="color: #ce9178;">"nil"</span>);
    );
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org90737ca" class="outline-4">
<h4 id="org90737ca"><span class="section-number-4">6.2.21.</span> <code>nth</code></h4>
<div class="outline-text-4" id="text-6-2-21">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #c586c0;">#[test]</span>
<span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">primitives_nth</span>() {
    <span style="color: #569cd6;">use</span> <span style="color: #569cd6;">crate</span>::<span style="color: #569cd6;">axioms</span>::<span style="color: #569cd6;">primitives</span>::maj_nth;
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">state</span> = <span style="color: #4ec9b0;">MajState</span>::new();
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">list</span> = <span style="color: #c586c0;">maj_list!</span>(<span style="color: #4ec9b0;">Maj</span>::integer(1),
                         <span style="color: #4ec9b0;">Maj</span>::integer(2),
                         <span style="color: #4ec9b0;">Maj</span>::integer(3),
                         <span style="color: #4ec9b0;">Maj</span>::integer(4));
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">dlist</span> = <span style="color: #c586c0;">maj_dotted_list!</span>(<span style="color: #4ec9b0;">Maj</span>::integer(1),
                                 <span style="color: #4ec9b0;">Maj</span>::integer(2),
                                 <span style="color: #4ec9b0;">Maj</span>::integer(3),
                                 <span style="color: #4ec9b0;">Maj</span>::integer(4));
    <span style="color: #c586c0;">multi_test!</span>(
        state;
        (maj_nth(<span style="color: #4ec9b0;">Maj</span>::integer(0), list.clone()),
         <span style="color: #ce9178;">"1"</span>);
        (maj_nth(<span style="color: #4ec9b0;">Maj</span>::integer(3), list.clone()),
         <span style="color: #ce9178;">"4"</span>);
    );
    <span style="color: #c586c0;">multi_fail_test!</span>(
        maj_nth(<span style="color: #4ec9b0;">Maj</span>::integer(3), dlist);
        maj_nth(<span style="color: #4ec9b0;">Maj</span>::integer(-1), list.clone());
        maj_nth(<span style="color: #4ec9b0;">Maj</span>::fraction(3, 4), list.clone());
    );
    <span style="color: #c586c0;">multi_test!</span>(
        state;
        (maj_nth(<span style="color: #4ec9b0;">Maj</span>::integer(4), list.clone()),
         <span style="color: #ce9178;">"nil"</span>);
        (maj_nth(<span style="color: #4ec9b0;">Maj</span>::integer(5), list), <span style="color: #ce9178;">"nil"</span>);
        (maj_nth(<span style="color: #4ec9b0;">Maj</span>::integer(50), <span style="color: #4ec9b0;">Maj</span>::nil()), <span style="color: #ce9178;">"nil"</span>);
    );
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org19d668f" class="outline-4">
<h4 id="org19d668f"><span class="section-number-4">6.2.22.</span> <span class="todo TODO">TODO</span> <code>macroexpand-1</code></h4>
<div class="outline-text-4" id="text-6-2-22">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #c586c0;">#[test]</span>
<span style="color: #c586c0;">#[ignore]</span>
<span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">primitives_macroexpand_1</span>() {
    <span style="color: #c586c0;">unimplemented!</span>();
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org8c165cf" class="outline-4">
<h4 id="org8c165cf"><span class="section-number-4">6.2.23.</span> <span class="todo TODO">TODO</span> <code>macroexpand</code></h4>
<div class="outline-text-4" id="text-6-2-23">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #c586c0;">#[test]</span>
<span style="color: #c586c0;">#[ignore]</span>
<span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">primitives_macroexpand</span>() {
    <span style="color: #c586c0;">unimplemented!</span>();
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org8a9ac73" class="outline-4">
<h4 id="org8a9ac73"><span class="section-number-4">6.2.24.</span> <code>not</code></h4>
<div class="outline-text-4" id="text-6-2-24">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #c586c0;">#[test]</span>
<span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">primitives_not</span>() {
    <span style="color: #569cd6;">use</span> <span style="color: #569cd6;">crate</span>::<span style="color: #569cd6;">axioms</span>::<span style="color: #569cd6;">primitives</span>::maj_not;
    <span style="color: #569cd6;">let</span> <span style="color: #569cd6;">mut</span> <span style="color: #9cdcfe;">state</span> = <span style="color: #4ec9b0;">MajState</span>::new();
    <span style="color: #c586c0;">multi_test!</span>(
        state;
        (maj_not(<span style="color: #4ec9b0;">Maj</span>::integer(1)), <span style="color: #ce9178;">"nil"</span>);
        (maj_not(<span style="color: #c586c0;">maj_list!</span>(<span style="color: #4ec9b0;">Maj</span>::symbol(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #ce9178;">"a"</span>),
                           <span style="color: #4ec9b0;">Maj</span>::symbol(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #ce9178;">"b"</span>),
                           <span style="color: #4ec9b0;">Maj</span>::symbol(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #ce9178;">"c"</span>))),
         <span style="color: #ce9178;">"nil"</span>);
        (maj_not(<span style="color: #4ec9b0;">Maj</span>::t()), <span style="color: #ce9178;">"nil"</span>);
        (maj_not(<span style="color: #4ec9b0;">Maj</span>::nil()), <span style="color: #ce9178;">"t"</span>);
    );
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org9c7d944" class="outline-4">
<h4 id="org9c7d944"><span class="section-number-4">6.2.25.</span> <code>gensym</code></h4>
<div class="outline-text-4" id="text-6-2-25">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #c586c0;">#[test]</span>
<span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">primitives_gensym</span>() {
    <span style="color: #569cd6;">use</span> <span style="color: #569cd6;">crate</span>::<span style="color: #569cd6;">axioms</span>::<span style="color: #569cd6;">primitives</span>::maj_gensym;
    <span style="color: #6a9955;">// </span><span style="color: #6a9955;">Generate a few symbols and that's it.</span>
    <span style="color: #569cd6;">let</span> <span style="color: #569cd6;">mut</span> <span style="color: #9cdcfe;">state</span> = <span style="color: #4ec9b0;">MajState</span>::new();
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">n</span> = 100;
    <span style="color: #569cd6;">for</span> <span style="color: #9cdcfe;">_</span> <span style="color: #569cd6;">in</span> 0..n {
        <span style="color: #c586c0;">test_regex!</span>(state, maj_gensym(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state), <span style="color: #ce9178;">r"^:G[0-9]*$"</span>);
    }
}
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgf8639e8" class="outline-3">
<h3 id="orgf8639e8"><span class="section-number-3">6.3.</span> Funções para vetores</h3>
<div class="outline-text-3" id="text-6-3">
</div>
