10-testes.org
*** ~vector~ e ~vec-type~

#+begin_src rust
#[test]
fn primitives_vector_vec_type() {
    use crate::axioms::primitives::{
        maj_vector,
        maj_vec_type
    };
    let mut state = MajState::new();
    let v1 = maj_vector(&mut state, Maj::nil());
    let v2 = maj_vector(&mut state, maj_list!(Maj::integer(1),
                                              Maj::integer(2),
                                              Maj::integer(3),
                                              Maj::integer(4)));
    let v3 = maj_vector(&mut state, maj_list!(Maj::float(1.0),
                                              Maj::float(3.0),
                                              Maj::float(2.5)));
    let v4 = maj_vector(&mut state, maj_list!(Maj::character('H'),
                                              Maj::character('e'),
                                              Maj::character('l'),
                                              Maj::character('l'),
                                              Maj::character('o')));
    let blah = Maj::symbol(&mut state, "blah");
    let v5 = maj_vector(&mut state, maj_list!(Maj::float(1.0),
                                              Maj::integer(3),
                                              Maj::fraction(2, 5),
                                              Maj::complex(
                                                  Maj::integer(2),
                                                  Maj::integer(6)),
                                              blah));
    multi_test!(
        state;
        (v1.clone(), "[]");
        (maj_vec_type(&mut state, v1), "any");
        (v2.clone(), "[1 2 3 4]");
        (maj_vec_type(&mut state, v2), "integer");
        (v3.clone(), "[1.0 3.0 2.5]");
        (maj_vec_type(&mut state, v3), "float");
        (v4.clone(), "\"Hello\"");
        (maj_vec_type(&mut state, v4), "char");
        (v5.clone(), "[1.0 3 2/5 2J6 blah]");
        (maj_vec_type(&mut state, v5), "any");
    );
}
#+end_src

*** ~vec-coerce~

#+begin_src rust
#[test]
fn primitive_vec_coerce() {
    use crate::axioms::primitives::{
        maj_vector,
        maj_vec_push,
        maj_vec_type,
        maj_vec_coerce
    };
    let mut state = MajState::new();
    let integer = Maj::symbol(&mut state, "integer");
    let any = Maj::symbol(&mut state, "any");
    let v = maj_vector(&mut state, Maj::nil());
    test_format!(state, maj_vec_type(&mut state, v.clone()), "any");
    
    let _ = maj_vec_push(&mut state, v.clone(), Maj::integer(2));
    let _ = maj_vec_push(&mut state, v.clone(), Maj::integer(3));
    test_format!(state, maj_vec_type(&mut state, v.clone()), "any");
    
    let v2 = maj_vec_coerce(&mut state, integer, v);
    test_format!(state, maj_vec_type(&mut state, v2), "integer");

    test_format!(state, maj_vec_coerce(&mut state, any, Maj::string("Hello")),
                 "[#\\H #\\e #\\l #\\l #\\o]");
}
#+end_src

