doc/html/10-testes.html
<div id="outline-container-orgd1444db" class="outline-4">
<h4 id="orgd1444db"><span class="section-number-4">6.3.1.</span> <code>vector</code> e <code>vec-type</code></h4>
<div class="outline-text-4" id="text-6-3-1">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #c586c0;">#[test]</span>
<span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">primitives_vector_vec_type</span>() {
    <span style="color: #569cd6;">use</span> <span style="color: #569cd6;">crate</span>::<span style="color: #569cd6;">axioms</span>::<span style="color: #569cd6;">primitives</span>::{
        maj_vector,
        maj_vec_type
    };
    <span style="color: #569cd6;">let</span> <span style="color: #569cd6;">mut</span> <span style="color: #9cdcfe;">state</span> = <span style="color: #4ec9b0;">MajState</span>::new();
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">v1</span> = maj_vector(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #4ec9b0;">Maj</span>::nil());
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">v2</span> = maj_vector(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #c586c0;">maj_list!</span>(<span style="color: #4ec9b0;">Maj</span>::integer(1),
                                              <span style="color: #4ec9b0;">Maj</span>::integer(2),
                                              <span style="color: #4ec9b0;">Maj</span>::integer(3),
                                              <span style="color: #4ec9b0;">Maj</span>::integer(4)));
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">v3</span> = maj_vector(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #c586c0;">maj_list!</span>(<span style="color: #4ec9b0;">Maj</span>::float(1.0),
                                              <span style="color: #4ec9b0;">Maj</span>::float(3.0),
                                              <span style="color: #4ec9b0;">Maj</span>::float(2.5)));
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">v4</span> = maj_vector(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #c586c0;">maj_list!</span>(<span style="color: #4ec9b0;">Maj</span>::character(<span style="color: #ce9178;">'H'</span>),
                                              <span style="color: #4ec9b0;">Maj</span>::character(<span style="color: #ce9178;">'e'</span>),
                                              <span style="color: #4ec9b0;">Maj</span>::character(<span style="color: #ce9178;">'l'</span>),
                                              <span style="color: #4ec9b0;">Maj</span>::character(<span style="color: #ce9178;">'l'</span>),
                                              <span style="color: #4ec9b0;">Maj</span>::character(<span style="color: #ce9178;">'o'</span>)));
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">blah</span> = <span style="color: #4ec9b0;">Maj</span>::symbol(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #ce9178;">"blah"</span>);
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">v5</span> = maj_vector(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #c586c0;">maj_list!</span>(<span style="color: #4ec9b0;">Maj</span>::float(1.0),
                                              <span style="color: #4ec9b0;">Maj</span>::integer(3),
                                              <span style="color: #4ec9b0;">Maj</span>::fraction(2, 5),
                                              <span style="color: #4ec9b0;">Maj</span>::complex(
                                                  <span style="color: #4ec9b0;">Maj</span>::integer(2),
                                                  <span style="color: #4ec9b0;">Maj</span>::integer(6)),
                                              blah));
    <span style="color: #c586c0;">multi_test!</span>(
        state;
        (v1.clone(), <span style="color: #ce9178;">"[]"</span>);
        (maj_vec_type(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, v1), <span style="color: #ce9178;">"any"</span>);
        (v2.clone(), <span style="color: #ce9178;">"[1 2 3 4]"</span>);
        (maj_vec_type(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, v2), <span style="color: #ce9178;">"integer"</span>);
        (v3.clone(), <span style="color: #ce9178;">"[1.0 3.0 2.5]"</span>);
        (maj_vec_type(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, v3), <span style="color: #ce9178;">"float"</span>);
        (v4.clone(), <span style="color: #ce9178;">"\"Hello\""</span>);
        (maj_vec_type(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, v4), <span style="color: #ce9178;">"char"</span>);
        (v5.clone(), <span style="color: #ce9178;">"[1.0 3 2/5 2J6 blah]"</span>);
        (maj_vec_type(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, v5), <span style="color: #ce9178;">"any"</span>);
    );
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orgb016e4b" class="outline-4">
<h4 id="orgb016e4b"><span class="section-number-4">6.3.2.</span> <code>vec-coerce</code></h4>
<div class="outline-text-4" id="text-6-3-2">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #c586c0;">#[test]</span>
<span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">primitive_vec_coerce</span>() {
    <span style="color: #569cd6;">use</span> <span style="color: #569cd6;">crate</span>::<span style="color: #569cd6;">axioms</span>::<span style="color: #569cd6;">primitives</span>::{
        maj_vector,
        maj_vec_push,
        maj_vec_type,
        maj_vec_coerce
    };
    <span style="color: #569cd6;">let</span> <span style="color: #569cd6;">mut</span> <span style="color: #9cdcfe;">state</span> = <span style="color: #4ec9b0;">MajState</span>::new();
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">integer</span> = <span style="color: #4ec9b0;">Maj</span>::symbol(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #ce9178;">"integer"</span>);
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">any</span> = <span style="color: #4ec9b0;">Maj</span>::symbol(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #ce9178;">"any"</span>);
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">v</span> = maj_vector(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #4ec9b0;">Maj</span>::nil());
    test_<span style="color: #c586c0;">format!</span>(state, maj_vec_type(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, v.clone()), <span style="color: #ce9178;">"any"</span>);
    
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">_</span> = maj_vec_push(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, v.clone(), <span style="color: #4ec9b0;">Maj</span>::integer(2));
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">_</span> = maj_vec_push(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, v.clone(), <span style="color: #4ec9b0;">Maj</span>::integer(3));
    test_<span style="color: #c586c0;">format!</span>(state, maj_vec_type(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, v.clone()), <span style="color: #ce9178;">"any"</span>);
    
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">v2</span> = maj_vec_coerce(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, integer, v);
    test_<span style="color: #c586c0;">format!</span>(state, maj_vec_type(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, v2), <span style="color: #ce9178;">"integer"</span>);

    test_<span style="color: #c586c0;">format!</span>(state, maj_vec_coerce(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, any, <span style="color: #4ec9b0;">Maj</span>::string(<span style="color: #ce9178;">"Hello"</span>)),
                 <span style="color: #ce9178;">"[#\\H #\\e #\\l #\\l #\\o]"</span>);
}
</pre>
</div>
</div>
</div>
