10-testes.org
*** ~vec-push~

#+begin_src rust
#[test]
fn primitives_vec_push() {
    use crate::axioms::primitives::maj_vec_push;
    let mut state = MajState::new();
    
    let v = Maj::vector_integer(vec![]);
    multi_test!(
        state;
        (v.clone(), "[]");
        (maj_vec_push(&mut state, Maj::integer(5), v.clone()), "[5]");
        (maj_vec_push(&mut state, Maj::integer(6), v.clone()), "[5 6]");
    );

    let a = Maj::symbol(&mut state, "a");
    test_fail!(maj_vec_push(&mut state, a.clone(), v.clone()));

    let myvec = Maj::vector_any(vec![]);
    let elements = vec![
        Maj::integer(5), Maj::integer(6), a,
        Maj::fraction(2, 3)
    ];
    for elt in &elements {
        test_dont_fail!(
            maj_vec_push(&mut state, elt.clone(), myvec.clone()));
    }
    test_format!(state, myvec, "[5 6 a 2/3]");
}
#+end_src

*** ~vec-set~

#+begin_src rust
#[test]
fn primitives_vec_set() {
    use crate::axioms::primitives::maj_vec_set;
    let state = MajState::new();
    let v = Maj::vector_integer(vec![1, 2, 3, 4, 5]);
    multi_test!(
        state;
        (maj_vec_set(Maj::integer(2), Maj::integer(50), v.clone()),
         "[1 2 50 4 5]");
        (maj_vec_set(Maj::integer(4), Maj::integer(10), v.clone()),
         "[1 2 50 4 10]");
    );
    test_fail!(
        maj_vec_set(Maj::integer(5), Maj::integer(90), v.clone()));
}
#+end_src

*** ~vec-pop~

#+begin_src rust
#[test]
fn primitives_vec_pop() {
    use crate::axioms::primitives::maj_vec_pop;
    let state = MajState::new();
    let v = Maj::vector_integer(vec![1, 2, 3]);
    multi_test!(
        state;
        (v.clone(), "[1 2 3]");
        (maj_vec_pop(v.clone()), "3");
        (maj_vec_pop(v.clone()), "2");
        (maj_vec_pop(v.clone()), "1");
        (maj_vec_pop(v.clone()), "nil");
        (v, "[]");
    );
    test_fail!(maj_vec_pop(Maj::fraction(2, 3)));
}
#+end_src

*** ~vec-deq~

#+begin_src rust
#[test]
fn primitives_vec_deq() {
    use crate::axioms::primitives::maj_vec_deq;
    let state = MajState::new();
    let v = Maj::vector_integer(vec![0, 1, 2]);
    multi_test!(
        state;
        (v.clone(), "[0 1 2]");
        (maj_vec_deq(v.clone()), "0");
        (maj_vec_deq(v.clone()), "1");
        (maj_vec_deq(v.clone()), "2");
        (maj_vec_deq(v.clone()), "nil");
        (v, "[]");
    );
    test_fail!(maj_vec_deq(Maj::fraction(2, 3)));
}
#+end_src

*** ~vec-length~

#+begin_src rust
#[test]
fn primitives_vec_length() {
    use crate::axioms::primitives::{
        maj_vec_length,
        maj_iota,
        maj_reverse,
        maj_vector
    };
    let mut state = MajState::new();
    multi_test!(
        state;
        (maj_vec_length(Maj::vector_any(vec![])), "0");
        (maj_vec_length(Maj::vector_integer(vec![1, 2, 3, 4])), "4");
        ({
            let iota50 = maj_iota(Maj::integer(50));
            let reviota = maj_reverse(iota50);
            let v = maj_vector(&mut state, reviota);
            maj_vec_length(v)
        }, "50");
    );
    test_fail!(maj_vec_length(state.make_stream_stdin()));
}
#+end_src

*** ~vec-at~

#+begin_src rust
#[test]
fn primitives_vec_at() {
    use crate::axioms::primitives::maj_vec_at;
    let state = MajState::new();
    multi_test!(
        state;
        (maj_vec_at(Maj::integer(1),
                    Maj::vector_integer(vec![1, 2, 3])),
         "2");
        (maj_vec_at(Maj::integer(0), Maj::string("Hello")),
         "#\\H");
    );
    multi_fail_test!(
        maj_vec_at(Maj::integer(5), Maj::string("Hello"));
        maj_vec_at(Maj::integer(5),
                   maj_list!(Maj::integer(1),
                             Maj::integer(2),
                             Maj::integer(3)));
    );
}
#+end_src

