doc/html/10-testes.html

<div id="outline-container-org18c5fbf" class="outline-4">
<h4 id="org18c5fbf"><span class="section-number-4">6.3.3.</span> <code>vec-push</code></h4>
<div class="outline-text-4" id="text-6-3-3">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #c586c0;">#[test]</span>
<span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">primitives_vec_push</span>() {
    <span style="color: #569cd6;">use</span> <span style="color: #569cd6;">crate</span>::<span style="color: #569cd6;">axioms</span>::<span style="color: #569cd6;">primitives</span>::maj_vec_push;
    <span style="color: #569cd6;">let</span> <span style="color: #569cd6;">mut</span> <span style="color: #9cdcfe;">state</span> = <span style="color: #4ec9b0;">MajState</span>::new();
    
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">v</span> = <span style="color: #4ec9b0;">Maj</span>::vector_integer(<span style="color: #c586c0;">vec!</span>[]);
    <span style="color: #c586c0;">multi_test!</span>(
        state;
        (v.clone(), <span style="color: #ce9178;">"[]"</span>);
        (maj_vec_push(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #4ec9b0;">Maj</span>::integer(5), v.clone()), <span style="color: #ce9178;">"[5]"</span>);
        (maj_vec_push(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #4ec9b0;">Maj</span>::integer(6), v.clone()), <span style="color: #ce9178;">"[5 6]"</span>);
    );

    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">a</span> = <span style="color: #4ec9b0;">Maj</span>::symbol(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #ce9178;">"a"</span>);
    <span style="color: #c586c0;">test_fail!</span>(maj_vec_push(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, a.clone(), v.clone()));

    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">myvec</span> = <span style="color: #4ec9b0;">Maj</span>::vector_any(<span style="color: #c586c0;">vec!</span>[]);
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">elements</span> = <span style="color: #c586c0;">vec!</span>[
        <span style="color: #4ec9b0;">Maj</span>::integer(5), <span style="color: #4ec9b0;">Maj</span>::integer(6), a,
        <span style="color: #4ec9b0;">Maj</span>::fraction(2, 3)
    ];
    <span style="color: #569cd6;">for</span> <span style="color: #9cdcfe;">elt</span> <span style="color: #569cd6;">in</span> <span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span>elements {
        <span style="color: #c586c0;">test_dont_fail!</span>(
            maj_vec_push(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, elt.clone(), myvec.clone()));
    }
    test_<span style="color: #c586c0;">format!</span>(state, myvec, <span style="color: #ce9178;">"[5 6 a 2/3]"</span>);
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orgb040bbf" class="outline-4">
<h4 id="orgb040bbf"><span class="section-number-4">6.3.4.</span> <code>vec-set</code></h4>
<div class="outline-text-4" id="text-6-3-4">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #c586c0;">#[test]</span>
<span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">primitives_vec_set</span>() {
    <span style="color: #569cd6;">use</span> <span style="color: #569cd6;">crate</span>::<span style="color: #569cd6;">axioms</span>::<span style="color: #569cd6;">primitives</span>::maj_vec_set;
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">state</span> = <span style="color: #4ec9b0;">MajState</span>::new();
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">v</span> = <span style="color: #4ec9b0;">Maj</span>::vector_integer(<span style="color: #c586c0;">vec!</span>[1, 2, 3, 4, 5]);
    <span style="color: #c586c0;">multi_test!</span>(
        state;
        (maj_vec_set(<span style="color: #4ec9b0;">Maj</span>::integer(2), <span style="color: #4ec9b0;">Maj</span>::integer(50), v.clone()),
         <span style="color: #ce9178;">"[1 2 50 4 5]"</span>);
        (maj_vec_set(<span style="color: #4ec9b0;">Maj</span>::integer(4), <span style="color: #4ec9b0;">Maj</span>::integer(10), v.clone()),
         <span style="color: #ce9178;">"[1 2 50 4 10]"</span>);
    );
    <span style="color: #c586c0;">test_fail!</span>(
        maj_vec_set(<span style="color: #4ec9b0;">Maj</span>::integer(5), <span style="color: #4ec9b0;">Maj</span>::integer(90), v.clone()));
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org7846330" class="outline-4">
<h4 id="org7846330"><span class="section-number-4">6.3.5.</span> <code>vec-pop</code></h4>
<div class="outline-text-4" id="text-6-3-5">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #c586c0;">#[test]</span>
<span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">primitives_vec_pop</span>() {
    <span style="color: #569cd6;">use</span> <span style="color: #569cd6;">crate</span>::<span style="color: #569cd6;">axioms</span>::<span style="color: #569cd6;">primitives</span>::maj_vec_pop;
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">state</span> = <span style="color: #4ec9b0;">MajState</span>::new();
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">v</span> = <span style="color: #4ec9b0;">Maj</span>::vector_integer(<span style="color: #c586c0;">vec!</span>[1, 2, 3]);
    <span style="color: #c586c0;">multi_test!</span>(
        state;
        (v.clone(), <span style="color: #ce9178;">"[1 2 3]"</span>);
        (maj_vec_pop(v.clone()), <span style="color: #ce9178;">"3"</span>);
        (maj_vec_pop(v.clone()), <span style="color: #ce9178;">"2"</span>);
        (maj_vec_pop(v.clone()), <span style="color: #ce9178;">"1"</span>);
        (maj_vec_pop(v.clone()), <span style="color: #ce9178;">"nil"</span>);
        (v, <span style="color: #ce9178;">"[]"</span>);
    );
    <span style="color: #c586c0;">test_fail!</span>(maj_vec_pop(<span style="color: #4ec9b0;">Maj</span>::fraction(2, 3)));
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orgf146c54" class="outline-4">
<h4 id="orgf146c54"><span class="section-number-4">6.3.6.</span> <code>vec-deq</code></h4>
<div class="outline-text-4" id="text-6-3-6">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #c586c0;">#[test]</span>
<span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">primitives_vec_deq</span>() {
    <span style="color: #569cd6;">use</span> <span style="color: #569cd6;">crate</span>::<span style="color: #569cd6;">axioms</span>::<span style="color: #569cd6;">primitives</span>::maj_vec_deq;
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">state</span> = <span style="color: #4ec9b0;">MajState</span>::new();
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">v</span> = <span style="color: #4ec9b0;">Maj</span>::vector_integer(<span style="color: #c586c0;">vec!</span>[0, 1, 2]);
    <span style="color: #c586c0;">multi_test!</span>(
        state;
        (v.clone(), <span style="color: #ce9178;">"[0 1 2]"</span>);
        (maj_vec_deq(v.clone()), <span style="color: #ce9178;">"0"</span>);
        (maj_vec_deq(v.clone()), <span style="color: #ce9178;">"1"</span>);
        (maj_vec_deq(v.clone()), <span style="color: #ce9178;">"2"</span>);
        (maj_vec_deq(v.clone()), <span style="color: #ce9178;">"nil"</span>);
        (v, <span style="color: #ce9178;">"[]"</span>);
    );
    <span style="color: #c586c0;">test_fail!</span>(maj_vec_deq(<span style="color: #4ec9b0;">Maj</span>::fraction(2, 3)));
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org057e804" class="outline-4">
<h4 id="org057e804"><span class="section-number-4">6.3.7.</span> <code>vec-length</code></h4>
<div class="outline-text-4" id="text-6-3-7">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #c586c0;">#[test]</span>
<span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">primitives_vec_length</span>() {
    <span style="color: #569cd6;">use</span> <span style="color: #569cd6;">crate</span>::<span style="color: #569cd6;">axioms</span>::<span style="color: #569cd6;">primitives</span>::{
        maj_vec_length,
        maj_iota,
        maj_reverse,
        maj_vector
    };
    <span style="color: #569cd6;">let</span> <span style="color: #569cd6;">mut</span> <span style="color: #9cdcfe;">state</span> = <span style="color: #4ec9b0;">MajState</span>::new();
    <span style="color: #c586c0;">multi_test!</span>(
        state;
        (maj_vec_length(<span style="color: #4ec9b0;">Maj</span>::vector_any(<span style="color: #c586c0;">vec!</span>[])), <span style="color: #ce9178;">"0"</span>);
        (maj_vec_length(<span style="color: #4ec9b0;">Maj</span>::vector_integer(<span style="color: #c586c0;">vec!</span>[1, 2, 3, 4])), <span style="color: #ce9178;">"4"</span>);
        ({
            <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">iota50</span> = maj_iota(<span style="color: #4ec9b0;">Maj</span>::integer(50));
            <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">reviota</span> = maj_reverse(iota50);
            <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">v</span> = maj_vector(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, reviota);
            maj_vec_length(v)
        }, <span style="color: #ce9178;">"50"</span>);
    );
    <span style="color: #c586c0;">test_fail!</span>(maj_vec_length(state.make_stream_stdin()));
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org1504e37" class="outline-4">
<h4 id="org1504e37"><span class="section-number-4">6.3.8.</span> <code>vec-at</code></h4>
<div class="outline-text-4" id="text-6-3-8">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #c586c0;">#[test]</span>
<span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">primitives_vec_at</span>() {
    <span style="color: #569cd6;">use</span> <span style="color: #569cd6;">crate</span>::<span style="color: #569cd6;">axioms</span>::<span style="color: #569cd6;">primitives</span>::maj_vec_at;
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">state</span> = <span style="color: #4ec9b0;">MajState</span>::new();
    <span style="color: #c586c0;">multi_test!</span>(
        state;
        (maj_vec_at(<span style="color: #4ec9b0;">Maj</span>::integer(1),
                    <span style="color: #4ec9b0;">Maj</span>::vector_integer(<span style="color: #c586c0;">vec!</span>[1, 2, 3])),
         <span style="color: #ce9178;">"2"</span>);
        (maj_vec_at(<span style="color: #4ec9b0;">Maj</span>::integer(0), <span style="color: #4ec9b0;">Maj</span>::string(<span style="color: #ce9178;">"Hello"</span>)),
         <span style="color: #ce9178;">"#\\H"</span>);
    );
    <span style="color: #c586c0;">multi_fail_test!</span>(
        maj_vec_at(<span style="color: #4ec9b0;">Maj</span>::integer(5), <span style="color: #4ec9b0;">Maj</span>::string(<span style="color: #ce9178;">"Hello"</span>));
        maj_vec_at(<span style="color: #4ec9b0;">Maj</span>::integer(5),
                   <span style="color: #c586c0;">maj_list!</span>(<span style="color: #4ec9b0;">Maj</span>::integer(1),
                             <span style="color: #4ec9b0;">Maj</span>::integer(2),
                             <span style="color: #4ec9b0;">Maj</span>::integer(3)));
    );
}
</pre>
</div>
</div>
</div>
