10-testes.org
*** ~vec-remove~

#+begin_src rust
#[test]
fn primitives_vec_remove() {
    use crate::axioms::primitives::maj_vec_remove;
    let vec = Maj::vector_integer(vec![1, 2, 3, 4, 5]);
    let state = MajState::new();
    multi_test!(
        state;
        (maj_vec_remove(Maj::integer(2), vec.clone()), "3");
        (maj_vec_remove(Maj::integer(2), vec.clone()), "4");
        (vec.clone(), "[1 2 5]");
        (maj_vec_remove(Maj::integer(2), vec.clone()), "5");
    );
    multi_fail_test!(
        maj_vec_remove(Maj::integer(2), vec);
        maj_vec_remove(Maj::integer(0), Maj::integer(2));
    );
}
#+end_src

*** ~vec-insert~

#+begin_src rust
#[test]
fn primitives_vec_insert() {
    use crate::axioms::primitives::maj_vec_insert;
    let mut state = MajState::new();
    let v = Maj::vector_integer(vec![1, 2, 3]);
    
    multi_test!(
        state;
        (v.clone(), "[1 2 3]");
        (maj_vec_insert(
            &mut state, Maj::integer(3), Maj::integer(5), v.clone()),
         "[1 2 3 5]");
        (maj_vec_insert(
            &mut state, Maj::integer(0), Maj::integer(5), v.clone()),
         "[5 1 2 3 5]");
        (maj_vec_insert(
            &mut state, Maj::integer(0), Maj::integer(5), v.clone()),
         "[5 5 1 2 3 5]");
        (maj_vec_insert(
            &mut state, Maj::integer(0), Maj::integer(5), v.clone()),
         "[5 5 5 1 2 3 5]");
        (maj_vec_insert(
            &mut state, Maj::integer(1), Maj::integer(7), v.clone()),
         "[5 7 5 5 1 2 3 5]");
        (maj_vec_insert(
            &mut state, Maj::integer(3), Maj::integer(8), v.clone()),
         "[5 7 5 8 5 1 2 3 5]");
    );

    let a = Maj::symbol(&mut state, "a");
    multi_fail_test!(
        maj_vec_insert(&mut state,
                       Maj::integer(20),
                       Maj::integer(8),
                       Maj::vector_integer(vec![1, 2, 3]));
        maj_vec_insert(&mut state,
                       Maj::integer(2),
                       a,
                       Maj::vector_integer(vec![1, 2, 3]));
    );
}
#+end_src

** Funções numéricas
*** ~number-coerce~

#+begin_src rust
#[test]
fn primitives_number_coerce() {
    use crate::axioms::primitives::maj_number_coerce;
    let mut state = MajState::new();

    let float = Maj::symbol(&mut state, "float");
    let integer = Maj::symbol(&mut state, "integer");

    multi_test!(
        state;
        (maj_number_coerce(
            &mut state, float.clone(), Maj::integer(1)), "1.0");
        (maj_number_coerce(
            &mut state, integer.clone(), Maj::complex(
                Maj::integer(1), Maj::integer(3))), "1");
        (maj_number_coerce(
            &mut state, integer.clone(), Maj::float(2.3)), "2");
        (maj_number_coerce(
            &mut state, float, Maj::fraction(2, 5)), "0.4");
    );
    test_fail!(maj_number_coerce(&mut state, integer, Maj::t()));
}
#+end_src

*** ~real-part~ e ~imag-part~
 
#+begin_src rust
#[test]
fn primitives_real_part_imag_part() {
    use crate::axioms::primitives::{
        maj_real_part,
        maj_imag_part
    };
    let state = MajState::new();
    multi_test!(
        state;
        (maj_real_part(Maj::complex(Maj::integer(2),
                                    Maj::integer(5))), "2");
        (maj_real_part(Maj::complex(Maj::fraction(3, 2),
                                    Maj::integer(7))), "3/2");
        (maj_imag_part(Maj::complex(Maj::integer(2),
                                    Maj::integer(5))), "5");
        (maj_imag_part(Maj::complex(Maj::integer(7),
                                    Maj::fraction(3, 2))), "3/2");
    );
    multi_fail_test!(
        maj_real_part(Maj::fraction(1, 2));
        maj_real_part(Maj::nil());
        maj_imag_part(Maj::fraction(1, 2));
        maj_imag_part(Maj::nil());
    );
}
#+end_src

