doc/html/10-testes.html

<div id="outline-container-orgefc267e" class="outline-4">
<h4 id="orgefc267e"><span class="section-number-4">6.3.9.</span> <code>vec-remove</code></h4>
<div class="outline-text-4" id="text-6-3-9">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #c586c0;">#[test]</span>
<span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">primitives_vec_remove</span>() {
    <span style="color: #569cd6;">use</span> <span style="color: #569cd6;">crate</span>::<span style="color: #569cd6;">axioms</span>::<span style="color: #569cd6;">primitives</span>::maj_vec_remove;
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">vec</span> = <span style="color: #4ec9b0;">Maj</span>::vector_integer(<span style="color: #c586c0;">vec!</span>[1, 2, 3, 4, 5]);
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">state</span> = <span style="color: #4ec9b0;">MajState</span>::new();
    <span style="color: #c586c0;">multi_test!</span>(
        state;
        (maj_vec_remove(<span style="color: #4ec9b0;">Maj</span>::integer(2), vec.clone()), <span style="color: #ce9178;">"3"</span>);
        (maj_vec_remove(<span style="color: #4ec9b0;">Maj</span>::integer(2), vec.clone()), <span style="color: #ce9178;">"4"</span>);
        (vec.clone(), <span style="color: #ce9178;">"[1 2 5]"</span>);
        (maj_vec_remove(<span style="color: #4ec9b0;">Maj</span>::integer(2), vec.clone()), <span style="color: #ce9178;">"5"</span>);
    );
    <span style="color: #c586c0;">multi_fail_test!</span>(
        maj_vec_remove(<span style="color: #4ec9b0;">Maj</span>::integer(2), vec);
        maj_vec_remove(<span style="color: #4ec9b0;">Maj</span>::integer(0), <span style="color: #4ec9b0;">Maj</span>::integer(2));
    );
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org34acf49" class="outline-4">
<h4 id="org34acf49"><span class="section-number-4">6.3.10.</span> <code>vec-insert</code></h4>
<div class="outline-text-4" id="text-6-3-10">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #c586c0;">#[test]</span>
<span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">primitives_vec_insert</span>() {
    <span style="color: #569cd6;">use</span> <span style="color: #569cd6;">crate</span>::<span style="color: #569cd6;">axioms</span>::<span style="color: #569cd6;">primitives</span>::maj_vec_insert;
    <span style="color: #569cd6;">let</span> <span style="color: #569cd6;">mut</span> <span style="color: #9cdcfe;">state</span> = <span style="color: #4ec9b0;">MajState</span>::new();
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">v</span> = <span style="color: #4ec9b0;">Maj</span>::vector_integer(<span style="color: #c586c0;">vec!</span>[1, 2, 3]);
    
    <span style="color: #c586c0;">multi_test!</span>(
        state;
        (v.clone(), <span style="color: #ce9178;">"[1 2 3]"</span>);
        (maj_vec_insert(
            <span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #4ec9b0;">Maj</span>::integer(3), <span style="color: #4ec9b0;">Maj</span>::integer(5), v.clone()),
         <span style="color: #ce9178;">"[1 2 3 5]"</span>);
        (maj_vec_insert(
            <span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #4ec9b0;">Maj</span>::integer(0), <span style="color: #4ec9b0;">Maj</span>::integer(5), v.clone()),
         <span style="color: #ce9178;">"[5 1 2 3 5]"</span>);
        (maj_vec_insert(
            <span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #4ec9b0;">Maj</span>::integer(0), <span style="color: #4ec9b0;">Maj</span>::integer(5), v.clone()),
         <span style="color: #ce9178;">"[5 5 1 2 3 5]"</span>);
        (maj_vec_insert(
            <span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #4ec9b0;">Maj</span>::integer(0), <span style="color: #4ec9b0;">Maj</span>::integer(5), v.clone()),
         <span style="color: #ce9178;">"[5 5 5 1 2 3 5]"</span>);
        (maj_vec_insert(
            <span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #4ec9b0;">Maj</span>::integer(1), <span style="color: #4ec9b0;">Maj</span>::integer(7), v.clone()),
         <span style="color: #ce9178;">"[5 7 5 5 1 2 3 5]"</span>);
        (maj_vec_insert(
            <span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #4ec9b0;">Maj</span>::integer(3), <span style="color: #4ec9b0;">Maj</span>::integer(8), v.clone()),
         <span style="color: #ce9178;">"[5 7 5 8 5 1 2 3 5]"</span>);
    );

    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">a</span> = <span style="color: #4ec9b0;">Maj</span>::symbol(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #ce9178;">"a"</span>);
    <span style="color: #c586c0;">multi_fail_test!</span>(
        maj_vec_insert(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state,
                       <span style="color: #4ec9b0;">Maj</span>::integer(20),
                       <span style="color: #4ec9b0;">Maj</span>::integer(8),
                       <span style="color: #4ec9b0;">Maj</span>::vector_integer(<span style="color: #c586c0;">vec!</span>[1, 2, 3]));
        maj_vec_insert(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state,
                       <span style="color: #4ec9b0;">Maj</span>::integer(2),
                       a,
                       <span style="color: #4ec9b0;">Maj</span>::vector_integer(<span style="color: #c586c0;">vec!</span>[1, 2, 3]));
    );
}
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org2240fd8" class="outline-3">
<h3 id="org2240fd8"><span class="section-number-3">6.4.</span> Funções numéricas</h3>
<div class="outline-text-3" id="text-6-4">
</div>
<div id="outline-container-org8f3490a" class="outline-4">
<h4 id="org8f3490a"><span class="section-number-4">6.4.1.</span> <code>number-coerce</code></h4>
<div class="outline-text-4" id="text-6-4-1">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #c586c0;">#[test]</span>
<span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">primitives_number_coerce</span>() {
    <span style="color: #569cd6;">use</span> <span style="color: #569cd6;">crate</span>::<span style="color: #569cd6;">axioms</span>::<span style="color: #569cd6;">primitives</span>::maj_number_coerce;
    <span style="color: #569cd6;">let</span> <span style="color: #569cd6;">mut</span> <span style="color: #9cdcfe;">state</span> = <span style="color: #4ec9b0;">MajState</span>::new();

    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">float</span> = <span style="color: #4ec9b0;">Maj</span>::symbol(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #ce9178;">"float"</span>);
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">integer</span> = <span style="color: #4ec9b0;">Maj</span>::symbol(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #ce9178;">"integer"</span>);

    <span style="color: #c586c0;">multi_test!</span>(
        state;
        (maj_number_coerce(
            <span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, float.clone(), <span style="color: #4ec9b0;">Maj</span>::integer(1)), <span style="color: #ce9178;">"1.0"</span>);
        (maj_number_coerce(
            <span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, integer.clone(), <span style="color: #4ec9b0;">Maj</span>::complex(
                <span style="color: #4ec9b0;">Maj</span>::integer(1), <span style="color: #4ec9b0;">Maj</span>::integer(3))), <span style="color: #ce9178;">"1"</span>);
        (maj_number_coerce(
            <span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, integer.clone(), <span style="color: #4ec9b0;">Maj</span>::float(2.3)), <span style="color: #ce9178;">"2"</span>);
        (maj_number_coerce(
            <span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, float, <span style="color: #4ec9b0;">Maj</span>::fraction(2, 5)), <span style="color: #ce9178;">"0.4"</span>);
    );
    <span style="color: #c586c0;">test_fail!</span>(maj_number_coerce(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, integer, <span style="color: #4ec9b0;">Maj</span>::t()));
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org9efcf49" class="outline-4">
<h4 id="org9efcf49"><span class="section-number-4">6.4.2.</span> <code>real-part</code> e <code>imag-part</code></h4>
<div class="outline-text-4" id="text-6-4-2">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #c586c0;">#[test]</span>
<span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">primitives_real_part_imag_part</span>() {
    <span style="color: #569cd6;">use</span> <span style="color: #569cd6;">crate</span>::<span style="color: #569cd6;">axioms</span>::<span style="color: #569cd6;">primitives</span>::{
        maj_real_part,
        maj_imag_part
    };
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">state</span> = <span style="color: #4ec9b0;">MajState</span>::new();
    <span style="color: #c586c0;">multi_test!</span>(
        state;
        (maj_real_part(<span style="color: #4ec9b0;">Maj</span>::complex(<span style="color: #4ec9b0;">Maj</span>::integer(2),
                                    <span style="color: #4ec9b0;">Maj</span>::integer(5))), <span style="color: #ce9178;">"2"</span>);
        (maj_real_part(<span style="color: #4ec9b0;">Maj</span>::complex(<span style="color: #4ec9b0;">Maj</span>::fraction(3, 2),
                                    <span style="color: #4ec9b0;">Maj</span>::integer(7))), <span style="color: #ce9178;">"3/2"</span>);
        (maj_imag_part(<span style="color: #4ec9b0;">Maj</span>::complex(<span style="color: #4ec9b0;">Maj</span>::integer(2),
                                    <span style="color: #4ec9b0;">Maj</span>::integer(5))), <span style="color: #ce9178;">"5"</span>);
        (maj_imag_part(<span style="color: #4ec9b0;">Maj</span>::complex(<span style="color: #4ec9b0;">Maj</span>::integer(7),
                                    <span style="color: #4ec9b0;">Maj</span>::fraction(3, 2))), <span style="color: #ce9178;">"3/2"</span>);
    );
    <span style="color: #c586c0;">multi_fail_test!</span>(
        maj_real_part(<span style="color: #4ec9b0;">Maj</span>::fraction(1, 2));
        maj_real_part(<span style="color: #4ec9b0;">Maj</span>::nil());
        maj_imag_part(<span style="color: #4ec9b0;">Maj</span>::fraction(1, 2));
        maj_imag_part(<span style="color: #4ec9b0;">Maj</span>::nil());
    );
}
</pre>
</div>
</div>
</div>
