10-testes.org
*** ~numer~ e ~denom~

#+begin_src rust
#[test]
fn primitives_numer_denom() {
    use crate::axioms::primitives::{
        maj_numer,
        maj_denom
    };
    let state = MajState::new();
    multi_test!(
        state;
        (maj_numer(Maj::fraction(1, 2)), "1");
        (maj_numer(Maj::fraction(3, 2)), "3");
        (maj_denom(Maj::fraction(1, 2)), "2");
        (maj_denom(Maj::fraction(3, 2)), "2");
    );
    multi_fail_test!(
        maj_numer(Maj::integer(2));
        maj_numer(Maj::nil());
        maj_denom(Maj::integer(2));
        maj_denom(Maj::nil());
    );
}
#+end_src

*** ~richest-number-type~

#+begin_src rust
#[test]
fn primitives_richest_number_type() {
    use crate::axioms::primitives::maj_richest_number_type;
    let mut state = MajState::new();
    multi_test!(
        state;
        (maj_richest_number_type(
            &mut state, Maj::integer(2), Maj::float(2.0)),
         "float");
        (maj_richest_number_type(
            &mut state, Maj::integer(2), Maj::fraction(2, 3)),
         "fraction");
        (maj_richest_number_type(
            &mut state, Maj::complex(Maj::integer(2),
                                     Maj::integer(3)),
            Maj::integer(9)),
         "complex");
        (maj_richest_number_type(
            &mut state, Maj::complex(Maj::fraction(2, 3),
                                     Maj::integer(-9)),
            Maj::float(2.0)),
         "complex");
    );
    test_fail!(maj_richest_number_type(
        &mut state, Maj::complex(Maj::fraction(2, 3),
                                 Maj::integer(-9)),
        Maj::t()));
}
#+end_src

*** ~rich-number-coerce~

#+begin_src rust
#[test]
fn primitives_rich_number_coerce() {
    use crate::axioms::primitives::maj_rich_number_coerce;
    let mut state = MajState::new();
    multi_test!(
        state;
        (maj_rich_number_coerce(&mut state,
                                Maj::complex(Maj::integer(2),
                                             Maj::integer(3)),
                                Maj::fraction(2, 5)),
         "(2J3 2/5J0.0)");
        (maj_rich_number_coerce(&mut state,
                                Maj::float(1.5),
                                Maj::fraction(5, 2)),
         "(3/2 5/2)");
    );
    test_fail!(maj_rich_number_coerce(
        &mut state, Maj::integer(2), Maj::t()));
}
#+end_src

*** ~+~ (arithmetic plus)

#+begin_src rust
#[test]
fn primitives_arithm_plus() {
    use crate::axioms::primitives::maj_arithm_plus;
    let mut state = MajState::new();
    multi_test!(
        state;
        (maj_arithm_plus(&mut state, Maj::nil(), Maj::nil()), "1");
        (maj_arithm_plus(
            &mut state, Maj::nil(),
            maj_list!(Maj::complex(Maj::integer(2),
                                   Maj::integer(3)))), "2J-3");
        (maj_arithm_plus(
            &mut state, Maj::nil(),
            maj_list!(Maj::integer(1),
                      Maj::integer(2),
                      Maj::integer(3))),
         "6");
    );
    let a = Maj::symbol(&mut state, "a");
    test_fail!(maj_arithm_plus(
        &mut state, Maj::nil(), maj_list!(a)));
}
#+end_src

