doc/html/10-testes.html

<div id="outline-container-orgca7fd54" class="outline-4">
<h4 id="orgca7fd54"><span class="section-number-4">6.4.3.</span> <code>numer</code> e <code>denom</code></h4>
<div class="outline-text-4" id="text-6-4-3">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #c586c0;">#[test]</span>
<span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">primitives_numer_denom</span>() {
    <span style="color: #569cd6;">use</span> <span style="color: #569cd6;">crate</span>::<span style="color: #569cd6;">axioms</span>::<span style="color: #569cd6;">primitives</span>::{
        maj_numer,
        maj_denom
    };
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">state</span> = <span style="color: #4ec9b0;">MajState</span>::new();
    <span style="color: #c586c0;">multi_test!</span>(
        state;
        (maj_numer(<span style="color: #4ec9b0;">Maj</span>::fraction(1, 2)), <span style="color: #ce9178;">"1"</span>);
        (maj_numer(<span style="color: #4ec9b0;">Maj</span>::fraction(3, 2)), <span style="color: #ce9178;">"3"</span>);
        (maj_denom(<span style="color: #4ec9b0;">Maj</span>::fraction(1, 2)), <span style="color: #ce9178;">"2"</span>);
        (maj_denom(<span style="color: #4ec9b0;">Maj</span>::fraction(3, 2)), <span style="color: #ce9178;">"2"</span>);
    );
    <span style="color: #c586c0;">multi_fail_test!</span>(
        maj_numer(<span style="color: #4ec9b0;">Maj</span>::integer(2));
        maj_numer(<span style="color: #4ec9b0;">Maj</span>::nil());
        maj_denom(<span style="color: #4ec9b0;">Maj</span>::integer(2));
        maj_denom(<span style="color: #4ec9b0;">Maj</span>::nil());
    );
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org7d81e0d" class="outline-4">
<h4 id="org7d81e0d"><span class="section-number-4">6.4.4.</span> <code>richest-number-type</code></h4>
<div class="outline-text-4" id="text-6-4-4">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #c586c0;">#[test]</span>
<span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">primitives_richest_number_type</span>() {
    <span style="color: #569cd6;">use</span> <span style="color: #569cd6;">crate</span>::<span style="color: #569cd6;">axioms</span>::<span style="color: #569cd6;">primitives</span>::maj_richest_number_type;
    <span style="color: #569cd6;">let</span> <span style="color: #569cd6;">mut</span> <span style="color: #9cdcfe;">state</span> = <span style="color: #4ec9b0;">MajState</span>::new();
    <span style="color: #c586c0;">multi_test!</span>(
        state;
        (maj_richest_number_type(
            <span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #4ec9b0;">Maj</span>::integer(2), <span style="color: #4ec9b0;">Maj</span>::float(2.0)),
         <span style="color: #ce9178;">"float"</span>);
        (maj_richest_number_type(
            <span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #4ec9b0;">Maj</span>::integer(2), <span style="color: #4ec9b0;">Maj</span>::fraction(2, 3)),
         <span style="color: #ce9178;">"fraction"</span>);
        (maj_richest_number_type(
            <span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #4ec9b0;">Maj</span>::complex(<span style="color: #4ec9b0;">Maj</span>::integer(2),
                                     <span style="color: #4ec9b0;">Maj</span>::integer(3)),
            <span style="color: #4ec9b0;">Maj</span>::integer(9)),
         <span style="color: #ce9178;">"complex"</span>);
        (maj_richest_number_type(
            <span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #4ec9b0;">Maj</span>::complex(<span style="color: #4ec9b0;">Maj</span>::fraction(2, 3),
                                     <span style="color: #4ec9b0;">Maj</span>::integer(-9)),
            <span style="color: #4ec9b0;">Maj</span>::float(2.0)),
         <span style="color: #ce9178;">"complex"</span>);
    );
    <span style="color: #c586c0;">test_fail!</span>(maj_richest_number_type(
        <span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #4ec9b0;">Maj</span>::complex(<span style="color: #4ec9b0;">Maj</span>::fraction(2, 3),
                                 <span style="color: #4ec9b0;">Maj</span>::integer(-9)),
        <span style="color: #4ec9b0;">Maj</span>::t()));
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orgb7570c7" class="outline-4">
<h4 id="orgb7570c7"><span class="section-number-4">6.4.5.</span> <code>rich-number-coerce</code></h4>
<div class="outline-text-4" id="text-6-4-5">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #c586c0;">#[test]</span>
<span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">primitives_rich_number_coerce</span>() {
    <span style="color: #569cd6;">use</span> <span style="color: #569cd6;">crate</span>::<span style="color: #569cd6;">axioms</span>::<span style="color: #569cd6;">primitives</span>::maj_rich_number_coerce;
    <span style="color: #569cd6;">let</span> <span style="color: #569cd6;">mut</span> <span style="color: #9cdcfe;">state</span> = <span style="color: #4ec9b0;">MajState</span>::new();
    <span style="color: #c586c0;">multi_test!</span>(
        state;
        (maj_rich_number_coerce(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state,
                                <span style="color: #4ec9b0;">Maj</span>::complex(<span style="color: #4ec9b0;">Maj</span>::integer(2),
                                             <span style="color: #4ec9b0;">Maj</span>::integer(3)),
                                <span style="color: #4ec9b0;">Maj</span>::fraction(2, 5)),
         <span style="color: #ce9178;">"(2J3 2/5J0.0)"</span>);
        (maj_rich_number_coerce(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state,
                                <span style="color: #4ec9b0;">Maj</span>::float(1.5),
                                <span style="color: #4ec9b0;">Maj</span>::fraction(5, 2)),
         <span style="color: #ce9178;">"(3/2 5/2)"</span>);
    );
    <span style="color: #c586c0;">test_fail!</span>(maj_rich_number_coerce(
        <span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #4ec9b0;">Maj</span>::integer(2), <span style="color: #4ec9b0;">Maj</span>::t()));
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orgabdb614" class="outline-4">
<h4 id="orgabdb614"><span class="section-number-4">6.4.6.</span> <code>+</code> (arithmetic plus)</h4>
<div class="outline-text-4" id="text-6-4-6">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #c586c0;">#[test]</span>
<span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">primitives_arithm_plus</span>() {
    <span style="color: #569cd6;">use</span> <span style="color: #569cd6;">crate</span>::<span style="color: #569cd6;">axioms</span>::<span style="color: #569cd6;">primitives</span>::maj_arithm_plus;
    <span style="color: #569cd6;">let</span> <span style="color: #569cd6;">mut</span> <span style="color: #9cdcfe;">state</span> = <span style="color: #4ec9b0;">MajState</span>::new();
    <span style="color: #c586c0;">multi_test!</span>(
        state;
        (maj_arithm_plus(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #4ec9b0;">Maj</span>::nil(), <span style="color: #4ec9b0;">Maj</span>::nil()), <span style="color: #ce9178;">"1"</span>);
        (maj_arithm_plus(
            <span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #4ec9b0;">Maj</span>::nil(),
            <span style="color: #c586c0;">maj_list!</span>(<span style="color: #4ec9b0;">Maj</span>::complex(<span style="color: #4ec9b0;">Maj</span>::integer(2),
                                   <span style="color: #4ec9b0;">Maj</span>::integer(3)))), <span style="color: #ce9178;">"2J-3"</span>);
        (maj_arithm_plus(
            <span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #4ec9b0;">Maj</span>::nil(),
            <span style="color: #c586c0;">maj_list!</span>(<span style="color: #4ec9b0;">Maj</span>::integer(1),
                      <span style="color: #4ec9b0;">Maj</span>::integer(2),
                      <span style="color: #4ec9b0;">Maj</span>::integer(3))),
         <span style="color: #ce9178;">"6"</span>);
    );
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">a</span> = <span style="color: #4ec9b0;">Maj</span>::symbol(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #ce9178;">"a"</span>);
    <span style="color: #c586c0;">test_fail!</span>(maj_arithm_plus(
        <span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #4ec9b0;">Maj</span>::nil(), <span style="color: #c586c0;">maj_list!</span>(a)));
}
</pre>
</div>
</div>
</div>
