10-testes.org
*** ~-~ (arithmetic minus)

#+begin_src rust
#[test]
fn primitives_arithm_minus() {
    use crate::axioms::primitives::maj_arithm_minus;
    let mut state = MajState::new();
    multi_test!(
        state;
        (maj_arithm_minus(&mut state, Maj::nil(), Maj::nil()), "0");
        (maj_arithm_minus(
            &mut state, Maj::nil(),
            maj_list!(Maj::integer(1))), "-1");
        (maj_arithm_minus(
            &mut state, Maj::nil(),
            maj_list!(Maj::integer(1),
                      Maj::integer(2),
                      Maj::integer(3))),
         "-4");
    );
    let a = Maj::symbol(&mut state, "a");
    test_fail!(maj_arithm_minus(
        &mut state, Maj::nil(), maj_list!(a)));
}
#+end_src

*** ~*~ (arithmetic times)

#+begin_src rust
#[test]
fn primitives_arithm_times() {
    use crate::axioms::primitives::maj_arithm_times;
    let mut state = MajState::new();
    multi_test!(
        state;
        (maj_arithm_times(&mut state, Maj::nil(), Maj::nil()), "1");
        (maj_arithm_times(
            &mut state, Maj::nil(),
            maj_list!(Maj::integer(-50))), "-1");
        (maj_arithm_times(
            &mut state, Maj::nil(),
            maj_list!(Maj::integer(1),
                      Maj::integer(2),
                      Maj::integer(3))),
         "6");
        (maj_arithm_times(
            &mut state, Maj::nil(),
            maj_list!(Maj::complex(Maj::integer(3),
                                   Maj::integer(2)),
                      Maj::complex(Maj::integer(1),
                                   Maj::integer(7)))),
         "-11J23.0");
    );
    let a = Maj::symbol(&mut state, "a");
    test_fail!(maj_arithm_times(
        &mut state, Maj::nil(), maj_list!(a)));
}
#+end_src

*** ~/~ (arithmetic divide)

#+begin_src rust
#[test]
fn primitives_arithm_divide() {
    use crate::axioms::primitives::maj_arithm_divide;
    let mut state = MajState::new();
    multi_test!(
        state;
        (maj_arithm_divide(&mut state, Maj::nil(), Maj::nil()), "1");
        (maj_arithm_divide(
            &mut state, Maj::nil(),
            maj_list!(Maj::integer(3))), "1/3");
        (maj_arithm_divide(
            &mut state, Maj::nil(),
            maj_list!(Maj::float(0.5))), "2");
        (maj_arithm_divide(
            &mut state, Maj::nil(),
            maj_list!(Maj::fraction(1, 2),
                      Maj::complex(
                          Maj::integer(0),
                          Maj::integer(1)))),
         "0.0J-1/2");
        (maj_arithm_divide(
            &mut state, Maj::nil(),
            maj_list!(Maj::fraction(1, 2))), "2");
        (maj_arithm_divide(
            &mut state, Maj::nil(),
            maj_list!(Maj::integer(3),
                      Maj::integer(4))),
         "3/4");
    );
    let a = Maj::symbol(&mut state, "a");
    multi_fail_test!(
        maj_arithm_divide(
            &mut state, Maj::nil(),
            maj_list!(Maj::integer(2),
                      Maj::integer(3),
                      Maj::integer(0)));
        maj_arithm_divide(
            &mut state, Maj::nil(),
            maj_list!(Maj::integer(0)));
        maj_arithm_divide(
            &mut state, Maj::nil(),
            maj_list!(Maj::integer(2), a));
    );
}
#+end_src

