10-testes.org
*** ~iota~

#+begin_src rust
#[test]
fn primitives_iota() {
    use crate::axioms::primitives::maj_iota;
    let mut state = MajState::new();
    multi_test!(
        state;
        (maj_iota(Maj::integer(0)), "nil");
        (maj_iota(Maj::integer(5)), "(0 1 2 3 4)");
    );
    multi_fail_test!(
        maj_iota(Maj::integer(-1));
        maj_iota(Maj::fraction(2, 3));
        maj_iota(Maj::symbol(&mut state, "a"));
    );
}
#+end_src

** Funções de comparações

*** ~=~ (numeric equality)

#+begin_src rust
#[test]
fn primitives_arithm_equal() {
    use crate::axioms::primitives::maj_arithm_eq;
    use crate::core::environment::maj_env_push;
    
    let mut state = MajState::new();
    let test_env = maj_env_push(Maj::nil(),
                                Maj::symbol(&mut state, "*ulps*"),
                                Maj::integer(3));
    
    multi_boolean_test!(
        (maj_arithm_eq(&mut state, test_env.clone(),
                       Maj::fraction(2, 1), Maj::integer(2),
                       Maj::nil()), true);
        (maj_arithm_eq(&mut state, test_env.clone(),
                       Maj::integer(1), Maj::integer(1),
                       Maj::nil()), true);
        (maj_arithm_eq(&mut state, test_env.clone(),
                       Maj::complex(Maj::integer(2),
                                    Maj::integer(3)),
                       Maj::fraction(2, 3),
                       Maj::nil()), false);
        (maj_arithm_eq(&mut state, test_env.clone(),
                       Maj::float(2.0), Maj::integer(2),
                       Maj::nil()), true);
        (maj_arithm_eq(&mut state, test_env.clone(),
                       Maj::integer(2), Maj::fraction(4, 2),
                       maj_list!(
                           Maj::integer(2),
                           Maj::integer(3),
                           Maj::integer(5))), false);
    );
    test_fail!(maj_arithm_eq(&mut state, test_env,
                             Maj::t(), Maj::fraction(2, 3),
                             Maj::nil()));
}
#+end_src

*** ~float=~ (floating point equality)

#+begin_src rust
#[test]
fn primitives_arithm_float_eq() {
    use crate::axioms::primitives::{
        maj_arithm_floateq,
        maj_arithm_times,
        maj_arithm_plus
    };
    use crate::core::environment::maj_env_push;
    
    let mut state = MajState::new();
    let test_env = maj_env_push(Maj::nil(),
                                Maj::symbol(&mut state, "*ulps*"),
                                Maj::integer(3));

    
    let f = Maj::float(0.1);
    let mut sum = Maj::float(0.0);

    // (repeat 10 (set sum (+ sum f)))
    for _ in 0..10 {
        sum = maj_arithm_plus(&mut state, test_env.clone(),
                              maj_list!(sum.clone(), f.clone()));
    }

    // (def product (* f 10))
    let product =
        maj_arithm_times(&mut state, test_env.clone(),
                         maj_list!(f.clone(), Maj::float(10.0)));
    
    test_boolean!(maj_arithm_floateq(&mut state, test_env.clone(),
                                     sum, product),
                  true);
}
#+end_src

