doc/html/10-testes.html

<div id="outline-container-org69f1d55" class="outline-4">
<h4 id="org69f1d55"><span class="section-number-4">6.4.10.</span> <code>iota</code></h4>
<div class="outline-text-4" id="text-6-4-10">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #c586c0;">#[test]</span>
<span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">primitives_iota</span>() {
    <span style="color: #569cd6;">use</span> <span style="color: #569cd6;">crate</span>::<span style="color: #569cd6;">axioms</span>::<span style="color: #569cd6;">primitives</span>::maj_iota;
    <span style="color: #569cd6;">let</span> <span style="color: #569cd6;">mut</span> <span style="color: #9cdcfe;">state</span> = <span style="color: #4ec9b0;">MajState</span>::new();
    <span style="color: #c586c0;">multi_test!</span>(
        state;
        (maj_iota(<span style="color: #4ec9b0;">Maj</span>::integer(0)), <span style="color: #ce9178;">"nil"</span>);
        (maj_iota(<span style="color: #4ec9b0;">Maj</span>::integer(5)), <span style="color: #ce9178;">"(0 1 2 3 4)"</span>);
    );
    <span style="color: #c586c0;">multi_fail_test!</span>(
        maj_iota(<span style="color: #4ec9b0;">Maj</span>::integer(-1));
        maj_iota(<span style="color: #4ec9b0;">Maj</span>::fraction(2, 3));
        maj_iota(<span style="color: #4ec9b0;">Maj</span>::symbol(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #ce9178;">"a"</span>));
    );
}
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org3637e7a" class="outline-3">
<h3 id="org3637e7a"><span class="section-number-3">6.5.</span> Funções de comparações</h3>
<div class="outline-text-3" id="text-6-5">
</div>
<div id="outline-container-orga4935b1" class="outline-4">
<h4 id="orga4935b1"><span class="section-number-4">6.5.1.</span> <code>=</code> (numeric equality)</h4>
<div class="outline-text-4" id="text-6-5-1">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #c586c0;">#[test]</span>
<span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">primitives_arithm_equal</span>() {
    <span style="color: #569cd6;">use</span> <span style="color: #569cd6;">crate</span>::<span style="color: #569cd6;">axioms</span>::<span style="color: #569cd6;">primitives</span>::maj_arithm_eq;
    <span style="color: #569cd6;">use</span> <span style="color: #569cd6;">crate</span>::<span style="color: #569cd6;">core</span>::<span style="color: #569cd6;">environment</span>::maj_env_push;
    
    <span style="color: #569cd6;">let</span> <span style="color: #569cd6;">mut</span> <span style="color: #9cdcfe;">state</span> = <span style="color: #4ec9b0;">MajState</span>::new();
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">test_env</span> = maj_env_push(<span style="color: #4ec9b0;">Maj</span>::nil(),
                                <span style="color: #4ec9b0;">Maj</span>::symbol(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #ce9178;">"*ulps*"</span>),
                                <span style="color: #4ec9b0;">Maj</span>::integer(3));
    
    <span style="color: #c586c0;">multi_boolean_test!</span>(
        (maj_arithm_eq(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, test_env.clone(),
                       <span style="color: #4ec9b0;">Maj</span>::fraction(2, 1), <span style="color: #4ec9b0;">Maj</span>::integer(2),
                       <span style="color: #4ec9b0;">Maj</span>::nil()), <span style="color: #569cd6;">true</span>);
        (maj_arithm_eq(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, test_env.clone(),
                       <span style="color: #4ec9b0;">Maj</span>::integer(1), <span style="color: #4ec9b0;">Maj</span>::integer(1),
                       <span style="color: #4ec9b0;">Maj</span>::nil()), <span style="color: #569cd6;">true</span>);
        (maj_arithm_eq(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, test_env.clone(),
                       <span style="color: #4ec9b0;">Maj</span>::complex(<span style="color: #4ec9b0;">Maj</span>::integer(2),
                                    <span style="color: #4ec9b0;">Maj</span>::integer(3)),
                       <span style="color: #4ec9b0;">Maj</span>::fraction(2, 3),
                       <span style="color: #4ec9b0;">Maj</span>::nil()), <span style="color: #569cd6;">false</span>);
        (maj_arithm_eq(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, test_env.clone(),
                       <span style="color: #4ec9b0;">Maj</span>::float(2.0), <span style="color: #4ec9b0;">Maj</span>::integer(2),
                       <span style="color: #4ec9b0;">Maj</span>::nil()), <span style="color: #569cd6;">true</span>);
        (maj_arithm_eq(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, test_env.clone(),
                       <span style="color: #4ec9b0;">Maj</span>::integer(2), <span style="color: #4ec9b0;">Maj</span>::fraction(4, 2),
                       <span style="color: #c586c0;">maj_list!</span>(
                           <span style="color: #4ec9b0;">Maj</span>::integer(2),
                           <span style="color: #4ec9b0;">Maj</span>::integer(3),
                           <span style="color: #4ec9b0;">Maj</span>::integer(5))), <span style="color: #569cd6;">false</span>);
    );
    <span style="color: #c586c0;">test_fail!</span>(maj_arithm_eq(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, test_env,
                             <span style="color: #4ec9b0;">Maj</span>::t(), <span style="color: #4ec9b0;">Maj</span>::fraction(2, 3),
                             <span style="color: #4ec9b0;">Maj</span>::nil()));
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org1025b82" class="outline-4">
<h4 id="org1025b82"><span class="section-number-4">6.5.2.</span> <code>float=</code> (floating point equality)</h4>
<div class="outline-text-4" id="text-6-5-2">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #c586c0;">#[test]</span>
<span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">primitives_arithm_float_eq</span>() {
    <span style="color: #569cd6;">use</span> <span style="color: #569cd6;">crate</span>::<span style="color: #569cd6;">axioms</span>::<span style="color: #569cd6;">primitives</span>::{
        maj_arithm_floateq,
        maj_arithm_times,
        maj_arithm_plus
    };
    <span style="color: #569cd6;">use</span> <span style="color: #569cd6;">crate</span>::<span style="color: #569cd6;">core</span>::<span style="color: #569cd6;">environment</span>::maj_env_push;
    
    <span style="color: #569cd6;">let</span> <span style="color: #569cd6;">mut</span> <span style="color: #9cdcfe;">state</span> = <span style="color: #4ec9b0;">MajState</span>::new();
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">test_env</span> = maj_env_push(<span style="color: #4ec9b0;">Maj</span>::nil(),
                                <span style="color: #4ec9b0;">Maj</span>::symbol(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #ce9178;">"*ulps*"</span>),
                                <span style="color: #4ec9b0;">Maj</span>::integer(3));

    
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">f</span> = <span style="color: #4ec9b0;">Maj</span>::float(0.1);
    <span style="color: #569cd6;">let</span> <span style="color: #569cd6;">mut</span> <span style="color: #9cdcfe;">sum</span> = <span style="color: #4ec9b0;">Maj</span>::float(0.0);

    <span style="color: #6a9955;">// </span><span style="color: #6a9955;">(repeat 10 (set sum (+ sum f)))</span>
    <span style="color: #569cd6;">for</span> <span style="color: #9cdcfe;">_</span> <span style="color: #569cd6;">in</span> 0..10 {
        sum = maj_arithm_plus(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, test_env.clone(),
                              <span style="color: #c586c0;">maj_list!</span>(sum.clone(), f.clone()));
    }

    <span style="color: #6a9955;">// </span><span style="color: #6a9955;">(def product (* f 10))</span>
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">product</span> =
        maj_arithm_times(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, test_env.clone(),
                         <span style="color: #c586c0;">maj_list!</span>(f.clone(), <span style="color: #4ec9b0;">Maj</span>::float(10.0)));
    
    <span style="color: #c586c0;">test_boolean!</span>(maj_arithm_floateq(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, test_env.clone(),
                                     sum, product),
                  <span style="color: #569cd6;">true</span>);
}
</pre>
</div>
</div>
</div>
