10-testes.org
*** ~>~ (greater than)

#+begin_src rust
#[test]
fn primitives_arithm_greater() {
    use crate::axioms::primitives::maj_arithm_greater;
    let mut state = MajState::new();

    let one = Maj::integer(1);
    
    multi_boolean_test!(
        (maj_arithm_greater(&mut state,
                            Maj::fraction(5, 2), Maj::integer(2),
                            Maj::nil()), true);
        (maj_arithm_greater(&mut state,
                            Maj::integer(1), one, Maj::nil()),
         false);
        (maj_arithm_greater(&mut state,
                            Maj::integer(10), Maj::integer(5),
                            maj_list!(Maj::integer(3), Maj::integer(1))),
         true);
        (maj_arithm_greater(&mut state,
                            Maj::integer(1), Maj::integer(2),
                            maj_list!(Maj::integer(3))), false);
    );

    multi_fail_test!(
        maj_arithm_greater(&mut state, Maj::complex(Maj::integer(2),
                                                    Maj::integer(3)),
                           Maj::fraction(2, 3), Maj::nil());
        maj_arithm_greater(&mut state, Maj::integer(3), Maj::t(),
                           Maj::nil());
    );
}
#+end_src

*** ~<~ (lesser than)

#+begin_src rust
#[test]
fn primitives_arithm_lesser() {
    use crate::axioms::primitives::maj_arithm_lesser;
    let mut state = MajState::new();

    let one = Maj::integer(1);
    
    multi_boolean_test!(
        (maj_arithm_lesser(&mut state,
                           Maj::integer(2), Maj::fraction(5, 2),
                           Maj::nil()), true);
        (maj_arithm_lesser(&mut state,
                            Maj::integer(1), one, Maj::nil()),
         false);
        (maj_arithm_lesser(&mut state,
                           Maj::integer(1), Maj::integer(3),
                           maj_list!(Maj::integer(5),
                                     Maj::integer(10))),
         true);
        (maj_arithm_lesser(&mut state,
                           Maj::integer(3), Maj::integer(2),
                           maj_list!(Maj::integer(1))), false);
    );

    multi_fail_test!(
        maj_arithm_lesser(&mut state, Maj::complex(Maj::integer(2),
                                                   Maj::integer(3)),
                          Maj::fraction(2, 3), Maj::nil());
        maj_arithm_lesser(&mut state, Maj::integer(3), Maj::t(),
                          Maj::nil());
    );
}
#+end_src

*** ~>=~ (greater or equal)

#+begin_src rust
#[test]
fn primitives_arithm_geq() {
    use crate::axioms::primitives::maj_arithm_geq;
    use crate::core::environment::maj_env_push;
    let mut state = MajState::new();
    let env = maj_env_push(Maj::nil(),
                           Maj::symbol(&mut state, "*ulps*"),
                           Maj::integer(3));
    
    multi_boolean_test!(
        (maj_arithm_geq(&mut state, env.clone(),
                        Maj::fraction(5, 2), Maj::integer(2),
                        Maj::nil()), true);
        (maj_arithm_geq(&mut state, env.clone(),
                        Maj::float(2.0), Maj::integer(2),
                        Maj::nil()), true);
        (maj_arithm_geq(&mut state, env.clone(),
                        Maj::integer(1), Maj::integer(2),
                        maj_list!(Maj::integer(3))), false);
        (maj_arithm_geq(&mut state, env.clone(),
                        Maj::integer(3), Maj::integer(3),
                        maj_list!(Maj::integer(1))), true);
    );
    multi_fail_test!(
        maj_arithm_geq(&mut state, env.clone(),
                       Maj::complex(Maj::integer(5),
                                    Maj::integer(9)),
                       Maj::complex(Maj::integer(6),
                                    Maj::integer(9)),
                       Maj::nil());
        maj_arithm_geq(&mut state, env,
                       Maj::integer(3), Maj::t(), Maj::nil());
    );
}
#+end_src

