doc/html/10-testes.html

<div id="outline-container-orgefd1226" class="outline-4">
<h4 id="orgefd1226"><span class="section-number-4">6.5.3.</span> <code>&gt;</code> (greater than)</h4>
<div class="outline-text-4" id="text-6-5-3">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #c586c0;">#[test]</span>
<span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">primitives_arithm_greater</span>() {
    <span style="color: #569cd6;">use</span> <span style="color: #569cd6;">crate</span>::<span style="color: #569cd6;">axioms</span>::<span style="color: #569cd6;">primitives</span>::maj_arithm_greater;
    <span style="color: #569cd6;">let</span> <span style="color: #569cd6;">mut</span> <span style="color: #9cdcfe;">state</span> = <span style="color: #4ec9b0;">MajState</span>::new();

    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">one</span> = <span style="color: #4ec9b0;">Maj</span>::integer(1);
    
    <span style="color: #c586c0;">multi_boolean_test!</span>(
        (maj_arithm_greater(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state,
                            <span style="color: #4ec9b0;">Maj</span>::fraction(5, 2), <span style="color: #4ec9b0;">Maj</span>::integer(2),
                            <span style="color: #4ec9b0;">Maj</span>::nil()), <span style="color: #569cd6;">true</span>);
        (maj_arithm_greater(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state,
                            <span style="color: #4ec9b0;">Maj</span>::integer(1), one, <span style="color: #4ec9b0;">Maj</span>::nil()),
         <span style="color: #569cd6;">false</span>);
        (maj_arithm_greater(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state,
                            <span style="color: #4ec9b0;">Maj</span>::integer(10), <span style="color: #4ec9b0;">Maj</span>::integer(5),
                            <span style="color: #c586c0;">maj_list!</span>(<span style="color: #4ec9b0;">Maj</span>::integer(3), <span style="color: #4ec9b0;">Maj</span>::integer(1))),
         <span style="color: #569cd6;">true</span>);
        (maj_arithm_greater(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state,
                            <span style="color: #4ec9b0;">Maj</span>::integer(1), <span style="color: #4ec9b0;">Maj</span>::integer(2),
                            <span style="color: #c586c0;">maj_list!</span>(<span style="color: #4ec9b0;">Maj</span>::integer(3))), <span style="color: #569cd6;">false</span>);
    );

    <span style="color: #c586c0;">multi_fail_test!</span>(
        maj_arithm_greater(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #4ec9b0;">Maj</span>::complex(<span style="color: #4ec9b0;">Maj</span>::integer(2),
                                                    <span style="color: #4ec9b0;">Maj</span>::integer(3)),
                           <span style="color: #4ec9b0;">Maj</span>::fraction(2, 3), <span style="color: #4ec9b0;">Maj</span>::nil());
        maj_arithm_greater(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #4ec9b0;">Maj</span>::integer(3), <span style="color: #4ec9b0;">Maj</span>::t(),
                           <span style="color: #4ec9b0;">Maj</span>::nil());
    );
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org8607c3b" class="outline-4">
<h4 id="org8607c3b"><span class="section-number-4">6.5.4.</span> <code>&lt;</code> (lesser than)</h4>
<div class="outline-text-4" id="text-6-5-4">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #c586c0;">#[test]</span>
<span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">primitives_arithm_lesser</span>() {
    <span style="color: #569cd6;">use</span> <span style="color: #569cd6;">crate</span>::<span style="color: #569cd6;">axioms</span>::<span style="color: #569cd6;">primitives</span>::maj_arithm_lesser;
    <span style="color: #569cd6;">let</span> <span style="color: #569cd6;">mut</span> <span style="color: #9cdcfe;">state</span> = <span style="color: #4ec9b0;">MajState</span>::new();

    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">one</span> = <span style="color: #4ec9b0;">Maj</span>::integer(1);
    
    <span style="color: #c586c0;">multi_boolean_test!</span>(
        (maj_arithm_lesser(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state,
                           <span style="color: #4ec9b0;">Maj</span>::integer(2), <span style="color: #4ec9b0;">Maj</span>::fraction(5, 2),
                           <span style="color: #4ec9b0;">Maj</span>::nil()), <span style="color: #569cd6;">true</span>);
        (maj_arithm_lesser(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state,
                            <span style="color: #4ec9b0;">Maj</span>::integer(1), one, <span style="color: #4ec9b0;">Maj</span>::nil()),
         <span style="color: #569cd6;">false</span>);
        (maj_arithm_lesser(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state,
                           <span style="color: #4ec9b0;">Maj</span>::integer(1), <span style="color: #4ec9b0;">Maj</span>::integer(3),
                           <span style="color: #c586c0;">maj_list!</span>(<span style="color: #4ec9b0;">Maj</span>::integer(5),
                                     <span style="color: #4ec9b0;">Maj</span>::integer(10))),
         <span style="color: #569cd6;">true</span>);
        (maj_arithm_lesser(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state,
                           <span style="color: #4ec9b0;">Maj</span>::integer(3), <span style="color: #4ec9b0;">Maj</span>::integer(2),
                           <span style="color: #c586c0;">maj_list!</span>(<span style="color: #4ec9b0;">Maj</span>::integer(1))), <span style="color: #569cd6;">false</span>);
    );

    <span style="color: #c586c0;">multi_fail_test!</span>(
        maj_arithm_lesser(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #4ec9b0;">Maj</span>::complex(<span style="color: #4ec9b0;">Maj</span>::integer(2),
                                                   <span style="color: #4ec9b0;">Maj</span>::integer(3)),
                          <span style="color: #4ec9b0;">Maj</span>::fraction(2, 3), <span style="color: #4ec9b0;">Maj</span>::nil());
        maj_arithm_lesser(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #4ec9b0;">Maj</span>::integer(3), <span style="color: #4ec9b0;">Maj</span>::t(),
                          <span style="color: #4ec9b0;">Maj</span>::nil());
    );
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org61d3cd9" class="outline-4">
<h4 id="org61d3cd9"><span class="section-number-4">6.5.5.</span> <code>&gt;=</code> (greater or equal)</h4>
<div class="outline-text-4" id="text-6-5-5">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #c586c0;">#[test]</span>
<span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">primitives_arithm_geq</span>() {
    <span style="color: #569cd6;">use</span> <span style="color: #569cd6;">crate</span>::<span style="color: #569cd6;">axioms</span>::<span style="color: #569cd6;">primitives</span>::maj_arithm_geq;
    <span style="color: #569cd6;">use</span> <span style="color: #569cd6;">crate</span>::<span style="color: #569cd6;">core</span>::<span style="color: #569cd6;">environment</span>::maj_env_push;
    <span style="color: #569cd6;">let</span> <span style="color: #569cd6;">mut</span> <span style="color: #9cdcfe;">state</span> = <span style="color: #4ec9b0;">MajState</span>::new();
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">env</span> = maj_env_push(<span style="color: #4ec9b0;">Maj</span>::nil(),
                           <span style="color: #4ec9b0;">Maj</span>::symbol(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #ce9178;">"*ulps*"</span>),
                           <span style="color: #4ec9b0;">Maj</span>::integer(3));
    
    <span style="color: #c586c0;">multi_boolean_test!</span>(
        (maj_arithm_geq(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, env.clone(),
                        <span style="color: #4ec9b0;">Maj</span>::fraction(5, 2), <span style="color: #4ec9b0;">Maj</span>::integer(2),
                        <span style="color: #4ec9b0;">Maj</span>::nil()), <span style="color: #569cd6;">true</span>);
        (maj_arithm_geq(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, env.clone(),
                        <span style="color: #4ec9b0;">Maj</span>::float(2.0), <span style="color: #4ec9b0;">Maj</span>::integer(2),
                        <span style="color: #4ec9b0;">Maj</span>::nil()), <span style="color: #569cd6;">true</span>);
        (maj_arithm_geq(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, env.clone(),
                        <span style="color: #4ec9b0;">Maj</span>::integer(1), <span style="color: #4ec9b0;">Maj</span>::integer(2),
                        <span style="color: #c586c0;">maj_list!</span>(<span style="color: #4ec9b0;">Maj</span>::integer(3))), <span style="color: #569cd6;">false</span>);
        (maj_arithm_geq(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, env.clone(),
                        <span style="color: #4ec9b0;">Maj</span>::integer(3), <span style="color: #4ec9b0;">Maj</span>::integer(3),
                        <span style="color: #c586c0;">maj_list!</span>(<span style="color: #4ec9b0;">Maj</span>::integer(1))), <span style="color: #569cd6;">true</span>);
    );
    <span style="color: #c586c0;">multi_fail_test!</span>(
        maj_arithm_geq(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, env.clone(),
                       <span style="color: #4ec9b0;">Maj</span>::complex(<span style="color: #4ec9b0;">Maj</span>::integer(5),
                                    <span style="color: #4ec9b0;">Maj</span>::integer(9)),
                       <span style="color: #4ec9b0;">Maj</span>::complex(<span style="color: #4ec9b0;">Maj</span>::integer(6),
                                    <span style="color: #4ec9b0;">Maj</span>::integer(9)),
                       <span style="color: #4ec9b0;">Maj</span>::nil());
        maj_arithm_geq(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, env,
                       <span style="color: #4ec9b0;">Maj</span>::integer(3), <span style="color: #4ec9b0;">Maj</span>::t(), <span style="color: #4ec9b0;">Maj</span>::nil());
    );
}
</pre>
</div>
</div>
</div>
