10-testes.org
*** ~<=~ (lesser or equal)

#+begin_src rust
#[test]
fn primitives_arithm_leq() {
    use crate::axioms::primitives::maj_arithm_leq;
    use crate::core::environment::maj_env_push;
    let mut state = MajState::new();
    let env = maj_env_push(Maj::nil(),
                           Maj::symbol(&mut state, "*ulps*"),
                           Maj::integer(3));
    
    multi_boolean_test!(
        (maj_arithm_leq(&mut state, env.clone(),
                        Maj::fraction(5, 2), Maj::integer(2),
                        Maj::nil()), false);
        (maj_arithm_leq(&mut state, env.clone(),
                        Maj::float(2.0), Maj::integer(2),
                        Maj::nil()), true);
        (maj_arithm_leq(&mut state, env.clone(),
                        Maj::integer(1), Maj::integer(2),
                        maj_list!(Maj::integer(3))), true);
        (maj_arithm_leq(&mut state, env.clone(),
                        Maj::integer(3), Maj::integer(3),
                        maj_list!(Maj::integer(1))), false);
    );
    multi_fail_test!(
        maj_arithm_leq(&mut state, env.clone(),
                       Maj::complex(Maj::integer(5),
                                    Maj::integer(9)),
                       Maj::complex(Maj::integer(6),
                                    Maj::integer(9)),
                       Maj::nil());
        maj_arithm_leq(&mut state, env,
                       Maj::integer(3), Maj::t(), Maj::nil());
    );
}
#+end_src

** Funções de streams

*** ~open-stream~ e ~close-stream~

#+begin_src rust
#[test]
fn primitives_open_stream_close_stream() {
    use crate::axioms::primitives::{
        maj_open_stream,
        maj_close_stream
    };
    let mut state = MajState::new();
    let out_sym = Maj::symbol(&mut state, "out");
    let outstream;
    
    multi_regex_test!(
        state;
        ({
            outstream =
                maj_open_stream(&mut state, out_sym.clone(),
                                Maj::string("test-streams-out.txt"));
            outstream.clone()
        }, RE_OUT_STREAM);
    );
    multi_boolean_test!(
        (maj_close_stream(&mut state, outstream.clone()), true);
        (maj_close_stream(&mut state, outstream.clone()), false);
    );
    multi_fail_test!(
        maj_open_stream(&mut state, out_sym.clone(), Maj::string("/"));
        maj_close_stream(&mut state, out_sym.clone());
    );
}
#+end_src

*** ~stat~

#+begin_src rust
#[test]
fn primitives_stat() {
    use crate::axioms::primitives::{
        maj_stat,
        maj_open_stream,
        maj_close_stream
    };
    let mut state = MajState::new();
    let outsym = Maj::symbol(&mut state, "out");
    let outstream =
        maj_open_stream(&mut state, outsym,
                        Maj::string("test-streams-out.txt"));

    if maj_errorp(outstream.clone()).to_bool() {
        panic!("Cannot open output stream");
    }
    
    multi_test!(
        state;
        (maj_stat(&mut state, outstream.clone()), "open");
        ({
            maj_close_stream(&mut state, outstream.clone());
            maj_stat(&mut state, outstream)
        }, "closed");
    );
    test_fail!(maj_stat(&mut state, Maj::integer(3)));
}
#+end_src

