doc/html/10-testes.html

<div id="outline-container-org1870ac8" class="outline-4">
<h4 id="org1870ac8"><span class="section-number-4">6.5.6.</span> <code>&lt;=</code> (lesser or equal)</h4>
<div class="outline-text-4" id="text-6-5-6">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #c586c0;">#[test]</span>
<span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">primitives_arithm_leq</span>() {
    <span style="color: #569cd6;">use</span> <span style="color: #569cd6;">crate</span>::<span style="color: #569cd6;">axioms</span>::<span style="color: #569cd6;">primitives</span>::maj_arithm_leq;
    <span style="color: #569cd6;">use</span> <span style="color: #569cd6;">crate</span>::<span style="color: #569cd6;">core</span>::<span style="color: #569cd6;">environment</span>::maj_env_push;
    <span style="color: #569cd6;">let</span> <span style="color: #569cd6;">mut</span> <span style="color: #9cdcfe;">state</span> = <span style="color: #4ec9b0;">MajState</span>::new();
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">env</span> = maj_env_push(<span style="color: #4ec9b0;">Maj</span>::nil(),
                           <span style="color: #4ec9b0;">Maj</span>::symbol(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #ce9178;">"*ulps*"</span>),
                           <span style="color: #4ec9b0;">Maj</span>::integer(3));
    
    <span style="color: #c586c0;">multi_boolean_test!</span>(
        (maj_arithm_leq(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, env.clone(),
                        <span style="color: #4ec9b0;">Maj</span>::fraction(5, 2), <span style="color: #4ec9b0;">Maj</span>::integer(2),
                        <span style="color: #4ec9b0;">Maj</span>::nil()), <span style="color: #569cd6;">false</span>);
        (maj_arithm_leq(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, env.clone(),
                        <span style="color: #4ec9b0;">Maj</span>::float(2.0), <span style="color: #4ec9b0;">Maj</span>::integer(2),
                        <span style="color: #4ec9b0;">Maj</span>::nil()), <span style="color: #569cd6;">true</span>);
        (maj_arithm_leq(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, env.clone(),
                        <span style="color: #4ec9b0;">Maj</span>::integer(1), <span style="color: #4ec9b0;">Maj</span>::integer(2),
                        <span style="color: #c586c0;">maj_list!</span>(<span style="color: #4ec9b0;">Maj</span>::integer(3))), <span style="color: #569cd6;">true</span>);
        (maj_arithm_leq(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, env.clone(),
                        <span style="color: #4ec9b0;">Maj</span>::integer(3), <span style="color: #4ec9b0;">Maj</span>::integer(3),
                        <span style="color: #c586c0;">maj_list!</span>(<span style="color: #4ec9b0;">Maj</span>::integer(1))), <span style="color: #569cd6;">false</span>);
    );
    <span style="color: #c586c0;">multi_fail_test!</span>(
        maj_arithm_leq(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, env.clone(),
                       <span style="color: #4ec9b0;">Maj</span>::complex(<span style="color: #4ec9b0;">Maj</span>::integer(5),
                                    <span style="color: #4ec9b0;">Maj</span>::integer(9)),
                       <span style="color: #4ec9b0;">Maj</span>::complex(<span style="color: #4ec9b0;">Maj</span>::integer(6),
                                    <span style="color: #4ec9b0;">Maj</span>::integer(9)),
                       <span style="color: #4ec9b0;">Maj</span>::nil());
        maj_arithm_leq(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, env,
                       <span style="color: #4ec9b0;">Maj</span>::integer(3), <span style="color: #4ec9b0;">Maj</span>::t(), <span style="color: #4ec9b0;">Maj</span>::nil());
    );
}
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org55e779e" class="outline-3">
<h3 id="org55e779e"><span class="section-number-3">6.6.</span> Funções de streams</h3>
<div class="outline-text-3" id="text-6-6">
</div>
<div id="outline-container-orgdc772ea" class="outline-4">
<h4 id="orgdc772ea"><span class="section-number-4">6.6.1.</span> <code>open-stream</code> e <code>close-stream</code></h4>
<div class="outline-text-4" id="text-6-6-1">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #c586c0;">#[test]</span>
<span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">primitives_open_stream_close_stream</span>() {
    <span style="color: #569cd6;">use</span> <span style="color: #569cd6;">crate</span>::<span style="color: #569cd6;">axioms</span>::<span style="color: #569cd6;">primitives</span>::{
        maj_open_stream,
        maj_close_stream
    };
    <span style="color: #569cd6;">let</span> <span style="color: #569cd6;">mut</span> <span style="color: #9cdcfe;">state</span> = <span style="color: #4ec9b0;">MajState</span>::new();
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">out_sym</span> = <span style="color: #4ec9b0;">Maj</span>::symbol(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #ce9178;">"out"</span>);
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">outstream</span>;
    
    <span style="color: #c586c0;">multi_regex_test!</span>(
        state;
        ({
            outstream =
                maj_open_stream(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, out_sym.clone(),
                                <span style="color: #4ec9b0;">Maj</span>::string(<span style="color: #ce9178;">"test-streams-out.txt"</span>));
            outstream.clone()
        }, <span style="color: #4ec9b0;">RE_OUT_STREAM</span>);
    );
    <span style="color: #c586c0;">multi_boolean_test!</span>(
        (maj_close_stream(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, outstream.clone()), <span style="color: #569cd6;">true</span>);
        (maj_close_stream(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, outstream.clone()), <span style="color: #569cd6;">false</span>);
    );
    <span style="color: #c586c0;">multi_fail_test!</span>(
        maj_open_stream(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, out_sym.clone(), <span style="color: #4ec9b0;">Maj</span>::string(<span style="color: #ce9178;">"/"</span>));
        maj_close_stream(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, out_sym.clone());
    );
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org1d5eac8" class="outline-4">
<h4 id="org1d5eac8"><span class="section-number-4">6.6.2.</span> <code>stat</code></h4>
<div class="outline-text-4" id="text-6-6-2">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #c586c0;">#[test]</span>
<span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">primitives_stat</span>() {
    <span style="color: #569cd6;">use</span> <span style="color: #569cd6;">crate</span>::<span style="color: #569cd6;">axioms</span>::<span style="color: #569cd6;">primitives</span>::{
        maj_stat,
        maj_open_stream,
        maj_close_stream
    };
    <span style="color: #569cd6;">let</span> <span style="color: #569cd6;">mut</span> <span style="color: #9cdcfe;">state</span> = <span style="color: #4ec9b0;">MajState</span>::new();
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">outsym</span> = <span style="color: #4ec9b0;">Maj</span>::symbol(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #ce9178;">"out"</span>);
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">outstream</span> =
        maj_open_stream(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, outsym,
                        <span style="color: #4ec9b0;">Maj</span>::string(<span style="color: #ce9178;">"test-streams-out.txt"</span>));

    <span style="color: #569cd6;">if</span> maj_errorp(outstream.clone()).to_bool() {
        <span style="color: #c586c0;">panic!</span>(<span style="color: #ce9178;">"Cannot open output stream"</span>);
    }
    
    <span style="color: #c586c0;">multi_test!</span>(
        state;
        (maj_stat(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, outstream.clone()), <span style="color: #ce9178;">"open"</span>);
        ({
            maj_close_stream(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, outstream.clone());
            maj_stat(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, outstream)
        }, <span style="color: #ce9178;">"closed"</span>);
    );
    <span style="color: #c586c0;">test_fail!</span>(maj_stat(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #4ec9b0;">Maj</span>::integer(3)));
}
</pre>
</div>
</div>
</div>
