10-testes.org
*** ~write~

#+begin_src rust
#[test]
fn primitives_write() {
    use crate::axioms::primitives::maj_write;
    let mut state = MajState::new();
    let outstream = state.make_stream_stdout();
    let instream  = state.make_stream_stdin();
    let x = Maj::symbol(&mut state, "x");
    let closure =
        // (lit closure nil (x) ((* x x)))
        maj_list!(Maj::lit(), Maj::closure(), Maj::nil(),
                  maj_list!(x.clone()),
                  maj_list!(
                      maj_list!(Maj::symbol(&mut state, "*"),
                                x.clone(), x)));
    test_boolean!(maj_write(&mut state, closure.clone(), outstream),
                  false);
    multi_fail_test!(
        maj_write(&mut state, closure.clone(), instream);
        maj_write(&mut state, closure.clone(), Maj::integer(5));
    );
}
#+end_src

*** TODO ~read~

#+begin_src rust
#[test]
#[ignore]
fn primitives_read() {
    unimplemented!();
}
#+end_src

*** ~read-char~ e ~peek-char~

#+begin_src rust
#[test]
fn primitives_read_char_peek_char() {
    use crate::core::types::MajStreamDirection;
    use crate::axioms::primitives::{
        maj_peek_char,
        maj_read_char,
        maj_close_stream
    };
    use crate::axioms::predicates::maj_eq;
    let mut state = MajState::new();
    let eof = Maj::symbol(&mut state, "eof");
    let istream = Maj::stream(
        &mut state,
        "test-streams-in.txt",
        MajStreamDirection::In).unwrap();
    let stdout = state.make_stream_stdout();

    multi_test!(
        state;
        (maj_peek_char(&mut state, istream.clone()), "#\\H");
        (maj_peek_char(&mut state, istream.clone()), "#\\H");
        (maj_read_char(&mut state, istream.clone()), "#\\H");
        (maj_read_char(&mut state, istream.clone()), "#\\e");
        ({
            while !maj_eq(maj_read_char(&mut state, istream.clone()),
                          eof.clone()).to_bool() {}
            maj_peek_char(&mut state, istream.clone())
        }, "eof");
        (maj_read_char(&mut state, istream.clone()), "eof");
    );

    test_boolean!(maj_close_stream(&mut state, istream.clone()),
                  true);
    
    multi_fail_test!(
        maj_read_char(&mut state, stdout.clone());
        maj_peek_char(&mut state, stdout);
        maj_read_char(&mut state, istream.clone());
        maj_peek_char(&mut state, istream.clone());
        maj_read_char(&mut state, Maj::fraction(2, 3));
        maj_peek_char(&mut state, Maj::fraction(2, 3));
    );
}
#+end_src

