doc/html/10-testes.html

<div id="outline-container-org4617032" class="outline-4">
<h4 id="org4617032"><span class="section-number-4">6.6.3.</span> <code>write</code></h4>
<div class="outline-text-4" id="text-6-6-3">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #c586c0;">#[test]</span>
<span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">primitives_write</span>() {
    <span style="color: #569cd6;">use</span> <span style="color: #569cd6;">crate</span>::<span style="color: #569cd6;">axioms</span>::<span style="color: #569cd6;">primitives</span>::maj_write;
    <span style="color: #569cd6;">let</span> <span style="color: #569cd6;">mut</span> <span style="color: #9cdcfe;">state</span> = <span style="color: #4ec9b0;">MajState</span>::new();
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">outstream</span> = state.make_stream_stdout();
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">instream</span>  = state.make_stream_stdin();
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">x</span> = <span style="color: #4ec9b0;">Maj</span>::symbol(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #ce9178;">"x"</span>);
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">closure</span> =
        <span style="color: #6a9955;">// </span><span style="color: #6a9955;">(lit closure nil (x) ((* x x)))</span>
        <span style="color: #c586c0;">maj_list!</span>(<span style="color: #4ec9b0;">Maj</span>::lit(), <span style="color: #4ec9b0;">Maj</span>::closure(), <span style="color: #4ec9b0;">Maj</span>::nil(),
                  <span style="color: #c586c0;">maj_list!</span>(x.clone()),
                  <span style="color: #c586c0;">maj_list!</span>(
                      <span style="color: #c586c0;">maj_list!</span>(<span style="color: #4ec9b0;">Maj</span>::symbol(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #ce9178;">"*"</span>),
                                x.clone(), x)));
    <span style="color: #c586c0;">test_boolean!</span>(maj_write(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, closure.clone(), outstream),
                  <span style="color: #569cd6;">false</span>);
    <span style="color: #c586c0;">multi_fail_test!</span>(
        maj_write(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, closure.clone(), instream);
        maj_write(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, closure.clone(), <span style="color: #4ec9b0;">Maj</span>::integer(5));
    );
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orga692a23" class="outline-4">
<h4 id="orga692a23"><span class="section-number-4">6.6.4.</span> <span class="todo TODO">TODO</span> <code>read</code></h4>
<div class="outline-text-4" id="text-6-6-4">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #c586c0;">#[test]</span>
<span style="color: #c586c0;">#[ignore]</span>
<span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">primitives_read</span>() {
    <span style="color: #c586c0;">unimplemented!</span>();
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org36ececc" class="outline-4">
<h4 id="org36ececc"><span class="section-number-4">6.6.5.</span> <code>read-char</code> e <code>peek-char</code></h4>
<div class="outline-text-4" id="text-6-6-5">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #c586c0;">#[test]</span>
<span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">primitives_read_char_peek_char</span>() {
    <span style="color: #569cd6;">use</span> <span style="color: #569cd6;">crate</span>::<span style="color: #569cd6;">core</span>::<span style="color: #569cd6;">types</span>::<span style="color: #4ec9b0;">MajStreamDirection</span>;
    <span style="color: #569cd6;">use</span> <span style="color: #569cd6;">crate</span>::<span style="color: #569cd6;">axioms</span>::<span style="color: #569cd6;">primitives</span>::{
        maj_peek_char,
        maj_read_char,
        maj_close_stream
    };
    <span style="color: #569cd6;">use</span> <span style="color: #569cd6;">crate</span>::<span style="color: #569cd6;">axioms</span>::<span style="color: #569cd6;">predicates</span>::maj_eq;
    <span style="color: #569cd6;">let</span> <span style="color: #569cd6;">mut</span> <span style="color: #9cdcfe;">state</span> = <span style="color: #4ec9b0;">MajState</span>::new();
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">eof</span> = <span style="color: #4ec9b0;">Maj</span>::symbol(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #ce9178;">"eof"</span>);
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">istream</span> = <span style="color: #4ec9b0;">Maj</span>::stream(
        <span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state,
        <span style="color: #ce9178;">"test-streams-in.txt"</span>,
        <span style="color: #4ec9b0;">MajStreamDirection</span>::<span style="color: #4ec9b0;">In</span>).unwrap();
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">stdout</span> = state.make_stream_stdout();

    <span style="color: #c586c0;">multi_test!</span>(
        state;
        (maj_peek_char(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, istream.clone()), <span style="color: #ce9178;">"#\\H"</span>);
        (maj_peek_char(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, istream.clone()), <span style="color: #ce9178;">"#\\H"</span>);
        (maj_read_char(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, istream.clone()), <span style="color: #ce9178;">"#\\H"</span>);
        (maj_read_char(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, istream.clone()), <span style="color: #ce9178;">"#\\e"</span>);
        ({
            <span style="color: #569cd6;">while</span> !maj_eq(maj_read_char(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, istream.clone()),
                          eof.clone()).to_bool() {}
            maj_peek_char(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, istream.clone())
        }, <span style="color: #ce9178;">"eof"</span>);
        (maj_read_char(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, istream.clone()), <span style="color: #ce9178;">"eof"</span>);
    );

    <span style="color: #c586c0;">test_boolean!</span>(maj_close_stream(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, istream.clone()),
                  <span style="color: #569cd6;">true</span>);
    
    <span style="color: #c586c0;">multi_fail_test!</span>(
        maj_read_char(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, stdout.clone());
        maj_peek_char(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, stdout);
        maj_read_char(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, istream.clone());
        maj_peek_char(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, istream.clone());
        maj_read_char(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #4ec9b0;">Maj</span>::fraction(2, 3));
        maj_peek_char(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #4ec9b0;">Maj</span>::fraction(2, 3));
    );
}
</pre>
</div>
</div>
</div>
