10-testes.org
*** ~write-char~ e ~write-string~

#+begin_src rust
#[test]
fn primitives_write_char_write_string() {
    use crate::axioms::primitives::{
        maj_write_char,
        maj_write_string,
        maj_close_stream
    };
    use crate::core::types::MajStreamDirection;
    let mut state = MajState::new();
    let ostream = Maj::stream(
        &mut state,
        "test-streams-out.txt",
        MajStreamDirection::Out).unwrap();
    let stdin  = state.make_stream_stdin();
    let stdout = state.make_stream_stdout();

    multi_test!(
        state;
        (maj_write_char(
            &mut state, Maj::character('a'), ostream.clone()),
         "nil");
        (maj_write_string(
            &mut state, Maj::string("Hello"), ostream.clone()),
         "nil");
    );

    test_boolean!(
        maj_close_stream(&mut state, ostream.clone()), true);
    
    multi_fail_test!(
        maj_write_char(
            &mut state, Maj::character('a'), ostream.clone());
        maj_write_string(
            &mut state, Maj::string("Hello"), ostream.clone());
        maj_write_char(
            &mut state, Maj::character('a'), stdin.clone());
        maj_write_string(
            &mut state, Maj::string("Hello"), stdin.clone());
        maj_write_char(
            &mut state, Maj::character('a'), Maj::integer(5));
        maj_write_string(
            &mut state, Maj::string("Hello"), Maj::integer(5));
        maj_write_char(
            &mut state, Maj::integer(5), stdout.clone());
        maj_write_string(
            &mut state, Maj::integer(5), stdout.clone());
    );
}
#+end_src

* Ligações e Contextos
** Ligações globais

#+begin_src rust
#[test]
fn environments_global_bindings() {
    // use crate::axioms::MajRawSym;
    // use crate::axioms::utils::sym_from_raw;
    let mut state = MajState::new();
    let my_value = Maj::symbol(&mut state, "my-value");

    multi_eval_ast_test!(
        state;
        // (def my-value 5)
        (maj_list!(Maj::symbol(&mut state, "def"),
                   my_value.clone(),
                   Maj::integer(5)),
         Maj::nil(),
         "my-value");
        // my-value
        (my_value.clone(), Maj::nil(), "5");
    );
}
#+end_src

