doc/html/10-testes.html

<div id="outline-container-org00bc325" class="outline-4">
<h4 id="org00bc325"><span class="section-number-4">6.6.6.</span> <code>write-char</code> e <code>write-string</code></h4>
<div class="outline-text-4" id="text-6-6-6">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #c586c0;">#[test]</span>
<span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">primitives_write_char_write_string</span>() {
    <span style="color: #569cd6;">use</span> <span style="color: #569cd6;">crate</span>::<span style="color: #569cd6;">axioms</span>::<span style="color: #569cd6;">primitives</span>::{
        maj_write_char,
        maj_write_string,
        maj_close_stream
    };
    <span style="color: #569cd6;">use</span> <span style="color: #569cd6;">crate</span>::<span style="color: #569cd6;">core</span>::<span style="color: #569cd6;">types</span>::<span style="color: #4ec9b0;">MajStreamDirection</span>;
    <span style="color: #569cd6;">let</span> <span style="color: #569cd6;">mut</span> <span style="color: #9cdcfe;">state</span> = <span style="color: #4ec9b0;">MajState</span>::new();
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">ostream</span> = <span style="color: #4ec9b0;">Maj</span>::stream(
        <span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state,
        <span style="color: #ce9178;">"test-streams-out.txt"</span>,
        <span style="color: #4ec9b0;">MajStreamDirection</span>::<span style="color: #4ec9b0;">Out</span>).unwrap();
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">stdin</span>  = state.make_stream_stdin();
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">stdout</span> = state.make_stream_stdout();

    <span style="color: #c586c0;">multi_test!</span>(
        state;
        (maj_write_char(
            <span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #4ec9b0;">Maj</span>::character(<span style="color: #ce9178;">'a'</span>), ostream.clone()),
         <span style="color: #ce9178;">"nil"</span>);
        (maj_write_string(
            <span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #4ec9b0;">Maj</span>::string(<span style="color: #ce9178;">"Hello"</span>), ostream.clone()),
         <span style="color: #ce9178;">"nil"</span>);
    );

    <span style="color: #c586c0;">test_boolean!</span>(
        maj_close_stream(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, ostream.clone()), <span style="color: #569cd6;">true</span>);
    
    <span style="color: #c586c0;">multi_fail_test!</span>(
        maj_write_char(
            <span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #4ec9b0;">Maj</span>::character(<span style="color: #ce9178;">'a'</span>), ostream.clone());
        maj_write_string(
            <span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #4ec9b0;">Maj</span>::string(<span style="color: #ce9178;">"Hello"</span>), ostream.clone());
        maj_write_char(
            <span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #4ec9b0;">Maj</span>::character(<span style="color: #ce9178;">'a'</span>), stdin.clone());
        maj_write_string(
            <span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #4ec9b0;">Maj</span>::string(<span style="color: #ce9178;">"Hello"</span>), stdin.clone());
        maj_write_char(
            <span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #4ec9b0;">Maj</span>::character(<span style="color: #ce9178;">'a'</span>), <span style="color: #4ec9b0;">Maj</span>::integer(5));
        maj_write_string(
            <span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #4ec9b0;">Maj</span>::string(<span style="color: #ce9178;">"Hello"</span>), <span style="color: #4ec9b0;">Maj</span>::integer(5));
        maj_write_char(
            <span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #4ec9b0;">Maj</span>::integer(5), stdout.clone());
        maj_write_string(
            <span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #4ec9b0;">Maj</span>::integer(5), stdout.clone());
    );
}
</pre>
</div>
</div>
</div>
</div>
</div>

<div id="outline-container-org0da2871" class="outline-2">
<h2 id="org0da2871"><span class="section-number-2">7.</span> Ligações e Contextos</h2>
<div class="outline-text-2" id="text-7">
</div>
<div id="outline-container-org835f913" class="outline-3">
<h3 id="org835f913"><span class="section-number-3">7.1.</span> Ligações globais</h3>
<div class="outline-text-3" id="text-7-1">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #c586c0;">#[test]</span>
<span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">environments_global_bindings</span>() {
    <span style="color: #6a9955;">// </span><span style="color: #6a9955;">use crate::axioms::MajRawSym;</span>
    <span style="color: #6a9955;">// </span><span style="color: #6a9955;">use crate::axioms::utils::sym_from_raw;</span>
    <span style="color: #569cd6;">let</span> <span style="color: #569cd6;">mut</span> <span style="color: #9cdcfe;">state</span> = <span style="color: #4ec9b0;">MajState</span>::new();
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">my_value</span> = <span style="color: #4ec9b0;">Maj</span>::symbol(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #ce9178;">"my-value"</span>);

    <span style="color: #c586c0;">multi_eval_ast_test!</span>(
        state;
        <span style="color: #6a9955;">// </span><span style="color: #6a9955;">(def my-value 5)</span>
        (<span style="color: #c586c0;">maj_list!</span>(<span style="color: #4ec9b0;">Maj</span>::symbol(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #ce9178;">"def"</span>),
                   my_value.clone(),
                   <span style="color: #4ec9b0;">Maj</span>::integer(5)),
         <span style="color: #4ec9b0;">Maj</span>::nil(),
         <span style="color: #ce9178;">"my-value"</span>);
        <span style="color: #6a9955;">// </span><span style="color: #6a9955;">my-value</span>
        (my_value.clone(), <span style="color: #4ec9b0;">Maj</span>::nil(), <span style="color: #ce9178;">"5"</span>);
    );
}
</pre>
</div>
</div>
</div>
