10-testes.org
** Ligações léxicas/estáticas

#+begin_src rust
#[test]
fn environments_lexical_bindings() {
    use crate::axioms::MajRawSym;
    use crate::axioms::utils::sym_from_raw;
    let mut state = MajState::new();
    let f = Maj::symbol(&mut state, "f");
    let def = Maj::symbol(&mut state, "def");
    let x = Maj::symbol(&mut state, "x");
    let g = Maj::symbol(&mut state, "g");
    let y = Maj::symbol(&mut state, "y");
    let plussym = Maj::symbol(&mut state, "+");
    let fnsym = sym_from_raw(MajRawSym::Fn);
    multi_eval_ast_test!(
        state;
        // (def f (fn (x) (+ x 1)))
        (maj_list!(def.clone(), f.clone(),
                   maj_list!(fnsym.clone(),
                             maj_list!(x.clone()),
                             maj_list!(
                                 plussym.clone(),
                                 x.clone(),
                                 Maj::integer(1)))),
         Maj::nil(),
         "f");
        // (f 5)
        (maj_list!(f.clone(), Maj::integer(5)),
         Maj::nil(),
         "6");
        // (def g ((fn (x) (fn (y) (+ x y))) 9))
        (maj_list!(def.clone(), g.clone(),
                   maj_list!(
                       maj_list!(fnsym.clone(),
                                 maj_list!(x.clone()),
                                 maj_list!(fnsym.clone(),
                                           maj_list!(y.clone()),
                                           maj_list!(
                                               plussym.clone(),
                                               x.clone(),
                                               y.clone()))),
                       Maj::integer(9))),
         Maj::nil(),
         "g");
        // (g 4)
        (maj_list!(g.clone(), Maj::integer(4)),
         Maj::nil(),
         "13");
    );
}
#+end_src

** Ligações dinâmicas

#+begin_src rust
#[test]
fn environments_dynamic_bindings() {
    use crate::axioms::MajRawSym;
    use crate::axioms::utils::sym_from_raw;
    let mut state = MajState::new();
    let my_function = Maj::symbol(&mut state, "my-function");
    let def = Maj::symbol(&mut state, "def");
    let my_value = Maj::symbol(&mut state, "*my-value*");
    let fnsym = sym_from_raw(MajRawSym::Fn);
    
    multi_eval_ast_test!(
        state;
        // (def *my-value* 5)
        (maj_list!(def.clone(), my_value.clone(),
                   Maj::integer(5)),
         Maj::nil(),
         "*my-value*");
        // *my-value*
        (my_value.clone(), Maj::nil(), "5");
        // (def my-function (fn () *my-value*))
        (maj_list!(def.clone(), my_function.clone(),
                   maj_list!(
                       fnsym.clone(), Maj::nil(),
                       my_value.clone())),
         Maj::nil(),
         "my-function");
        (maj_list!(my_function.clone()),
         Maj::nil(),
         "5");
        // ((fn (*my-value*) (my-function)) 6)
        (maj_list!(
            maj_list!(fnsym.clone(),
                      maj_list!(my_value.clone()),
                      maj_list!(my_function.clone())),
            Maj::integer(6)),
         Maj::nil(),
         "6");
        // (let ((*my-value* 7))
        //   (my-function))
        (maj_list!(my_function.clone()),
         maj_list!(Maj::cons(my_value.clone(),
                             Maj::integer(7))),
         "7");
    );
}
#+end_src

