doc/html/10-testes.html

<div id="outline-container-org9a6c737" class="outline-3">
<h3 id="org9a6c737"><span class="section-number-3">7.2.</span> Ligações léxicas/estáticas</h3>
<div class="outline-text-3" id="text-7-2">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #c586c0;">#[test]</span>
<span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">environments_lexical_bindings</span>() {
    <span style="color: #569cd6;">use</span> <span style="color: #569cd6;">crate</span>::<span style="color: #569cd6;">axioms</span>::<span style="color: #4ec9b0;">MajRawSym</span>;
    <span style="color: #569cd6;">use</span> <span style="color: #569cd6;">crate</span>::<span style="color: #569cd6;">axioms</span>::<span style="color: #569cd6;">utils</span>::sym_from_raw;
    <span style="color: #569cd6;">let</span> <span style="color: #569cd6;">mut</span> <span style="color: #9cdcfe;">state</span> = <span style="color: #4ec9b0;">MajState</span>::new();
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">f</span> = <span style="color: #4ec9b0;">Maj</span>::symbol(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #ce9178;">"f"</span>);
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">def</span> = <span style="color: #4ec9b0;">Maj</span>::symbol(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #ce9178;">"def"</span>);
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">x</span> = <span style="color: #4ec9b0;">Maj</span>::symbol(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #ce9178;">"x"</span>);
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">g</span> = <span style="color: #4ec9b0;">Maj</span>::symbol(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #ce9178;">"g"</span>);
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">y</span> = <span style="color: #4ec9b0;">Maj</span>::symbol(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #ce9178;">"y"</span>);
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">plussym</span> = <span style="color: #4ec9b0;">Maj</span>::symbol(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #ce9178;">"+"</span>);
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">fnsym</span> = sym_from_raw(<span style="color: #4ec9b0;">MajRawSym</span>::<span style="color: #4ec9b0;">Fn</span>);
    <span style="color: #c586c0;">multi_eval_ast_test!</span>(
        state;
        <span style="color: #6a9955;">// </span><span style="color: #6a9955;">(def f (fn (x) (+ x 1)))</span>
        (<span style="color: #c586c0;">maj_list!</span>(def.clone(), f.clone(),
                   <span style="color: #c586c0;">maj_list!</span>(fnsym.clone(),
                             <span style="color: #c586c0;">maj_list!</span>(x.clone()),
                             <span style="color: #c586c0;">maj_list!</span>(
                                 plussym.clone(),
                                 x.clone(),
                                 <span style="color: #4ec9b0;">Maj</span>::integer(1)))),
         <span style="color: #4ec9b0;">Maj</span>::nil(),
         <span style="color: #ce9178;">"f"</span>);
        <span style="color: #6a9955;">// </span><span style="color: #6a9955;">(f 5)</span>
        (<span style="color: #c586c0;">maj_list!</span>(f.clone(), <span style="color: #4ec9b0;">Maj</span>::integer(5)),
         <span style="color: #4ec9b0;">Maj</span>::nil(),
         <span style="color: #ce9178;">"6"</span>);
        <span style="color: #6a9955;">// </span><span style="color: #6a9955;">(def g ((fn (x) (fn (y) (+ x y))) 9))</span>
        (<span style="color: #c586c0;">maj_list!</span>(def.clone(), g.clone(),
                   <span style="color: #c586c0;">maj_list!</span>(
                       <span style="color: #c586c0;">maj_list!</span>(fnsym.clone(),
                                 <span style="color: #c586c0;">maj_list!</span>(x.clone()),
                                 <span style="color: #c586c0;">maj_list!</span>(fnsym.clone(),
                                           <span style="color: #c586c0;">maj_list!</span>(y.clone()),
                                           <span style="color: #c586c0;">maj_list!</span>(
                                               plussym.clone(),
                                               x.clone(),
                                               y.clone()))),
                       <span style="color: #4ec9b0;">Maj</span>::integer(9))),
         <span style="color: #4ec9b0;">Maj</span>::nil(),
         <span style="color: #ce9178;">"g"</span>);
        <span style="color: #6a9955;">// </span><span style="color: #6a9955;">(g 4)</span>
        (<span style="color: #c586c0;">maj_list!</span>(g.clone(), <span style="color: #4ec9b0;">Maj</span>::integer(4)),
         <span style="color: #4ec9b0;">Maj</span>::nil(),
         <span style="color: #ce9178;">"13"</span>);
    );
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org5758c89" class="outline-3">
<h3 id="org5758c89"><span class="section-number-3">7.3.</span> Ligações dinâmicas</h3>
<div class="outline-text-3" id="text-7-3">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #c586c0;">#[test]</span>
<span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">environments_dynamic_bindings</span>() {
    <span style="color: #569cd6;">use</span> <span style="color: #569cd6;">crate</span>::<span style="color: #569cd6;">axioms</span>::<span style="color: #4ec9b0;">MajRawSym</span>;
    <span style="color: #569cd6;">use</span> <span style="color: #569cd6;">crate</span>::<span style="color: #569cd6;">axioms</span>::<span style="color: #569cd6;">utils</span>::sym_from_raw;
    <span style="color: #569cd6;">let</span> <span style="color: #569cd6;">mut</span> <span style="color: #9cdcfe;">state</span> = <span style="color: #4ec9b0;">MajState</span>::new();
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">my_function</span> = <span style="color: #4ec9b0;">Maj</span>::symbol(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #ce9178;">"my-function"</span>);
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">def</span> = <span style="color: #4ec9b0;">Maj</span>::symbol(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #ce9178;">"def"</span>);
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">my_value</span> = <span style="color: #4ec9b0;">Maj</span>::symbol(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #ce9178;">"*my-value*"</span>);
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">fnsym</span> = sym_from_raw(<span style="color: #4ec9b0;">MajRawSym</span>::<span style="color: #4ec9b0;">Fn</span>);
    
    <span style="color: #c586c0;">multi_eval_ast_test!</span>(
        state;
        <span style="color: #6a9955;">// </span><span style="color: #6a9955;">(def *my-value* 5)</span>
        (<span style="color: #c586c0;">maj_list!</span>(def.clone(), my_value.clone(),
                   <span style="color: #4ec9b0;">Maj</span>::integer(5)),
         <span style="color: #4ec9b0;">Maj</span>::nil(),
         <span style="color: #ce9178;">"*my-value*"</span>);
        <span style="color: #6a9955;">// </span><span style="color: #6a9955;">*my-value*</span>
        (my_value.clone(), <span style="color: #4ec9b0;">Maj</span>::nil(), <span style="color: #ce9178;">"5"</span>);
        <span style="color: #6a9955;">// </span><span style="color: #6a9955;">(def my-function (fn () *my-value*))</span>
        (<span style="color: #c586c0;">maj_list!</span>(def.clone(), my_function.clone(),
                   <span style="color: #c586c0;">maj_list!</span>(
                       fnsym.clone(), <span style="color: #4ec9b0;">Maj</span>::nil(),
                       my_value.clone())),
         <span style="color: #4ec9b0;">Maj</span>::nil(),
         <span style="color: #ce9178;">"my-function"</span>);
        (<span style="color: #c586c0;">maj_list!</span>(my_function.clone()),
         <span style="color: #4ec9b0;">Maj</span>::nil(),
         <span style="color: #ce9178;">"5"</span>);
        <span style="color: #6a9955;">// </span><span style="color: #6a9955;">((fn (*my-value*) (my-function)) 6)</span>
        (<span style="color: #c586c0;">maj_list!</span>(
            <span style="color: #c586c0;">maj_list!</span>(fnsym.clone(),
                      <span style="color: #c586c0;">maj_list!</span>(my_value.clone()),
                      <span style="color: #c586c0;">maj_list!</span>(my_function.clone())),
            <span style="color: #4ec9b0;">Maj</span>::integer(6)),
         <span style="color: #4ec9b0;">Maj</span>::nil(),
         <span style="color: #ce9178;">"6"</span>);
        <span style="color: #6a9955;">// </span><span style="color: #6a9955;">(let ((*my-value* 7))</span>
        <span style="color: #6a9955;">//   </span><span style="color: #6a9955;">(my-function))</span>
        (<span style="color: #c586c0;">maj_list!</span>(my_function.clone()),
         <span style="color: #c586c0;">maj_list!</span>(<span style="color: #4ec9b0;">Maj</span>::cons(my_value.clone(),
                             <span style="color: #4ec9b0;">Maj</span>::integer(7))),
         <span style="color: #ce9178;">"7"</span>);
    );
}
</pre>
</div>
</div>
</div>
