10-testes.org
** Mutabilidade

#+begin_src rust
#[test]
fn environment_mutability_set() {
    let mut state = MajState::new();
    let def = Maj::symbol(&mut state, "def");
    let set = Maj::symbol(&mut state, "set");
    let x   = Maj::symbol(&mut state, "x");
    let mutate_x = Maj::symbol(&mut state, "mutate-x");
    let mutate_x_local = Maj::symbol(&mut state, "mutate-x-local");
    multi_eval_ast_test!(
        state;
        // (def x 5)
        (maj_list!(def.clone(), x.clone(), Maj::integer(5)),
         Maj::nil(),
         "x");

        // x
        (x.clone(), Maj::nil(), "5");
        
        // (set x 9)
        (maj_list!(set.clone(), x.clone(), Maj::integer(9)),
         Maj::nil(),
         "x");
        
        // x
        (x.clone(), Maj::nil(), "9");

        // (do (set x (1+ x)) x)
        // context: ((x . 12))
        (maj_list!(
            Maj::do_sym(),
            maj_list!(
                set.clone(), x.clone(),
                maj_list!(Maj::symbol(&mut state, "1+"),
                          x.clone())),
            x.clone()),
         maj_list!(Maj::cons(x.clone(), Maj::integer(12))),
         "13");

        // (defn mutate-x () (set x (+ x 2)) x)
        (maj_list!(
            Maj::symbol(&mut state, "defn"),
            mutate_x.clone(), Maj::nil(),
            maj_list!(
                set.clone(), x.clone(),
                maj_list!(
                    Maj::symbol(&mut state, "+"),
                    x.clone(), Maj::integer(2))),
            x.clone()),
         Maj::nil(),
         "mutate-x");
        
        // (mutate-x) altering x globally
        (maj_list!(mutate_x.clone()), Maj::nil(), "11");
        
        // (mutate-x) altering x dynamically
        // context: ((x . 12))
        (maj_list!(mutate_x.clone()),
         maj_list!(Maj::cons(x.clone(), Maj::integer(12))),
         "14");

        // x, unchanged
        (x.clone(), Maj::nil(), "11");

        // (defn mutate-x-local () (set x (+ x 2)) x)
        // context: ((x . 12))
        (maj_list!(
            Maj::symbol(&mut state, "defn"),
            mutate_x_local.clone(), Maj::nil(),
            maj_list!(
                set.clone(), x.clone(),
                maj_list!(
                    Maj::symbol(&mut state, "+"),
                    x.clone(), Maj::integer(2))),
            x.clone()),
         maj_list!(Maj::cons(x.clone(), Maj::integer(12))),
         "mutate-x-local");

        // (mutate-x-local) changing captured environment
        (maj_list!(mutate_x_local.clone()), Maj::nil(), "14");
        
        // x, unchanged
        (x.clone(), Maj::nil(), "11");

        // (mutate-x-local) changing captured environment
        (maj_list!(mutate_x_local.clone()), Maj::nil(), "16");

        // x, unchanged
        (x.clone(), Maj::nil(), "11");
    );
}
#+end_src

#+begin_src rust
#[test]
fn environment_mutability_set_car_set_cdr() {
    let mut state = MajState::new();
    let def     = Maj::symbol(&mut state, "def");
    let defn    = Maj::symbol(&mut state, "defn");
    let set_car = Maj::symbol(&mut state, "set-car");
    let set_cdr = Maj::symbol(&mut state, "set-cdr");
    let x       = Maj::symbol(&mut state, "x");
    let a       = Maj::symbol(&mut state, "a");
    let b       = Maj::symbol(&mut state, "b");
    let replace_x_elts = Maj::symbol(&mut state, "replace-x-elts");
    let replace_x_elts_local =
        Maj::symbol(&mut state, "replace-x-elts-local");
    multi_eval_ast_test!(
        state;
        // (def x '(1 . 2))
        (maj_list!(
            def.clone(), x.clone(),
            maj_list!(Maj::quote(), Maj::cons(Maj::integer(1),
                                              Maj::integer(2)))),
         Maj::nil(),
         "x");
        
        // x
        (x.clone(), Maj::nil(), "(1 . 2)");
        
        // (set-car x 5)
        (maj_list!(
            set_car.clone(), x.clone(), Maj::integer(5)),
         Maj::nil(),
         "(5 . 2)");
        
        // (set-cdr x 6)
        (maj_list!(
            set_cdr.clone(), x.clone(), Maj::integer(6)),
         Maj::nil(),
         "(5 . 6)");
        
        // x
        (x.clone(), Maj::nil(), "(5 . 6)");
        
        // defining replace-x-elts
        (maj_list!(
            defn.clone(), replace_x_elts.clone(),
            maj_list!(a.clone(), b.clone()),
            maj_list!(set_car.clone(), x.clone(), a.clone()),
            maj_list!(set_cdr.clone(), x.clone(), b.clone()),
            x.clone()),
         Maj::nil(),
         "replace-x-elts");

        // (replace-x-elts 20 90)
        // context: ((x . (9 . 10)))
        (maj_list!(
            replace_x_elts.clone(),
            Maj::integer(20), Maj::integer(90)),
         maj_list!(Maj::cons(x.clone(),
                             Maj::cons(Maj::integer(9),
                                       Maj::integer(10)))),
         "(20 . 90)");

        // x
        (x.clone(), Maj::nil(), "(5 . 6)");

        // (replace-x-elts 30 45)
        (maj_list!(replace_x_elts.clone(),
                   Maj::integer(30), Maj::integer(45)),
         Maj::nil(),
         "(30 . 45)");
        
        // x
        (x.clone(), Maj::nil(), "(30 . 45)");

        // defining replace-x-elts-local
        // context: ((x . (9 . 10)))
        (maj_list!(
            defn.clone(), replace_x_elts_local.clone(),
            maj_list!(a.clone(), b.clone()),
            maj_list!(set_car.clone(), x.clone(), a.clone()),
            maj_list!(set_cdr.clone(), x.clone(), b.clone()),
            x.clone()),
         maj_list!(Maj::cons(x.clone(),
                             Maj::cons(Maj::integer(9),
                                       Maj::integer(10)))),
         "replace-x-elts-local");

        // (replace-x-elts-local 13 50)
        (maj_list!(
            replace_x_elts_local.clone(),
            Maj::integer(13), Maj::integer(50)),
         Maj::nil(),
         "(13 . 50)");

        // x
        (x.clone(), Maj::nil(), "(30 . 45)");
    );
}
#+end_src

