doc/html/10-testes.html

<div id="outline-container-org1bbc8ba" class="outline-3">
<h3 id="org1bbc8ba"><span class="section-number-3">7.4.</span> Mutabilidade</h3>
<div class="outline-text-3" id="text-7-4">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #c586c0;">#[test]</span>
<span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">environment_mutability_set</span>() {
    <span style="color: #569cd6;">let</span> <span style="color: #569cd6;">mut</span> <span style="color: #9cdcfe;">state</span> = <span style="color: #4ec9b0;">MajState</span>::new();
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">def</span> = <span style="color: #4ec9b0;">Maj</span>::symbol(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #ce9178;">"def"</span>);
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">set</span> = <span style="color: #4ec9b0;">Maj</span>::symbol(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #ce9178;">"set"</span>);
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">x</span>   = <span style="color: #4ec9b0;">Maj</span>::symbol(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #ce9178;">"x"</span>);
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">mutate_x</span> = <span style="color: #4ec9b0;">Maj</span>::symbol(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #ce9178;">"mutate-x"</span>);
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">mutate_x_local</span> = <span style="color: #4ec9b0;">Maj</span>::symbol(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #ce9178;">"mutate-x-local"</span>);
    <span style="color: #c586c0;">multi_eval_ast_test!</span>(
        state;
        <span style="color: #6a9955;">// </span><span style="color: #6a9955;">(def x 5)</span>
        (<span style="color: #c586c0;">maj_list!</span>(def.clone(), x.clone(), <span style="color: #4ec9b0;">Maj</span>::integer(5)),
         <span style="color: #4ec9b0;">Maj</span>::nil(),
         <span style="color: #ce9178;">"x"</span>);

        <span style="color: #6a9955;">// </span><span style="color: #6a9955;">x</span>
        (x.clone(), <span style="color: #4ec9b0;">Maj</span>::nil(), <span style="color: #ce9178;">"5"</span>);
        
        <span style="color: #6a9955;">// </span><span style="color: #6a9955;">(set x 9)</span>
        (<span style="color: #c586c0;">maj_list!</span>(set.clone(), x.clone(), <span style="color: #4ec9b0;">Maj</span>::integer(9)),
         <span style="color: #4ec9b0;">Maj</span>::nil(),
         <span style="color: #ce9178;">"x"</span>);
        
        <span style="color: #6a9955;">// </span><span style="color: #6a9955;">x</span>
        (x.clone(), <span style="color: #4ec9b0;">Maj</span>::nil(), <span style="color: #ce9178;">"9"</span>);

        <span style="color: #6a9955;">// </span><span style="color: #6a9955;">(do (set x (1+ x)) x)</span>
        <span style="color: #6a9955;">// </span><span style="color: #6a9955;">context: ((x . 12))</span>
        (<span style="color: #c586c0;">maj_list!</span>(
            <span style="color: #4ec9b0;">Maj</span>::do_sym(),
            <span style="color: #c586c0;">maj_list!</span>(
                set.clone(), x.clone(),
                <span style="color: #c586c0;">maj_list!</span>(<span style="color: #4ec9b0;">Maj</span>::symbol(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #ce9178;">"1+"</span>),
                          x.clone())),
            x.clone()),
         <span style="color: #c586c0;">maj_list!</span>(<span style="color: #4ec9b0;">Maj</span>::cons(x.clone(), <span style="color: #4ec9b0;">Maj</span>::integer(12))),
         <span style="color: #ce9178;">"13"</span>);

        <span style="color: #6a9955;">// </span><span style="color: #6a9955;">(defn mutate-x () (set x (+ x 2)) x)</span>
        (<span style="color: #c586c0;">maj_list!</span>(
            <span style="color: #4ec9b0;">Maj</span>::symbol(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #ce9178;">"defn"</span>),
            mutate_x.clone(), <span style="color: #4ec9b0;">Maj</span>::nil(),
            <span style="color: #c586c0;">maj_list!</span>(
                set.clone(), x.clone(),
                <span style="color: #c586c0;">maj_list!</span>(
                    <span style="color: #4ec9b0;">Maj</span>::symbol(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #ce9178;">"+"</span>),
                    x.clone(), <span style="color: #4ec9b0;">Maj</span>::integer(2))),
            x.clone()),
         <span style="color: #4ec9b0;">Maj</span>::nil(),
         <span style="color: #ce9178;">"mutate-x"</span>);
        
        <span style="color: #6a9955;">// </span><span style="color: #6a9955;">(mutate-x) altering x globally</span>
        (<span style="color: #c586c0;">maj_list!</span>(mutate_x.clone()), <span style="color: #4ec9b0;">Maj</span>::nil(), <span style="color: #ce9178;">"11"</span>);
        
        <span style="color: #6a9955;">// </span><span style="color: #6a9955;">(mutate-x) altering x dynamically</span>
        <span style="color: #6a9955;">// </span><span style="color: #6a9955;">context: ((x . 12))</span>
        (<span style="color: #c586c0;">maj_list!</span>(mutate_x.clone()),
         <span style="color: #c586c0;">maj_list!</span>(<span style="color: #4ec9b0;">Maj</span>::cons(x.clone(), <span style="color: #4ec9b0;">Maj</span>::integer(12))),
         <span style="color: #ce9178;">"14"</span>);

        <span style="color: #6a9955;">// </span><span style="color: #6a9955;">x, unchanged</span>
        (x.clone(), <span style="color: #4ec9b0;">Maj</span>::nil(), <span style="color: #ce9178;">"11"</span>);

        <span style="color: #6a9955;">// </span><span style="color: #6a9955;">(defn mutate-x-local () (set x (+ x 2)) x)</span>
        <span style="color: #6a9955;">// </span><span style="color: #6a9955;">context: ((x . 12))</span>
        (<span style="color: #c586c0;">maj_list!</span>(
            <span style="color: #4ec9b0;">Maj</span>::symbol(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #ce9178;">"defn"</span>),
            mutate_x_local.clone(), <span style="color: #4ec9b0;">Maj</span>::nil(),
            <span style="color: #c586c0;">maj_list!</span>(
                set.clone(), x.clone(),
                <span style="color: #c586c0;">maj_list!</span>(
                    <span style="color: #4ec9b0;">Maj</span>::symbol(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #ce9178;">"+"</span>),
                    x.clone(), <span style="color: #4ec9b0;">Maj</span>::integer(2))),
            x.clone()),
         <span style="color: #c586c0;">maj_list!</span>(<span style="color: #4ec9b0;">Maj</span>::cons(x.clone(), <span style="color: #4ec9b0;">Maj</span>::integer(12))),
         <span style="color: #ce9178;">"mutate-x-local"</span>);

        <span style="color: #6a9955;">// </span><span style="color: #6a9955;">(mutate-x-local) changing captured environment</span>
        (<span style="color: #c586c0;">maj_list!</span>(mutate_x_local.clone()), <span style="color: #4ec9b0;">Maj</span>::nil(), <span style="color: #ce9178;">"14"</span>);
        
        <span style="color: #6a9955;">// </span><span style="color: #6a9955;">x, unchanged</span>
        (x.clone(), <span style="color: #4ec9b0;">Maj</span>::nil(), <span style="color: #ce9178;">"11"</span>);

        <span style="color: #6a9955;">// </span><span style="color: #6a9955;">(mutate-x-local) changing captured environment</span>
        (<span style="color: #c586c0;">maj_list!</span>(mutate_x_local.clone()), <span style="color: #4ec9b0;">Maj</span>::nil(), <span style="color: #ce9178;">"16"</span>);

        <span style="color: #6a9955;">// </span><span style="color: #6a9955;">x, unchanged</span>
        (x.clone(), <span style="color: #4ec9b0;">Maj</span>::nil(), <span style="color: #ce9178;">"11"</span>);
    );
}
</pre>
</div>

<div class="org-src-container">
<pre class="src src-rust"><span style="color: #c586c0;">#[test]</span>
<span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">environment_mutability_set_car_set_cdr</span>() {
    <span style="color: #569cd6;">let</span> <span style="color: #569cd6;">mut</span> <span style="color: #9cdcfe;">state</span> = <span style="color: #4ec9b0;">MajState</span>::new();
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">def</span>     = <span style="color: #4ec9b0;">Maj</span>::symbol(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #ce9178;">"def"</span>);
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">defn</span>    = <span style="color: #4ec9b0;">Maj</span>::symbol(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #ce9178;">"defn"</span>);
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">set_car</span> = <span style="color: #4ec9b0;">Maj</span>::symbol(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #ce9178;">"set-car"</span>);
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">set_cdr</span> = <span style="color: #4ec9b0;">Maj</span>::symbol(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #ce9178;">"set-cdr"</span>);
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">x</span>       = <span style="color: #4ec9b0;">Maj</span>::symbol(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #ce9178;">"x"</span>);
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">a</span>       = <span style="color: #4ec9b0;">Maj</span>::symbol(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #ce9178;">"a"</span>);
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">b</span>       = <span style="color: #4ec9b0;">Maj</span>::symbol(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #ce9178;">"b"</span>);
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">replace_x_elts</span> = <span style="color: #4ec9b0;">Maj</span>::symbol(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #ce9178;">"replace-x-elts"</span>);
    <span style="color: #569cd6;">let</span> <span style="color: #9cdcfe;">replace_x_elts_local</span> =
        <span style="color: #4ec9b0;">Maj</span>::symbol(<span style="color: #d4d4d4; background-color: #1e1e1e;">&amp;</span><span style="color: #569cd6;">mut</span> state, <span style="color: #ce9178;">"replace-x-elts-local"</span>);
    <span style="color: #c586c0;">multi_eval_ast_test!</span>(
        state;
        <span style="color: #6a9955;">// </span><span style="color: #6a9955;">(def x '(1 . 2))</span>
        (<span style="color: #c586c0;">maj_list!</span>(
            def.clone(), x.clone(),
            <span style="color: #c586c0;">maj_list!</span>(<span style="color: #4ec9b0;">Maj</span>::quote(), <span style="color: #4ec9b0;">Maj</span>::cons(<span style="color: #4ec9b0;">Maj</span>::integer(1),
                                              <span style="color: #4ec9b0;">Maj</span>::integer(2)))),
         <span style="color: #4ec9b0;">Maj</span>::nil(),
         <span style="color: #ce9178;">"x"</span>);
        
        <span style="color: #6a9955;">// </span><span style="color: #6a9955;">x</span>
        (x.clone(), <span style="color: #4ec9b0;">Maj</span>::nil(), <span style="color: #ce9178;">"(1 . 2)"</span>);
        
        <span style="color: #6a9955;">// </span><span style="color: #6a9955;">(set-car x 5)</span>
        (<span style="color: #c586c0;">maj_list!</span>(
            set_car.clone(), x.clone(), <span style="color: #4ec9b0;">Maj</span>::integer(5)),
         <span style="color: #4ec9b0;">Maj</span>::nil(),
         <span style="color: #ce9178;">"(5 . 2)"</span>);
        
        <span style="color: #6a9955;">// </span><span style="color: #6a9955;">(set-cdr x 6)</span>
        (<span style="color: #c586c0;">maj_list!</span>(
            set_cdr.clone(), x.clone(), <span style="color: #4ec9b0;">Maj</span>::integer(6)),
         <span style="color: #4ec9b0;">Maj</span>::nil(),
         <span style="color: #ce9178;">"(5 . 6)"</span>);
        
        <span style="color: #6a9955;">// </span><span style="color: #6a9955;">x</span>
        (x.clone(), <span style="color: #4ec9b0;">Maj</span>::nil(), <span style="color: #ce9178;">"(5 . 6)"</span>);
        
        <span style="color: #6a9955;">// </span><span style="color: #6a9955;">defining replace-x-elts</span>
        (<span style="color: #c586c0;">maj_list!</span>(
            defn.clone(), replace_x_elts.clone(),
            <span style="color: #c586c0;">maj_list!</span>(a.clone(), b.clone()),
            <span style="color: #c586c0;">maj_list!</span>(set_car.clone(), x.clone(), a.clone()),
            <span style="color: #c586c0;">maj_list!</span>(set_cdr.clone(), x.clone(), b.clone()),
            x.clone()),
         <span style="color: #4ec9b0;">Maj</span>::nil(),
         <span style="color: #ce9178;">"replace-x-elts"</span>);

        <span style="color: #6a9955;">// </span><span style="color: #6a9955;">(replace-x-elts 20 90)</span>
        <span style="color: #6a9955;">// </span><span style="color: #6a9955;">context: ((x . (9 . 10)))</span>
        (<span style="color: #c586c0;">maj_list!</span>(
            replace_x_elts.clone(),
            <span style="color: #4ec9b0;">Maj</span>::integer(20), <span style="color: #4ec9b0;">Maj</span>::integer(90)),
         <span style="color: #c586c0;">maj_list!</span>(<span style="color: #4ec9b0;">Maj</span>::cons(x.clone(),
                             <span style="color: #4ec9b0;">Maj</span>::cons(<span style="color: #4ec9b0;">Maj</span>::integer(9),
                                       <span style="color: #4ec9b0;">Maj</span>::integer(10)))),
         <span style="color: #ce9178;">"(20 . 90)"</span>);

        <span style="color: #6a9955;">// </span><span style="color: #6a9955;">x</span>
        (x.clone(), <span style="color: #4ec9b0;">Maj</span>::nil(), <span style="color: #ce9178;">"(5 . 6)"</span>);

        <span style="color: #6a9955;">// </span><span style="color: #6a9955;">(replace-x-elts 30 45)</span>
        (<span style="color: #c586c0;">maj_list!</span>(replace_x_elts.clone(),
                   <span style="color: #4ec9b0;">Maj</span>::integer(30), <span style="color: #4ec9b0;">Maj</span>::integer(45)),
         <span style="color: #4ec9b0;">Maj</span>::nil(),
         <span style="color: #ce9178;">"(30 . 45)"</span>);
        
        <span style="color: #6a9955;">// </span><span style="color: #6a9955;">x</span>
        (x.clone(), <span style="color: #4ec9b0;">Maj</span>::nil(), <span style="color: #ce9178;">"(30 . 45)"</span>);

        <span style="color: #6a9955;">// </span><span style="color: #6a9955;">defining replace-x-elts-local</span>
        <span style="color: #6a9955;">// </span><span style="color: #6a9955;">context: ((x . (9 . 10)))</span>
        (<span style="color: #c586c0;">maj_list!</span>(
            defn.clone(), replace_x_elts_local.clone(),
            <span style="color: #c586c0;">maj_list!</span>(a.clone(), b.clone()),
            <span style="color: #c586c0;">maj_list!</span>(set_car.clone(), x.clone(), a.clone()),
            <span style="color: #c586c0;">maj_list!</span>(set_cdr.clone(), x.clone(), b.clone()),
            x.clone()),
         <span style="color: #c586c0;">maj_list!</span>(<span style="color: #4ec9b0;">Maj</span>::cons(x.clone(),
                             <span style="color: #4ec9b0;">Maj</span>::cons(<span style="color: #4ec9b0;">Maj</span>::integer(9),
                                       <span style="color: #4ec9b0;">Maj</span>::integer(10)))),
         <span style="color: #ce9178;">"replace-x-elts-local"</span>);

        <span style="color: #6a9955;">// </span><span style="color: #6a9955;">(replace-x-elts-local 13 50)</span>
        (<span style="color: #c586c0;">maj_list!</span>(
            replace_x_elts_local.clone(),
            <span style="color: #4ec9b0;">Maj</span>::integer(13), <span style="color: #4ec9b0;">Maj</span>::integer(50)),
         <span style="color: #4ec9b0;">Maj</span>::nil(),
         <span style="color: #ce9178;">"(13 . 50)"</span>);

        <span style="color: #6a9955;">// </span><span style="color: #6a9955;">x</span>
        (x.clone(), <span style="color: #4ec9b0;">Maj</span>::nil(), <span style="color: #ce9178;">"(30 . 45)"</span>);
    );
}
</pre>
</div>
</div>
</div>
</div>
