10-testes.org
* Leitor (Tokenizador e Parser)
** Expressões simples

#+begin_src rust
#[test]
fn reader_simple_expressions() {
    let mut state = MajState::new();
    multi_parser_test!(
        state;
        ("", vec![], "nil");
        ("test", vec!["test"], "(test)");
        ("(defn foo ()
            (print \"Hello world\"))",
         vec!["(", "defn", "foo", "(", ")",
              "(", "print", "\"Hello world\"", ")", ")"],
         "((defn foo nil (print \"Hello world\")))");
        ("foo (foo) 5",
         vec!["foo", "(", "foo", ")", "5"],
         "(foo (foo) 5)");
    );
    multi_parser_fail_test!(
        state;
        "(')";
        "(a . b c)";
        "(a .";
        "(a . ";
        "(a . b";
        "a b . c d e";
        "foo bar '";
        "foo bar ,";
        "foo bar ,@";
        "foo ',@";
        "#\\invalidchar";
    );
}
#+end_src

** Números

#+begin_src rust
#[test]
#[ignore]
fn reader_numbers() {
    let mut state = MajState::new();
    multi_parser_fail_test!(
        state;
        // These are supposed to be parser errors!
        // Fix the parser so that these produce proper errors.
        "J";
        "j";
        ".";
        "/";
        "1/0";
        "1/00";
    );
}
#+end_src

** Strings

#+begin_src rust
#[test]
fn reader_strings() {
    let mut state = MajState::new();
    multi_parser_test!(
        state;
        ("\"Hello\\nworld\"",
         vec!["\"Hello\\nworld\""],
         "(\"Hello\nworld\")");
        ("\"Hello\\tworld\"",
        vec!["\"Hello\\tworld\""],
        "(\"Hello	world\")");
    );
}
#+end_src

** Read macros
*** Comentários

#+begin_src rust
#[test]
fn reader_comments() {
    let mut state = MajState::new();
    multi_parser_test!(
        state;
        (";", vec![], "nil");
        ("; ", vec![], "nil");
        (";;", vec![], "nil");
        (";; ", vec![], "nil");
        (";;;", vec![], "nil");
        (";;; ", vec![], "nil");
        ("; Comentário", vec![], "nil");
        (";; Comentário", vec![], "nil");
        (";;; Comentário", vec![], "nil");
        (";; Comentários seguidos
          ;; Em várias linhas",
         vec![],
         "nil");
        (";; Comentário com tokens
          (+ 1 2)",
         vec!["(", "+", "1", "2", ")"],
         "((+ 1 2))");
        ("(+ 1 2) ; Comentário ao final",
         vec!["(", "+", "1", "2", ")"],
        "((+ 1 2))");
        ("(+ 1 2) ; Comentário ao final e continua
          (- 3 4)",
         vec!["(", "+", "1", "2", ")",
              "(", "-", "3", "4", ")"],
        "((+ 1 2) (- 3 4))");
    );
}
#+end_src

*** Quote

#+begin_src rust
#[test]
fn reader_quote() {
    let mut state = MajState::new();
    multi_parser_test!(
        state;
        ("'foo", vec!["'", "foo"], "((quote foo))");
        ("'a 'b 'c", vec!["'", "a", "'", "b", "'", "c"],
         "((quote a) (quote b) (quote c))");
        ("'a", vec!["'", "a"], "((quote a))");
        ("'(1 2 3)", vec!["'", "(", "1", "2", "3", ")"],
         "((quote (1 2 3)))");
    );
}
#+end_src

