doc/html/10-testes.html

<div id="outline-container-orga2ca306" class="outline-2">
<h2 id="orga2ca306"><span class="section-number-2">8.</span> Leitor (Tokenizador e Parser)</h2>
<div class="outline-text-2" id="text-8">
</div>
<div id="outline-container-org8846b12" class="outline-3">
<h3 id="org8846b12"><span class="section-number-3">8.1.</span> Expressões simples</h3>
<div class="outline-text-3" id="text-8-1">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #c586c0;">#[test]</span>
<span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">reader_simple_expressions</span>() {
    <span style="color: #569cd6;">let</span> <span style="color: #569cd6;">mut</span> <span style="color: #9cdcfe;">state</span> = <span style="color: #4ec9b0;">MajState</span>::new();
    <span style="color: #c586c0;">multi_parser_test!</span>(
        state;
        (<span style="color: #ce9178;">""</span>, <span style="color: #c586c0;">vec!</span>[], <span style="color: #ce9178;">"nil"</span>);
        (<span style="color: #ce9178;">"test"</span>, <span style="color: #c586c0;">vec!</span>[<span style="color: #ce9178;">"test"</span>], <span style="color: #ce9178;">"(test)"</span>);
        (<span style="color: #ce9178;">"(defn foo ()</span>
<span style="color: #ce9178;">            (print \"Hello world\"))"</span>,
         <span style="color: #c586c0;">vec!</span>[<span style="color: #ce9178;">"("</span>, <span style="color: #ce9178;">"defn"</span>, <span style="color: #ce9178;">"foo"</span>, <span style="color: #ce9178;">"("</span>, <span style="color: #ce9178;">")"</span>,
              <span style="color: #ce9178;">"("</span>, <span style="color: #ce9178;">"print"</span>, <span style="color: #ce9178;">"\"Hello world\""</span>, <span style="color: #ce9178;">")"</span>, <span style="color: #ce9178;">")"</span>],
         <span style="color: #ce9178;">"((defn foo nil (print \"Hello world\")))"</span>);
        (<span style="color: #ce9178;">"foo (foo) 5"</span>,
         <span style="color: #c586c0;">vec!</span>[<span style="color: #ce9178;">"foo"</span>, <span style="color: #ce9178;">"("</span>, <span style="color: #ce9178;">"foo"</span>, <span style="color: #ce9178;">")"</span>, <span style="color: #ce9178;">"5"</span>],
         <span style="color: #ce9178;">"(foo (foo) 5)"</span>);
    );
    <span style="color: #c586c0;">multi_parser_fail_test!</span>(
        state;
        <span style="color: #ce9178;">"(')"</span>;
        <span style="color: #ce9178;">"(a . b c)"</span>;
        <span style="color: #ce9178;">"(a ."</span>;
        <span style="color: #ce9178;">"(a . "</span>;
        <span style="color: #ce9178;">"(a . b"</span>;
        <span style="color: #ce9178;">"a b . c d e"</span>;
        <span style="color: #ce9178;">"foo bar '"</span>;
        <span style="color: #ce9178;">"foo bar ,"</span>;
        <span style="color: #ce9178;">"foo bar ,@"</span>;
        <span style="color: #ce9178;">"foo ',@"</span>;
        <span style="color: #ce9178;">"#\\invalidchar"</span>;
    );
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orgfee225f" class="outline-3">
<h3 id="orgfee225f"><span class="section-number-3">8.2.</span> Números</h3>
<div class="outline-text-3" id="text-8-2">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #c586c0;">#[test]</span>
<span style="color: #c586c0;">#[ignore]</span>
<span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">reader_numbers</span>() {
    <span style="color: #569cd6;">let</span> <span style="color: #569cd6;">mut</span> <span style="color: #9cdcfe;">state</span> = <span style="color: #4ec9b0;">MajState</span>::new();
    <span style="color: #c586c0;">multi_parser_fail_test!</span>(
        state;
        <span style="color: #6a9955;">// </span><span style="color: #6a9955;">These are supposed to be parser errors!</span>
        <span style="color: #6a9955;">// </span><span style="color: #6a9955;">Fix the parser so that these produce proper errors.</span>
        <span style="color: #ce9178;">"J"</span>;
        <span style="color: #ce9178;">"j"</span>;
        <span style="color: #ce9178;">"."</span>;
        <span style="color: #ce9178;">"/"</span>;
        <span style="color: #ce9178;">"1/0"</span>;
        <span style="color: #ce9178;">"1/00"</span>;
    );
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org68ea48f" class="outline-3">
<h3 id="org68ea48f"><span class="section-number-3">8.3.</span> Strings</h3>
<div class="outline-text-3" id="text-8-3">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #c586c0;">#[test]</span>
<span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">reader_strings</span>() {
    <span style="color: #569cd6;">let</span> <span style="color: #569cd6;">mut</span> <span style="color: #9cdcfe;">state</span> = <span style="color: #4ec9b0;">MajState</span>::new();
    <span style="color: #c586c0;">multi_parser_test!</span>(
        state;
        (<span style="color: #ce9178;">"\"Hello\\nworld\""</span>,
         <span style="color: #c586c0;">vec!</span>[<span style="color: #ce9178;">"\"Hello\\nworld\""</span>],
         <span style="color: #ce9178;">"(\"Hello\nworld\")"</span>);
        (<span style="color: #ce9178;">"\"Hello\\tworld\""</span>,
        <span style="color: #c586c0;">vec!</span>[<span style="color: #ce9178;">"\"Hello\\tworld\""</span>],
        <span style="color: #ce9178;">"(\"Hello       world\")"</span>);
    );
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org5c031aa" class="outline-3">
<h3 id="org5c031aa"><span class="section-number-3">8.4.</span> Read macros</h3>
<div class="outline-text-3" id="text-8-4">
</div>
<div id="outline-container-orge4d7359" class="outline-4">
<h4 id="orge4d7359"><span class="section-number-4">8.4.1.</span> Comentários</h4>
<div class="outline-text-4" id="text-8-4-1">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #c586c0;">#[test]</span>
<span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">reader_comments</span>() {
    <span style="color: #569cd6;">let</span> <span style="color: #569cd6;">mut</span> <span style="color: #9cdcfe;">state</span> = <span style="color: #4ec9b0;">MajState</span>::new();
    <span style="color: #c586c0;">multi_parser_test!</span>(
        state;
        (<span style="color: #ce9178;">";"</span>, <span style="color: #c586c0;">vec!</span>[], <span style="color: #ce9178;">"nil"</span>);
        (<span style="color: #ce9178;">"; "</span>, <span style="color: #c586c0;">vec!</span>[], <span style="color: #ce9178;">"nil"</span>);
        (<span style="color: #ce9178;">";;"</span>, <span style="color: #c586c0;">vec!</span>[], <span style="color: #ce9178;">"nil"</span>);
        (<span style="color: #ce9178;">";; "</span>, <span style="color: #c586c0;">vec!</span>[], <span style="color: #ce9178;">"nil"</span>);
        (<span style="color: #ce9178;">";;;"</span>, <span style="color: #c586c0;">vec!</span>[], <span style="color: #ce9178;">"nil"</span>);
        (<span style="color: #ce9178;">";;; "</span>, <span style="color: #c586c0;">vec!</span>[], <span style="color: #ce9178;">"nil"</span>);
        (<span style="color: #ce9178;">"; Coment&#225;rio"</span>, <span style="color: #c586c0;">vec!</span>[], <span style="color: #ce9178;">"nil"</span>);
        (<span style="color: #ce9178;">";; Coment&#225;rio"</span>, <span style="color: #c586c0;">vec!</span>[], <span style="color: #ce9178;">"nil"</span>);
        (<span style="color: #ce9178;">";;; Coment&#225;rio"</span>, <span style="color: #c586c0;">vec!</span>[], <span style="color: #ce9178;">"nil"</span>);
        (<span style="color: #ce9178;">";; Coment&#225;rios seguidos</span>
<span style="color: #ce9178;">          ;; Em v&#225;rias linhas"</span>,
         <span style="color: #c586c0;">vec!</span>[],
         <span style="color: #ce9178;">"nil"</span>);
        (<span style="color: #ce9178;">";; Coment&#225;rio com tokens</span>
<span style="color: #ce9178;">          (+ 1 2)"</span>,
         <span style="color: #c586c0;">vec!</span>[<span style="color: #ce9178;">"("</span>, <span style="color: #ce9178;">"+"</span>, <span style="color: #ce9178;">"1"</span>, <span style="color: #ce9178;">"2"</span>, <span style="color: #ce9178;">")"</span>],
         <span style="color: #ce9178;">"((+ 1 2))"</span>);
        (<span style="color: #ce9178;">"(+ 1 2) ; Coment&#225;rio ao final"</span>,
         <span style="color: #c586c0;">vec!</span>[<span style="color: #ce9178;">"("</span>, <span style="color: #ce9178;">"+"</span>, <span style="color: #ce9178;">"1"</span>, <span style="color: #ce9178;">"2"</span>, <span style="color: #ce9178;">")"</span>],
        <span style="color: #ce9178;">"((+ 1 2))"</span>);
        (<span style="color: #ce9178;">"(+ 1 2) ; Coment&#225;rio ao final e continua</span>
<span style="color: #ce9178;">          (- 3 4)"</span>,
         <span style="color: #c586c0;">vec!</span>[<span style="color: #ce9178;">"("</span>, <span style="color: #ce9178;">"+"</span>, <span style="color: #ce9178;">"1"</span>, <span style="color: #ce9178;">"2"</span>, <span style="color: #ce9178;">")"</span>,
              <span style="color: #ce9178;">"("</span>, <span style="color: #ce9178;">"-"</span>, <span style="color: #ce9178;">"3"</span>, <span style="color: #ce9178;">"4"</span>, <span style="color: #ce9178;">")"</span>],
        <span style="color: #ce9178;">"((+ 1 2) (- 3 4))"</span>);
    );
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orgb4dc385" class="outline-4">
<h4 id="orgb4dc385"><span class="section-number-4">8.4.2.</span> Quote</h4>
<div class="outline-text-4" id="text-8-4-2">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #c586c0;">#[test]</span>
<span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">reader_quote</span>() {
    <span style="color: #569cd6;">let</span> <span style="color: #569cd6;">mut</span> <span style="color: #9cdcfe;">state</span> = <span style="color: #4ec9b0;">MajState</span>::new();
    <span style="color: #c586c0;">multi_parser_test!</span>(
        state;
        (<span style="color: #ce9178;">"'foo"</span>, <span style="color: #c586c0;">vec!</span>[<span style="color: #ce9178;">"'"</span>, <span style="color: #ce9178;">"foo"</span>], <span style="color: #ce9178;">"((quote foo))"</span>);
        (<span style="color: #ce9178;">"'a 'b 'c"</span>, <span style="color: #c586c0;">vec!</span>[<span style="color: #ce9178;">"'"</span>, <span style="color: #ce9178;">"a"</span>, <span style="color: #ce9178;">"'"</span>, <span style="color: #ce9178;">"b"</span>, <span style="color: #ce9178;">"'"</span>, <span style="color: #ce9178;">"c"</span>],
         <span style="color: #ce9178;">"((quote a) (quote b) (quote c))"</span>);
        (<span style="color: #ce9178;">"'a"</span>, <span style="color: #c586c0;">vec!</span>[<span style="color: #ce9178;">"'"</span>, <span style="color: #ce9178;">"a"</span>], <span style="color: #ce9178;">"((quote a))"</span>);
        (<span style="color: #ce9178;">"'(1 2 3)"</span>, <span style="color: #c586c0;">vec!</span>[<span style="color: #ce9178;">"'"</span>, <span style="color: #ce9178;">"("</span>, <span style="color: #ce9178;">"1"</span>, <span style="color: #ce9178;">"2"</span>, <span style="color: #ce9178;">"3"</span>, <span style="color: #ce9178;">")"</span>],
         <span style="color: #ce9178;">"((quote (1 2 3)))"</span>);
    );
}
</pre>
</div>
</div>
</div>
