10-testes.org
*** Quasiquote, Unquote, Unquote-Splice

#+begin_src rust
#[test]
fn reader_quasiquote_unquote_unquotesplice() {
    let mut state = MajState::new();
    multi_parser_test!(
        state;
        ("`(x)", vec!["`", "(", "x", ")"],
         "((quasiquote (x)))");
        ("`(+ ,x ,y)", vec!["`", "(", "+", ",", "x",
                            ",", "y", ")"],
         "((quasiquote (+ (unquote x) (unquote y))))");
        ("`,foo", vec!["`", ",", "foo"],
         "((quasiquote (unquote foo)))");
        ("`(,y ,@x)", vec!["`", "(", ",", "y", ",@", "x", ")"],
         "((quasiquote ((unquote y) (unquote-splice x))))");
    );
}
#+end_src

*** Sintaxe de vetores

#+begin_src rust
#[test]
fn reader_vector_syntax() {
    let mut state = MajState::new();
    multi_parser_test!(
        state;
        ("[]", vec!["[", "]"], "((vector))");
        ("[1 2 'a 3 (+ 2 5)]",
         vec!["[", "1", "2", "'", "a", "3",
              "(", "+", "2", "5", ")", "]"],
         "((vector 1 2 (quote a) 3 (+ 2 5)))");
    );
    multi_parser_fail_test!(
        state;
        "[']";
        "[1 2 3";
    );
}
#+end_src

* Interpretação
** Formas especiais
*** ~quote~

#+begin_src rust
#[test]
fn evaluator_quote() {
    let mut state = MajState::new();
    multi_eval_test!(
        state;
        ("(quote x)", "x");
        ("(quote (1 2 3))", "(1 2 3)");
        ("(quote (+ 5 6))", "(+ 5 6)");
    );
}
#+end_src

*** ~def~

#+begin_src rust
#[test]
fn evaluator_def() {
    let mut state = MajState::new();
    multi_eval_test!(
        state;
        ("(def x 5)", "x");
    );
    multi_eval_fail_test!(
        state;
        "(def (foo bar) 5)";
        "(def y (length x))";
    );
}
#+end_src

*** ~set~

#+begin_src rust
#[test]
fn evaluator_set() {
    let mut state = MajState::new();
    multi_eval_fail_test!(
        state;
        "(set x 5)";
    );
    multi_eval_test!(
        state;
        ("(def x 1)", "x");
        ("x", "1");
        ("(set x 5)", "x");
        ("x", "5");
        ("(let ((x 6)) x)", "6");
        ("(let ((x 6))
            (set x 9)
            x)",
         "9");
        ("x", "5");
    );
}
#+end_src

*** ~set-car~

#+begin_src rust
#[test]
fn evaluator_set_car() {
    let mut state = MajState::new();
    multi_eval_test!(
        state;
        ("(def x (quote (1 . 2)))", "x");
        ("(set-car x 3)", "(3 . 2)");
        ("(set-car (quote (9 . 0)) (quote f))",
         "(f . 0)");
        ("(let ((x (quote (4 . 5))))
            (set-car x 9))",
         "(9 . 5)");
        ("x", "(3 . 2)");
        ("(let ((a x))
            (set-car a 4))",
         "(4 . 2)");
        ("x", "(4 . 2)");
        ("(let ((a (copy x)))
            (set-car a 5))",
         "(5 . 2)");
        ("x", "(4 . 2)");
    );
}
#+end_src

*** ~set-cdr~

#+begin_src rust
#[test]
fn evaluator_set_cdr() {
    let mut state = MajState::new();
    multi_eval_test!(
        state;
        ("(def x (quote (1 . 2)))", "x");
        ("(set-cdr x 3)", "(1 . 3)");
        ("(set-cdr (quote (9 . 0)) (quote f))",
         "(9 . f)");
        ("(let ((x (quote (4 . 5))))
            (set-cdr x 9))",
         "(4 . 9)");
        ("x", "(1 . 3)");
        ("(let ((a x))
            (set-cdr a 4))",
         "(1 . 4)");
        ("x", "(1 . 4)");
        ("(let ((a (copy x)))
            (set-cdr a 5))",
         "(1 . 5)");
        ("x", "(1 . 4)");
    );
}
#+end_src

*** ~if~

#+begin_src rust
#[test]
fn evaluator_if() {
    let mut state = MajState::new();
    multi_eval_test!(
        state;
        ("(if (nilp (quote a))
              (quote is-nil)
              (quote is-not-nil))",
         "is-not-nil");
        ("(if (nilp nil)
              (quote is-nil)
              (quote is-not-nil))",
         "is-nil");
    );
}
#+end_src

