doc/html/10-testes.html

<div id="outline-container-orgd9edc17" class="outline-4">
<h4 id="orgd9edc17"><span class="section-number-4">8.4.3.</span> Quasiquote, Unquote, Unquote-Splice</h4>
<div class="outline-text-4" id="text-8-4-3">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #c586c0;">#[test]</span>
<span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">reader_quasiquote_unquote_unquotesplice</span>() {
    <span style="color: #569cd6;">let</span> <span style="color: #569cd6;">mut</span> <span style="color: #9cdcfe;">state</span> = <span style="color: #4ec9b0;">MajState</span>::new();
    <span style="color: #c586c0;">multi_parser_test!</span>(
        state;
        (<span style="color: #ce9178;">"`(x)"</span>, <span style="color: #c586c0;">vec!</span>[<span style="color: #ce9178;">"`"</span>, <span style="color: #ce9178;">"("</span>, <span style="color: #ce9178;">"x"</span>, <span style="color: #ce9178;">")"</span>],
         <span style="color: #ce9178;">"((quasiquote (x)))"</span>);
        (<span style="color: #ce9178;">"`(+ ,x ,y)"</span>, <span style="color: #c586c0;">vec!</span>[<span style="color: #ce9178;">"`"</span>, <span style="color: #ce9178;">"("</span>, <span style="color: #ce9178;">"+"</span>, <span style="color: #ce9178;">","</span>, <span style="color: #ce9178;">"x"</span>,
                            <span style="color: #ce9178;">","</span>, <span style="color: #ce9178;">"y"</span>, <span style="color: #ce9178;">")"</span>],
         <span style="color: #ce9178;">"((quasiquote (+ (unquote x) (unquote y))))"</span>);
        (<span style="color: #ce9178;">"`,foo"</span>, <span style="color: #c586c0;">vec!</span>[<span style="color: #ce9178;">"`"</span>, <span style="color: #ce9178;">","</span>, <span style="color: #ce9178;">"foo"</span>],
         <span style="color: #ce9178;">"((quasiquote (unquote foo)))"</span>);
        (<span style="color: #ce9178;">"`(,y ,@x)"</span>, <span style="color: #c586c0;">vec!</span>[<span style="color: #ce9178;">"`"</span>, <span style="color: #ce9178;">"("</span>, <span style="color: #ce9178;">","</span>, <span style="color: #ce9178;">"y"</span>, <span style="color: #ce9178;">",@"</span>, <span style="color: #ce9178;">"x"</span>, <span style="color: #ce9178;">")"</span>],
         <span style="color: #ce9178;">"((quasiquote ((unquote y) (unquote-splice x))))"</span>);
    );
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org7ac8d3e" class="outline-4">
<h4 id="org7ac8d3e"><span class="section-number-4">8.4.4.</span> Sintaxe de vetores</h4>
<div class="outline-text-4" id="text-8-4-4">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #c586c0;">#[test]</span>
<span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">reader_vector_syntax</span>() {
    <span style="color: #569cd6;">let</span> <span style="color: #569cd6;">mut</span> <span style="color: #9cdcfe;">state</span> = <span style="color: #4ec9b0;">MajState</span>::new();
    <span style="color: #c586c0;">multi_parser_test!</span>(
        state;
        (<span style="color: #ce9178;">"[]"</span>, <span style="color: #c586c0;">vec!</span>[<span style="color: #ce9178;">"["</span>, <span style="color: #ce9178;">"]"</span>], <span style="color: #ce9178;">"((vector))"</span>);
        (<span style="color: #ce9178;">"[1 2 'a 3 (+ 2 5)]"</span>,
         <span style="color: #c586c0;">vec!</span>[<span style="color: #ce9178;">"["</span>, <span style="color: #ce9178;">"1"</span>, <span style="color: #ce9178;">"2"</span>, <span style="color: #ce9178;">"'"</span>, <span style="color: #ce9178;">"a"</span>, <span style="color: #ce9178;">"3"</span>,
              <span style="color: #ce9178;">"("</span>, <span style="color: #ce9178;">"+"</span>, <span style="color: #ce9178;">"2"</span>, <span style="color: #ce9178;">"5"</span>, <span style="color: #ce9178;">")"</span>, <span style="color: #ce9178;">"]"</span>],
         <span style="color: #ce9178;">"((vector 1 2 (quote a) 3 (+ 2 5)))"</span>);
    );
    <span style="color: #c586c0;">multi_parser_fail_test!</span>(
        state;
        <span style="color: #ce9178;">"[']"</span>;
        <span style="color: #ce9178;">"[1 2 3"</span>;
    );
}
</pre>
</div>
</div>
</div>
</div>
</div>

<div id="outline-container-orgc44bf65" class="outline-2">
<h2 id="orgc44bf65"><span class="section-number-2">9.</span> Interpretação</h2>
<div class="outline-text-2" id="text-9">
</div>
<div id="outline-container-orgbcf2e8c" class="outline-3">
<h3 id="orgbcf2e8c"><span class="section-number-3">9.1.</span> Formas especiais</h3>
<div class="outline-text-3" id="text-9-1">
</div>
<div id="outline-container-orgea2ea66" class="outline-4">
<h4 id="orgea2ea66"><span class="section-number-4">9.1.1.</span> <code>quote</code></h4>
<div class="outline-text-4" id="text-9-1-1">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #c586c0;">#[test]</span>
<span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">evaluator_quote</span>() {
    <span style="color: #569cd6;">let</span> <span style="color: #569cd6;">mut</span> <span style="color: #9cdcfe;">state</span> = <span style="color: #4ec9b0;">MajState</span>::new();
    <span style="color: #c586c0;">multi_eval_test!</span>(
        state;
        (<span style="color: #ce9178;">"(quote x)"</span>, <span style="color: #ce9178;">"x"</span>);
        (<span style="color: #ce9178;">"(quote (1 2 3))"</span>, <span style="color: #ce9178;">"(1 2 3)"</span>);
        (<span style="color: #ce9178;">"(quote (+ 5 6))"</span>, <span style="color: #ce9178;">"(+ 5 6)"</span>);
    );
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org9a35422" class="outline-4">
<h4 id="org9a35422"><span class="section-number-4">9.1.2.</span> <code>def</code></h4>
<div class="outline-text-4" id="text-9-1-2">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #c586c0;">#[test]</span>
<span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">evaluator_def</span>() {
    <span style="color: #569cd6;">let</span> <span style="color: #569cd6;">mut</span> <span style="color: #9cdcfe;">state</span> = <span style="color: #4ec9b0;">MajState</span>::new();
    <span style="color: #c586c0;">multi_eval_test!</span>(
        state;
        (<span style="color: #ce9178;">"(def x 5)"</span>, <span style="color: #ce9178;">"x"</span>);
    );
    <span style="color: #c586c0;">multi_eval_fail_test!</span>(
        state;
        <span style="color: #ce9178;">"(def (foo bar) 5)"</span>;
        <span style="color: #ce9178;">"(def y (length x))"</span>;
    );
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orga4d9c88" class="outline-4">
<h4 id="orga4d9c88"><span class="section-number-4">9.1.3.</span> <code>set</code></h4>
<div class="outline-text-4" id="text-9-1-3">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #c586c0;">#[test]</span>
<span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">evaluator_set</span>() {
    <span style="color: #569cd6;">let</span> <span style="color: #569cd6;">mut</span> <span style="color: #9cdcfe;">state</span> = <span style="color: #4ec9b0;">MajState</span>::new();
    <span style="color: #c586c0;">multi_eval_fail_test!</span>(
        state;
        <span style="color: #ce9178;">"(set x 5)"</span>;
    );
    <span style="color: #c586c0;">multi_eval_test!</span>(
        state;
        (<span style="color: #ce9178;">"(def x 1)"</span>, <span style="color: #ce9178;">"x"</span>);
        (<span style="color: #ce9178;">"x"</span>, <span style="color: #ce9178;">"1"</span>);
        (<span style="color: #ce9178;">"(set x 5)"</span>, <span style="color: #ce9178;">"x"</span>);
        (<span style="color: #ce9178;">"x"</span>, <span style="color: #ce9178;">"5"</span>);
        (<span style="color: #ce9178;">"(let ((x 6)) x)"</span>, <span style="color: #ce9178;">"6"</span>);
        (<span style="color: #ce9178;">"(let ((x 6))</span>
<span style="color: #ce9178;">            (set x 9)</span>
<span style="color: #ce9178;">            x)"</span>,
         <span style="color: #ce9178;">"9"</span>);
        (<span style="color: #ce9178;">"x"</span>, <span style="color: #ce9178;">"5"</span>);
    );
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org1857ba6" class="outline-4">
<h4 id="org1857ba6"><span class="section-number-4">9.1.4.</span> <code>set-car</code></h4>
<div class="outline-text-4" id="text-9-1-4">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #c586c0;">#[test]</span>
<span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">evaluator_set_car</span>() {
    <span style="color: #569cd6;">let</span> <span style="color: #569cd6;">mut</span> <span style="color: #9cdcfe;">state</span> = <span style="color: #4ec9b0;">MajState</span>::new();
    <span style="color: #c586c0;">multi_eval_test!</span>(
        state;
        (<span style="color: #ce9178;">"(def x (quote (1 . 2)))"</span>, <span style="color: #ce9178;">"x"</span>);
        (<span style="color: #ce9178;">"(set-car x 3)"</span>, <span style="color: #ce9178;">"(3 . 2)"</span>);
        (<span style="color: #ce9178;">"(set-car (quote (9 . 0)) (quote f))"</span>,
         <span style="color: #ce9178;">"(f . 0)"</span>);
        (<span style="color: #ce9178;">"(let ((x (quote (4 . 5))))</span>
<span style="color: #ce9178;">            (set-car x 9))"</span>,
         <span style="color: #ce9178;">"(9 . 5)"</span>);
        (<span style="color: #ce9178;">"x"</span>, <span style="color: #ce9178;">"(3 . 2)"</span>);
        (<span style="color: #ce9178;">"(let ((a x))</span>
<span style="color: #ce9178;">            (set-car a 4))"</span>,
         <span style="color: #ce9178;">"(4 . 2)"</span>);
        (<span style="color: #ce9178;">"x"</span>, <span style="color: #ce9178;">"(4 . 2)"</span>);
        (<span style="color: #ce9178;">"(let ((a (copy x)))</span>
<span style="color: #ce9178;">            (set-car a 5))"</span>,
         <span style="color: #ce9178;">"(5 . 2)"</span>);
        (<span style="color: #ce9178;">"x"</span>, <span style="color: #ce9178;">"(4 . 2)"</span>);
    );
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orge57ca30" class="outline-4">
<h4 id="orge57ca30"><span class="section-number-4">9.1.5.</span> <code>set-cdr</code></h4>
<div class="outline-text-4" id="text-9-1-5">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #c586c0;">#[test]</span>
<span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">evaluator_set_cdr</span>() {
    <span style="color: #569cd6;">let</span> <span style="color: #569cd6;">mut</span> <span style="color: #9cdcfe;">state</span> = <span style="color: #4ec9b0;">MajState</span>::new();
    <span style="color: #c586c0;">multi_eval_test!</span>(
        state;
        (<span style="color: #ce9178;">"(def x (quote (1 . 2)))"</span>, <span style="color: #ce9178;">"x"</span>);
        (<span style="color: #ce9178;">"(set-cdr x 3)"</span>, <span style="color: #ce9178;">"(1 . 3)"</span>);
        (<span style="color: #ce9178;">"(set-cdr (quote (9 . 0)) (quote f))"</span>,
         <span style="color: #ce9178;">"(9 . f)"</span>);
        (<span style="color: #ce9178;">"(let ((x (quote (4 . 5))))</span>
<span style="color: #ce9178;">            (set-cdr x 9))"</span>,
         <span style="color: #ce9178;">"(4 . 9)"</span>);
        (<span style="color: #ce9178;">"x"</span>, <span style="color: #ce9178;">"(1 . 3)"</span>);
        (<span style="color: #ce9178;">"(let ((a x))</span>
<span style="color: #ce9178;">            (set-cdr a 4))"</span>,
         <span style="color: #ce9178;">"(1 . 4)"</span>);
        (<span style="color: #ce9178;">"x"</span>, <span style="color: #ce9178;">"(1 . 4)"</span>);
        (<span style="color: #ce9178;">"(let ((a (copy x)))</span>
<span style="color: #ce9178;">            (set-cdr a 5))"</span>,
         <span style="color: #ce9178;">"(1 . 5)"</span>);
        (<span style="color: #ce9178;">"x"</span>, <span style="color: #ce9178;">"(1 . 4)"</span>);
    );
}
</pre>
</div>
</div>
</div>
