10-testes.org
*** ~fn~

#+begin_src rust
#[test]
fn evaluator_fn() {
    let mut state = MajState::new();
    multi_eval_test!(
        state;
        ("(fn (x) (* x x))",
         "(lit closure nil (x) ((* x x)))");
        ("(fn (x . rest) (list x rest))",
         "(lit closure nil (x . rest) ((list x rest)))");
        ("((fn (x) (* x x)) 5)",
         "25");
        ("(def square (fn (x) (* x x)))",
         "square");
        ("(square 5)", "25");
    );
}
#+end_src

*** ~mac~

#+begin_src rust
#[test]
fn evaluator_mac() {
    let mut state = MajState::new();
    multi_eval_test!(
        state;
        ("(mac (x) (quasiquote (list (unquote x))))",
         "(lit macro (lit closure nil (x) ((quasiquote (list (unquote x))))))");
        ("((mac (x) (quasiquote (list (unquote x)))) 5)",
         "(5)");
        ("(def encapsulate
            (mac (x) (quasiquote (list (unquote x)))))",
         "encapsulate");
        ("(macroexpand-1 (quote (encapsulate 5)))",
         "(list 5)");
        ("(encapsulate 5)", "(5)");
    );
}
#+end_src

*** ~quasiquote~ / ~unquote~ / ~unquote-splice~

#+begin_src rust
#[test]
fn evaluator_quasiquote_unquote_unquote_splice() {
    let mut state = MajState::new();
    multi_eval_test!(
        state;
        ("(quasiquote a)", "a");
        ("(let ((x 5)  (y 6))
            (quasiquote (1 (unquote x) (unquote y))))",
         "(1 5 6)");
        ("(let ((lst (list 1 2 3)))
            (quasiquote (0 (unquote lst))))",
         "(0 (1 2 3))");
        ("(let ((lst (list 1 2 3)))
            (quasiquote (0 (unquote-splice lst))))",
         "(0 1 2 3)");
    );
}
#+end_src

*** ~do~

#+begin_src rust
#[test]
fn evaluator_do() {
    let mut state = MajState::new();
    multi_eval_test!(
        state;
        ("(do (quote a)
              (quote b)
              (list (quote c)
                    (quote d)
                    (quote e)))",
         "(c d e)");
        ("(do)", "nil");
    );
}
#+end_src

*** TODO ~apply~

#+begin_src rust
#[test]
#[ignore]
fn evaluator_apply() {
    unimplemented!();
}
#+end_src

*** ~while~

#+begin_src rust
#[test]
fn evaluator_while() {
    let mut state = MajState::new();
    multi_eval_test!(
        state;
        ("(let ((x 0)  (lst nil))
            (while (< x 5)
              (set lst (cons x lst))
              (set x (1+ x)))
            (list x lst))",
         "(5 (4 3 2 1 0))");
        ("(let ((lst (quote (1 2 3 4 5)))
                (result nil))
            (while (not (nilp lst))
              (let (((num . rest) lst))
                (set result
                     (cons (= 2 num) result))
                (set lst rest)))
            result)",
         "(nil nil nil t nil)");
    );
    multi_eval_fail_test!(
        state;
        "(let ((lst (quote (1 2 3 a 5))))
           (while (not (nilp lst))
             (let (((num . rest) lst))
               (= 2 num))
             (set lst rest)))";
        "(let ((lst (quote (1 2 3 NaN 5))))
           (while (not (nilp lst))
             (let (((num . rest) lst))
               (= 2 num))
             (set lst rest)))";
    );
}
#+end_src

*** ~and~

#+begin_src rust
#[test]
fn evaluator_and() {
    let mut state = MajState::new();
    multi_eval_test!(
        state;
        ("(and (= 1 1) (= 0.5 1/2) (quote ok))",
         "ok");
        ("(and (= 1 1) (< 0.5 1/2) (quote ok))",
         "nil");
        ("(and)", "t");
    );
}
#+end_src

*** ~or~

#+begin_src rust
#[test]
fn evaluator_or() {
    let mut state = MajState::new();
    multi_eval_test!(
        state;
        ("(or (not (= 1 1))
              (< 0.5 1/2)
              (quote ok))",
         "ok");
        ("(or (= 1 1) (< 0.5 1/2))",
         "t");
        ("(or)", "nil");
    );
}
#+end_src

