doc/html/10-testes.html

<div id="outline-container-org246ccf9" class="outline-4">
<h4 id="org246ccf9"><span class="section-number-4">9.1.6.</span> <code>if</code></h4>
<div class="outline-text-4" id="text-9-1-6">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #c586c0;">#[test]</span>
<span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">evaluator_if</span>() {
    <span style="color: #569cd6;">let</span> <span style="color: #569cd6;">mut</span> <span style="color: #9cdcfe;">state</span> = <span style="color: #4ec9b0;">MajState</span>::new();
    <span style="color: #c586c0;">multi_eval_test!</span>(
        state;
        (<span style="color: #ce9178;">"(if (nilp (quote a))</span>
<span style="color: #ce9178;">              (quote is-nil)</span>
<span style="color: #ce9178;">              (quote is-not-nil))"</span>,
         <span style="color: #ce9178;">"is-not-nil"</span>);
        (<span style="color: #ce9178;">"(if (nilp nil)</span>
<span style="color: #ce9178;">              (quote is-nil)</span>
<span style="color: #ce9178;">              (quote is-not-nil))"</span>,
         <span style="color: #ce9178;">"is-nil"</span>);
    );
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org8037630" class="outline-4">
<h4 id="org8037630"><span class="section-number-4">9.1.7.</span> <code>fn</code></h4>
<div class="outline-text-4" id="text-9-1-7">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #c586c0;">#[test]</span>
<span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">evaluator_fn</span>() {
    <span style="color: #569cd6;">let</span> <span style="color: #569cd6;">mut</span> <span style="color: #9cdcfe;">state</span> = <span style="color: #4ec9b0;">MajState</span>::new();
    <span style="color: #c586c0;">multi_eval_test!</span>(
        state;
        (<span style="color: #ce9178;">"(fn (x) (* x x))"</span>,
         <span style="color: #ce9178;">"(lit closure nil (x) ((* x x)))"</span>);
        (<span style="color: #ce9178;">"(fn (x . rest) (list x rest))"</span>,
         <span style="color: #ce9178;">"(lit closure nil (x . rest) ((list x rest)))"</span>);
        (<span style="color: #ce9178;">"((fn (x) (* x x)) 5)"</span>,
         <span style="color: #ce9178;">"25"</span>);
        (<span style="color: #ce9178;">"(def square (fn (x) (* x x)))"</span>,
         <span style="color: #ce9178;">"square"</span>);
        (<span style="color: #ce9178;">"(square 5)"</span>, <span style="color: #ce9178;">"25"</span>);
    );
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org61f9496" class="outline-4">
<h4 id="org61f9496"><span class="section-number-4">9.1.8.</span> <code>mac</code></h4>
<div class="outline-text-4" id="text-9-1-8">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #c586c0;">#[test]</span>
<span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">evaluator_mac</span>() {
    <span style="color: #569cd6;">let</span> <span style="color: #569cd6;">mut</span> <span style="color: #9cdcfe;">state</span> = <span style="color: #4ec9b0;">MajState</span>::new();
    <span style="color: #c586c0;">multi_eval_test!</span>(
        state;
        (<span style="color: #ce9178;">"(mac (x) (quasiquote (list (unquote x))))"</span>,
         <span style="color: #ce9178;">"(lit macro (lit closure nil (x) ((quasiquote (list (unquote x))))))"</span>);
        (<span style="color: #ce9178;">"((mac (x) (quasiquote (list (unquote x)))) 5)"</span>,
         <span style="color: #ce9178;">"(5)"</span>);
        (<span style="color: #ce9178;">"(def encapsulate</span>
<span style="color: #ce9178;">            (mac (x) (quasiquote (list (unquote x)))))"</span>,
         <span style="color: #ce9178;">"encapsulate"</span>);
        (<span style="color: #ce9178;">"(macroexpand-1 (quote (encapsulate 5)))"</span>,
         <span style="color: #ce9178;">"(list 5)"</span>);
        (<span style="color: #ce9178;">"(encapsulate 5)"</span>, <span style="color: #ce9178;">"(5)"</span>);
    );
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org8d20048" class="outline-4">
<h4 id="org8d20048"><span class="section-number-4">9.1.9.</span> <code>quasiquote</code> / <code>unquote</code> / <code>unquote-splice</code></h4>
<div class="outline-text-4" id="text-9-1-9">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #c586c0;">#[test]</span>
<span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">evaluator_quasiquote_unquote_unquote_splice</span>() {
    <span style="color: #569cd6;">let</span> <span style="color: #569cd6;">mut</span> <span style="color: #9cdcfe;">state</span> = <span style="color: #4ec9b0;">MajState</span>::new();
    <span style="color: #c586c0;">multi_eval_test!</span>(
        state;
        (<span style="color: #ce9178;">"(quasiquote a)"</span>, <span style="color: #ce9178;">"a"</span>);
        (<span style="color: #ce9178;">"(let ((x 5)  (y 6))</span>
<span style="color: #ce9178;">            (quasiquote (1 (unquote x) (unquote y))))"</span>,
         <span style="color: #ce9178;">"(1 5 6)"</span>);
        (<span style="color: #ce9178;">"(let ((lst (list 1 2 3)))</span>
<span style="color: #ce9178;">            (quasiquote (0 (unquote lst))))"</span>,
         <span style="color: #ce9178;">"(0 (1 2 3))"</span>);
        (<span style="color: #ce9178;">"(let ((lst (list 1 2 3)))</span>
<span style="color: #ce9178;">            (quasiquote (0 (unquote-splice lst))))"</span>,
         <span style="color: #ce9178;">"(0 1 2 3)"</span>);
    );
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orgb2df67e" class="outline-4">
<h4 id="orgb2df67e"><span class="section-number-4">9.1.10.</span> <code>do</code></h4>
<div class="outline-text-4" id="text-9-1-10">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #c586c0;">#[test]</span>
<span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">evaluator_do</span>() {
    <span style="color: #569cd6;">let</span> <span style="color: #569cd6;">mut</span> <span style="color: #9cdcfe;">state</span> = <span style="color: #4ec9b0;">MajState</span>::new();
    <span style="color: #c586c0;">multi_eval_test!</span>(
        state;
        (<span style="color: #ce9178;">"(do (quote a)</span>
<span style="color: #ce9178;">              (quote b)</span>
<span style="color: #ce9178;">              (list (quote c)</span>
<span style="color: #ce9178;">                    (quote d)</span>
<span style="color: #ce9178;">                    (quote e)))"</span>,
         <span style="color: #ce9178;">"(c d e)"</span>);
        (<span style="color: #ce9178;">"(do)"</span>, <span style="color: #ce9178;">"nil"</span>);
    );
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orgce2add8" class="outline-4">
<h4 id="orgce2add8"><span class="section-number-4">9.1.11.</span> <span class="todo TODO">TODO</span> <code>apply</code></h4>
<div class="outline-text-4" id="text-9-1-11">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #c586c0;">#[test]</span>
<span style="color: #c586c0;">#[ignore]</span>
<span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">evaluator_apply</span>() {
    <span style="color: #c586c0;">unimplemented!</span>();
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org782741f" class="outline-4">
<h4 id="org782741f"><span class="section-number-4">9.1.12.</span> <code>while</code></h4>
<div class="outline-text-4" id="text-9-1-12">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #c586c0;">#[test]</span>
<span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">evaluator_while</span>() {
    <span style="color: #569cd6;">let</span> <span style="color: #569cd6;">mut</span> <span style="color: #9cdcfe;">state</span> = <span style="color: #4ec9b0;">MajState</span>::new();
    <span style="color: #c586c0;">multi_eval_test!</span>(
        state;
        (<span style="color: #ce9178;">"(let ((x 0)  (lst nil))</span>
<span style="color: #ce9178;">            (while (&lt; x 5)</span>
<span style="color: #ce9178;">              (set lst (cons x lst))</span>
<span style="color: #ce9178;">              (set x (1+ x)))</span>
<span style="color: #ce9178;">            (list x lst))"</span>,
         <span style="color: #ce9178;">"(5 (4 3 2 1 0))"</span>);
        (<span style="color: #ce9178;">"(let ((lst (quote (1 2 3 4 5)))</span>
<span style="color: #ce9178;">                (result nil))</span>
<span style="color: #ce9178;">            (while (not (nilp lst))</span>
<span style="color: #ce9178;">              (let (((num . rest) lst))</span>
<span style="color: #ce9178;">                (set result</span>
<span style="color: #ce9178;">                     (cons (= 2 num) result))</span>
<span style="color: #ce9178;">                (set lst rest)))</span>
<span style="color: #ce9178;">            result)"</span>,
         <span style="color: #ce9178;">"(nil nil nil t nil)"</span>);
    );
    <span style="color: #c586c0;">multi_eval_fail_test!</span>(
        state;
        <span style="color: #ce9178;">"(let ((lst (quote (1 2 3 a 5))))</span>
<span style="color: #ce9178;">           (while (not (nilp lst))</span>
<span style="color: #ce9178;">             (let (((num . rest) lst))</span>
<span style="color: #ce9178;">               (= 2 num))</span>
<span style="color: #ce9178;">             (set lst rest)))"</span>;
        <span style="color: #ce9178;">"(let ((lst (quote (1 2 3 NaN 5))))</span>
<span style="color: #ce9178;">           (while (not (nilp lst))</span>
<span style="color: #ce9178;">             (let (((num . rest) lst))</span>
<span style="color: #ce9178;">               (= 2 num))</span>
<span style="color: #ce9178;">             (set lst rest)))"</span>;
    );
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orgbd3caa8" class="outline-4">
<h4 id="orgbd3caa8"><span class="section-number-4">9.1.13.</span> <code>and</code></h4>
<div class="outline-text-4" id="text-9-1-13">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #c586c0;">#[test]</span>
<span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">evaluator_and</span>() {
    <span style="color: #569cd6;">let</span> <span style="color: #569cd6;">mut</span> <span style="color: #9cdcfe;">state</span> = <span style="color: #4ec9b0;">MajState</span>::new();
    <span style="color: #c586c0;">multi_eval_test!</span>(
        state;
        (<span style="color: #ce9178;">"(and (= 1 1) (= 0.5 1/2) (quote ok))"</span>,
         <span style="color: #ce9178;">"ok"</span>);
        (<span style="color: #ce9178;">"(and (= 1 1) (&lt; 0.5 1/2) (quote ok))"</span>,
         <span style="color: #ce9178;">"nil"</span>);
        (<span style="color: #ce9178;">"(and)"</span>, <span style="color: #ce9178;">"t"</span>);
    );
}
</pre>
</div>
</div>
</div>
