10-testes.org
*** ~letrec~

#+begin_src rust
#[test]
fn evaluator_letrec() {
    let mut state = MajState::new();
    multi_eval_test!(
        state;
        ("(let ((results nil))
            (letrec ((foo ()
                       (set results
                         (cons (quote foo) results))
                       (bar))
                     (bar ()
                       (set results
                         (cons (quote bar) results))
                       (baz))
                     (baz ()
                       (set results
                         (cons (quote baz) results))
                       results))
              (foo)))",
         "(baz bar foo)");
        ("(letrec ((iter (x)
                     (if (> x 0)
                       (iter (1- x))
                       (quote finished))))
            (iter 5))",
         "finished");
        ("(def my-function
               (letrec ((foo () (bar))
                        (bar () (quote hello-from-bar)))
                 foo))",
         "my-function");
        ("(my-function)", "hello-from-bar");
    );
}
#+end_src

*** ~unwind-protect~

#+begin_src rust
#[test]
fn evaluator_unwind_protect() {
    let mut state = MajState::new();
    multi_eval_test!(
        state;
        ("(def *my-stream* nil)", "*my-stream*");
        ("(unwind-protect
              (do (set *my-stream*
                       (open-stream 'in
                                    \"test-streams-in.txt\"))
                  (read-char *my-stream*))
            (do (close-stream *my-stream*)
                (set *my-stream* nil)))",
         "#\\H");
        ("*my-stream*", "nil");
        ("(and (set *my-stream*
                  (open-stream 'out \"test-streams-out.txt\"))
               t)",
         "t");
    );
    multi_eval_fail_test!(
        state;
        "(unwind-protect (read-char *my-stream*)
           (do (close-stream *my-stream*)
               (set *my-stream* nil)))";
             
    );
    multi_eval_test!(
        state;
        ("*my-stream*", "nil");
    );
}
#+end_src

** Aplicação de clausuras
*** TODO Aplicação comum

#+begin_src rust
#[test]
#[ignore]
fn evaluator_closure_application_default() {
    unimplemented!();
}
#+end_src

*** TODO Aplicação parcial

#+begin_src rust
#[test]
#[ignore]
fn evaluator_closure_application_partial() {
    unimplemented!();
}
#+end_src

*** TODO Argumentos opcionais

#+begin_src rust
#[test]
#[ignore]
fn evaluator_closure_application_optional_args() {
    unimplemented!();
}
#+end_src

*** TODO Aplicação parcial forçada

#+begin_src rust
#[test]
#[ignore]
fn evaluator_closure_application_forced() {
    unimplemented!();
}
#+end_src

** Bootstrap
*** Constantes

#+begin_src rust
#[test]
fn evaluator_bootstrap_constants() {
    let mut state = MajState::new();
    multi_eval_test!(
        state;
        ("(type *stdin*)", "stream");
        ("(type *stdout*)", "stream");
        ("*ulps*", "3");
    );
}
#+end_src

*** ~map~ e ~mapc~

#+begin_src rust
#[test]
fn evaluator_bootstrap_map_mapc() {
    let mut state = MajState::new();
    multi_eval_test!(
        state;
        ("(map (fn (x) (* x x))
               (quote (1 2 3 4 5)))",
         "(1 4 9 16 25)");
        ("(map (fn (x) (* x x))
               (quote (1 2 3 4 . 5)))",
         "(1 4 9 16)");
        ("(mapc (fn (x) (* x x))
                (quote (1 2 3 4 5)))",
         "nil");
        ("(let ((results nil))
            (mapc (fn (x)
                    (set results
                         (cons (* x x) results)))
                  (quote (1 2 3 4 5)))
            results)",
         "(25 16 9 4 1)");
    );
}
#+end_src

