doc/html/10-testes.html

<div id="outline-container-orgf96d703" class="outline-4">
<h4 id="orgf96d703"><span class="section-number-4">9.1.14.</span> <code>or</code></h4>
<div class="outline-text-4" id="text-9-1-14">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #c586c0;">#[test]</span>
<span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">evaluator_or</span>() {
    <span style="color: #569cd6;">let</span> <span style="color: #569cd6;">mut</span> <span style="color: #9cdcfe;">state</span> = <span style="color: #4ec9b0;">MajState</span>::new();
    <span style="color: #c586c0;">multi_eval_test!</span>(
        state;
        (<span style="color: #ce9178;">"(or (not (= 1 1))</span>
<span style="color: #ce9178;">              (&lt; 0.5 1/2)</span>
<span style="color: #ce9178;">              (quote ok))"</span>,
         <span style="color: #ce9178;">"ok"</span>);
        (<span style="color: #ce9178;">"(or (= 1 1) (&lt; 0.5 1/2))"</span>,
         <span style="color: #ce9178;">"t"</span>);
        (<span style="color: #ce9178;">"(or)"</span>, <span style="color: #ce9178;">"nil"</span>);
    );
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org298a089" class="outline-4">
<h4 id="org298a089"><span class="section-number-4">9.1.15.</span> <code>letrec</code></h4>
<div class="outline-text-4" id="text-9-1-15">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #c586c0;">#[test]</span>
<span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">evaluator_letrec</span>() {
    <span style="color: #569cd6;">let</span> <span style="color: #569cd6;">mut</span> <span style="color: #9cdcfe;">state</span> = <span style="color: #4ec9b0;">MajState</span>::new();
    <span style="color: #c586c0;">multi_eval_test!</span>(
        state;
        (<span style="color: #ce9178;">"(let ((results nil))</span>
<span style="color: #ce9178;">            (letrec ((foo ()</span>
<span style="color: #ce9178;">                       (set results</span>
<span style="color: #ce9178;">                         (cons (quote foo) results))</span>
<span style="color: #ce9178;">                       (bar))</span>
<span style="color: #ce9178;">                     (bar ()</span>
<span style="color: #ce9178;">                       (set results</span>
<span style="color: #ce9178;">                         (cons (quote bar) results))</span>
<span style="color: #ce9178;">                       (baz))</span>
<span style="color: #ce9178;">                     (baz ()</span>
<span style="color: #ce9178;">                       (set results</span>
<span style="color: #ce9178;">                         (cons (quote baz) results))</span>
<span style="color: #ce9178;">                       results))</span>
<span style="color: #ce9178;">              (foo)))"</span>,
         <span style="color: #ce9178;">"(baz bar foo)"</span>);
        (<span style="color: #ce9178;">"(letrec ((iter (x)</span>
<span style="color: #ce9178;">                     (if (&gt; x 0)</span>
<span style="color: #ce9178;">                       (iter (1- x))</span>
<span style="color: #ce9178;">                       (quote finished))))</span>
<span style="color: #ce9178;">            (iter 5))"</span>,
         <span style="color: #ce9178;">"finished"</span>);
        (<span style="color: #ce9178;">"(def my-function</span>
<span style="color: #ce9178;">               (letrec ((foo () (bar))</span>
<span style="color: #ce9178;">                        (bar () (quote hello-from-bar)))</span>
<span style="color: #ce9178;">                 foo))"</span>,
         <span style="color: #ce9178;">"my-function"</span>);
        (<span style="color: #ce9178;">"(my-function)"</span>, <span style="color: #ce9178;">"hello-from-bar"</span>);
    );
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orgaf59507" class="outline-4">
<h4 id="orgaf59507"><span class="section-number-4">9.1.16.</span> <code>unwind-protect</code></h4>
<div class="outline-text-4" id="text-9-1-16">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #c586c0;">#[test]</span>
<span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">evaluator_unwind_protect</span>() {
    <span style="color: #569cd6;">let</span> <span style="color: #569cd6;">mut</span> <span style="color: #9cdcfe;">state</span> = <span style="color: #4ec9b0;">MajState</span>::new();
    <span style="color: #c586c0;">multi_eval_test!</span>(
        state;
        (<span style="color: #ce9178;">"(def *my-stream* nil)"</span>, <span style="color: #ce9178;">"*my-stream*"</span>);
        (<span style="color: #ce9178;">"(unwind-protect</span>
<span style="color: #ce9178;">              (do (set *my-stream*</span>
<span style="color: #ce9178;">                       (open-stream 'in</span>
<span style="color: #ce9178;">                                    \"test-streams-in.txt\"))</span>
<span style="color: #ce9178;">                  (read-char *my-stream*))</span>
<span style="color: #ce9178;">            (do (close-stream *my-stream*)</span>
<span style="color: #ce9178;">                (set *my-stream* nil)))"</span>,
         <span style="color: #ce9178;">"#\\H"</span>);
        (<span style="color: #ce9178;">"*my-stream*"</span>, <span style="color: #ce9178;">"nil"</span>);
        (<span style="color: #ce9178;">"(and (set *my-stream*</span>
<span style="color: #ce9178;">                  (open-stream 'out \"test-streams-out.txt\"))</span>
<span style="color: #ce9178;">               t)"</span>,
         <span style="color: #ce9178;">"t"</span>);
    );
    <span style="color: #c586c0;">multi_eval_fail_test!</span>(
        state;
        <span style="color: #ce9178;">"(unwind-protect (read-char *my-stream*)</span>
<span style="color: #ce9178;">           (do (close-stream *my-stream*)</span>
<span style="color: #ce9178;">               (set *my-stream* nil)))"</span>;
             
    );
    <span style="color: #c586c0;">multi_eval_test!</span>(
        state;
        (<span style="color: #ce9178;">"*my-stream*"</span>, <span style="color: #ce9178;">"nil"</span>);
    );
}
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgc8cd561" class="outline-3">
<h3 id="orgc8cd561"><span class="section-number-3">9.2.</span> Aplicação de clausuras</h3>
<div class="outline-text-3" id="text-9-2">
</div>
<div id="outline-container-orgb72b87d" class="outline-4">
<h4 id="orgb72b87d"><span class="section-number-4">9.2.1.</span> <span class="todo TODO">TODO</span> Aplicação comum</h4>
<div class="outline-text-4" id="text-9-2-1">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #c586c0;">#[test]</span>
<span style="color: #c586c0;">#[ignore]</span>
<span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">evaluator_closure_application_default</span>() {
    <span style="color: #c586c0;">unimplemented!</span>();
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org04ccaa8" class="outline-4">
<h4 id="org04ccaa8"><span class="section-number-4">9.2.2.</span> <span class="todo TODO">TODO</span> Aplicação parcial</h4>
<div class="outline-text-4" id="text-9-2-2">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #c586c0;">#[test]</span>
<span style="color: #c586c0;">#[ignore]</span>
<span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">evaluator_closure_application_partial</span>() {
    <span style="color: #c586c0;">unimplemented!</span>();
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orgb4ebb83" class="outline-4">
<h4 id="orgb4ebb83"><span class="section-number-4">9.2.3.</span> <span class="todo TODO">TODO</span> Argumentos opcionais</h4>
<div class="outline-text-4" id="text-9-2-3">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #c586c0;">#[test]</span>
<span style="color: #c586c0;">#[ignore]</span>
<span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">evaluator_closure_application_optional_args</span>() {
    <span style="color: #c586c0;">unimplemented!</span>();
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orgf4c84c1" class="outline-4">
<h4 id="orgf4c84c1"><span class="section-number-4">9.2.4.</span> <span class="todo TODO">TODO</span> Aplicação parcial forçada</h4>
<div class="outline-text-4" id="text-9-2-4">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #c586c0;">#[test]</span>
<span style="color: #c586c0;">#[ignore]</span>
<span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">evaluator_closure_application_forced</span>() {
    <span style="color: #c586c0;">unimplemented!</span>();
}
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orga6676e7" class="outline-3">
<h3 id="orga6676e7"><span class="section-number-3">9.3.</span> Bootstrap</h3>
<div class="outline-text-3" id="text-9-3">
</div>
<div id="outline-container-org3399466" class="outline-4">
<h4 id="org3399466"><span class="section-number-4">9.3.1.</span> Constantes</h4>
<div class="outline-text-4" id="text-9-3-1">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #c586c0;">#[test]</span>
<span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">evaluator_bootstrap_constants</span>() {
    <span style="color: #569cd6;">let</span> <span style="color: #569cd6;">mut</span> <span style="color: #9cdcfe;">state</span> = <span style="color: #4ec9b0;">MajState</span>::new();
    <span style="color: #c586c0;">multi_eval_test!</span>(
        state;
        (<span style="color: #ce9178;">"(type *stdin*)"</span>, <span style="color: #ce9178;">"stream"</span>);
        (<span style="color: #ce9178;">"(type *stdout*)"</span>, <span style="color: #ce9178;">"stream"</span>);
        (<span style="color: #ce9178;">"*ulps*"</span>, <span style="color: #ce9178;">"3"</span>);
    );
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org4fdb8c3" class="outline-4">
<h4 id="org4fdb8c3"><span class="section-number-4">9.3.2.</span> <code>map</code> e <code>mapc</code></h4>
<div class="outline-text-4" id="text-9-3-2">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #c586c0;">#[test]</span>
<span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">evaluator_bootstrap_map_mapc</span>() {
    <span style="color: #569cd6;">let</span> <span style="color: #569cd6;">mut</span> <span style="color: #9cdcfe;">state</span> = <span style="color: #4ec9b0;">MajState</span>::new();
    <span style="color: #c586c0;">multi_eval_test!</span>(
        state;
        (<span style="color: #ce9178;">"(map (fn (x) (* x x))</span>
<span style="color: #ce9178;">               (quote (1 2 3 4 5)))"</span>,
         <span style="color: #ce9178;">"(1 4 9 16 25)"</span>);
        (<span style="color: #ce9178;">"(map (fn (x) (* x x))</span>
<span style="color: #ce9178;">               (quote (1 2 3 4 . 5)))"</span>,
         <span style="color: #ce9178;">"(1 4 9 16)"</span>);
        (<span style="color: #ce9178;">"(mapc (fn (x) (* x x))</span>
<span style="color: #ce9178;">                (quote (1 2 3 4 5)))"</span>,
         <span style="color: #ce9178;">"nil"</span>);
        (<span style="color: #ce9178;">"(let ((results nil))</span>
<span style="color: #ce9178;">            (mapc (fn (x)</span>
<span style="color: #ce9178;">                    (set results</span>
<span style="color: #ce9178;">                         (cons (* x x) results)))</span>
<span style="color: #ce9178;">                  (quote (1 2 3 4 5)))</span>
<span style="color: #ce9178;">            results)"</span>,
         <span style="color: #ce9178;">"(25 16 9 4 1)"</span>);
    );
}
</pre>
</div>
</div>
</div>
