10-testes.org
*** ~vector=~

#+begin_src rust
#[test]
fn evaluator_bootstrap_vectorequal() {
    let mut state = MajState::new();
    multi_eval_test!(
        state;
        ("(vector= [1 2 3] [1 2 3])",     "t");
        ("(let ((v [5 6 7 8]))
            (vector= v [5 6 7 8]))",      "t");
        ("(vector= [1 2] [3 4 5])",       "nil");
        ("(vector= \"Hello\" \"Hello\")", "t");
        ("(vector= ['a 'b] [#\\a #\\b])", "nil");
    );
    multi_eval_fail_test!(
        state;
        "(vector= 'a ['a])";
        "(vector= [5] 5)";
    );
}
#+end_src

*** ~equal~

#+begin_src rust
#[test]
fn evaluator_bootstrap_equal() {
    let mut state = MajState::new();
    multi_eval_test!(
        state;
        ("(equal 0.5 1/2)",             "t");
        ("(equal [1 2 3] [1 2 3])",     "t");
        ("(equal 'a 'b)",               "nil");
        ("(equal '(a b c) '(a b c))",   "t");
        ("(equal #\\F #\\F)",           "t");
        ("(equal *stdin* *stdin*)",     "t");
        ("(equal *stdin* *stdout*)",    "nil");
        ("(equal 20 'a)",               "nil");
        ("(equal *stdout* '(a b c))",   "nil");
        ("(equal [6 5] '(6 5))",        "nil");
        ("(equal \"Teste\" \"Teste\")", "t");
    );
}
#+end_src

*** ~assp~ e ~assoc~

#+begin_src rust
#[test]
fn evaluator_bootstrap_assp_assoc() {
    let mut state = MajState::new();
    multi_eval_test!(
        state;
        ("(assp (fn (x) (eq (quote b) x))
                (quote ((a . 1) (b . 2) (c . 3))))",
         "(b . 2)");
        ("(assp (eq (quote b))
                (quote ((a . 1) (b . 2) (c . 3))))",
         "(b . 2)");
        ("(assp (eq (quote z))
                (quote ((a . 1) (b . 2) (c . 3))))",
         "nil");
        ("(assoc (quote b)
                 (quote ((a . 1) (b . 2) (c . 3))))",
         "(b . 2)");
        ("(assoc (quote a)
                 (quote ((a . 1) (b . 2) (c . 3))))",
         "(a . 1)");
        ("(letfn ((equal (x y)
                    (= x y)))
            (assoc 2 (quote ((1 . a) (2 . b) (3 . c)))))",
         "(2 . b)");
        ("(assoc (quote z)
                 (quote ((a . 1) (b . 2) (c . 3))))",
         "nil");
    );
}
#+end_src

*** ~member~

#+begin_src rust
#[test]
fn evaluator_bootstrap_member() {
    let mut state = MajState::new();
    multi_eval_test!(
        state;
        ("(member (quote a) (quote (x y z a b c)))",
         "(a b c)");
        ("(member (quote x) (quote (x y z a b c)))",
         "(x y z a b c)");
        ("(member (quote c) (quote (x y z a b c)))",
         "(c)");
        ("(letfn ((equal (x y)
                    (= x y)))
            (member 1 (quote (5 6 7 1 2 3))))",
         "(1 2 3)");
        ("(member (quote n) (quote (x y z a b c)))",
         "nil");
    );
}
#+end_src

** TODO Aplicação de primitivas

#+begin_src rust
#[test]
#[ignore]
fn evaluator_primitives_application() {
    unimplemented!();
}
#+end_src

** TODO Expansão de macros
*** ~cond~

#+begin_src rust
#[test]
fn macros_cond() {
    let mut state = MajState::new();
    multi_macroexpand_1_test! {
        state;
        ("(cond (a b)
                (t c))",
         "(if a (do b) (cond (t c)))");
        ("(cond ((numberp x) x))",
         "(if (numberp x) (do x) nil)");
    };
    multi_eval_test! {
        state;
        ("(let ((x 1))
            (cond ((zerop x) 0)
                  ((< x 1) (- x))
                  (t x)))",
         "1");
        ("(let ((x 0))
            (cond ((zerop x) 0)
                  ((< x 1) (- x))
                  (t x)))",
         "0");
        ("(cond (t (quote a)))", "a");
        ("(cond ((eq (quote a)
                     (quote b))
                 (quote ok)))",
         "nil");
    };
}
#+end_src

