doc/html/10-testes.html

<div id="outline-container-org9d0955b" class="outline-4">
<h4 id="org9d0955b"><span class="section-number-4">9.3.3.</span> <code>vector=</code></h4>
<div class="outline-text-4" id="text-9-3-3">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #c586c0;">#[test]</span>
<span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">evaluator_bootstrap_vectorequal</span>() {
    <span style="color: #569cd6;">let</span> <span style="color: #569cd6;">mut</span> <span style="color: #9cdcfe;">state</span> = <span style="color: #4ec9b0;">MajState</span>::new();
    <span style="color: #c586c0;">multi_eval_test!</span>(
        state;
        (<span style="color: #ce9178;">"(vector= [1 2 3] [1 2 3])"</span>,     <span style="color: #ce9178;">"t"</span>);
        (<span style="color: #ce9178;">"(let ((v [5 6 7 8]))</span>
<span style="color: #ce9178;">            (vector= v [5 6 7 8]))"</span>,      <span style="color: #ce9178;">"t"</span>);
        (<span style="color: #ce9178;">"(vector= [1 2] [3 4 5])"</span>,       <span style="color: #ce9178;">"nil"</span>);
        (<span style="color: #ce9178;">"(vector= \"Hello\" \"Hello\")"</span>, <span style="color: #ce9178;">"t"</span>);
        (<span style="color: #ce9178;">"(vector= ['a 'b] [#\\a #\\b])"</span>, <span style="color: #ce9178;">"nil"</span>);
    );
    <span style="color: #c586c0;">multi_eval_fail_test!</span>(
        state;
        <span style="color: #ce9178;">"(vector= 'a ['a])"</span>;
        <span style="color: #ce9178;">"(vector= [5] 5)"</span>;
    );
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org77e925e" class="outline-4">
<h4 id="org77e925e"><span class="section-number-4">9.3.4.</span> <code>equal</code></h4>
<div class="outline-text-4" id="text-9-3-4">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #c586c0;">#[test]</span>
<span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">evaluator_bootstrap_equal</span>() {
    <span style="color: #569cd6;">let</span> <span style="color: #569cd6;">mut</span> <span style="color: #9cdcfe;">state</span> = <span style="color: #4ec9b0;">MajState</span>::new();
    <span style="color: #c586c0;">multi_eval_test!</span>(
        state;
        (<span style="color: #ce9178;">"(equal 0.5 1/2)"</span>,             <span style="color: #ce9178;">"t"</span>);
        (<span style="color: #ce9178;">"(equal [1 2 3] [1 2 3])"</span>,     <span style="color: #ce9178;">"t"</span>);
        (<span style="color: #ce9178;">"(equal 'a 'b)"</span>,               <span style="color: #ce9178;">"nil"</span>);
        (<span style="color: #ce9178;">"(equal '(a b c) '(a b c))"</span>,   <span style="color: #ce9178;">"t"</span>);
        (<span style="color: #ce9178;">"(equal #\\F #\\F)"</span>,           <span style="color: #ce9178;">"t"</span>);
        (<span style="color: #ce9178;">"(equal *stdin* *stdin*)"</span>,     <span style="color: #ce9178;">"t"</span>);
        (<span style="color: #ce9178;">"(equal *stdin* *stdout*)"</span>,    <span style="color: #ce9178;">"nil"</span>);
        (<span style="color: #ce9178;">"(equal 20 'a)"</span>,               <span style="color: #ce9178;">"nil"</span>);
        (<span style="color: #ce9178;">"(equal *stdout* '(a b c))"</span>,   <span style="color: #ce9178;">"nil"</span>);
        (<span style="color: #ce9178;">"(equal [6 5] '(6 5))"</span>,        <span style="color: #ce9178;">"nil"</span>);
        (<span style="color: #ce9178;">"(equal \"Teste\" \"Teste\")"</span>, <span style="color: #ce9178;">"t"</span>);
    );
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org715cbea" class="outline-4">
<h4 id="org715cbea"><span class="section-number-4">9.3.5.</span> <code>assp</code> e <code>assoc</code></h4>
<div class="outline-text-4" id="text-9-3-5">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #c586c0;">#[test]</span>
<span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">evaluator_bootstrap_assp_assoc</span>() {
    <span style="color: #569cd6;">let</span> <span style="color: #569cd6;">mut</span> <span style="color: #9cdcfe;">state</span> = <span style="color: #4ec9b0;">MajState</span>::new();
    <span style="color: #c586c0;">multi_eval_test!</span>(
        state;
        (<span style="color: #ce9178;">"(assp (fn (x) (eq (quote b) x))</span>
<span style="color: #ce9178;">                (quote ((a . 1) (b . 2) (c . 3))))"</span>,
         <span style="color: #ce9178;">"(b . 2)"</span>);
        (<span style="color: #ce9178;">"(assp (eq (quote b))</span>
<span style="color: #ce9178;">                (quote ((a . 1) (b . 2) (c . 3))))"</span>,
         <span style="color: #ce9178;">"(b . 2)"</span>);
        (<span style="color: #ce9178;">"(assp (eq (quote z))</span>
<span style="color: #ce9178;">                (quote ((a . 1) (b . 2) (c . 3))))"</span>,
         <span style="color: #ce9178;">"nil"</span>);
        (<span style="color: #ce9178;">"(assoc (quote b)</span>
<span style="color: #ce9178;">                 (quote ((a . 1) (b . 2) (c . 3))))"</span>,
         <span style="color: #ce9178;">"(b . 2)"</span>);
        (<span style="color: #ce9178;">"(assoc (quote a)</span>
<span style="color: #ce9178;">                 (quote ((a . 1) (b . 2) (c . 3))))"</span>,
         <span style="color: #ce9178;">"(a . 1)"</span>);
        (<span style="color: #ce9178;">"(letfn ((equal (x y)</span>
<span style="color: #ce9178;">                    (= x y)))</span>
<span style="color: #ce9178;">            (assoc 2 (quote ((1 . a) (2 . b) (3 . c)))))"</span>,
         <span style="color: #ce9178;">"(2 . b)"</span>);
        (<span style="color: #ce9178;">"(assoc (quote z)</span>
<span style="color: #ce9178;">                 (quote ((a . 1) (b . 2) (c . 3))))"</span>,
         <span style="color: #ce9178;">"nil"</span>);
    );
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org498ef0e" class="outline-4">
<h4 id="org498ef0e"><span class="section-number-4">9.3.6.</span> <code>member</code></h4>
<div class="outline-text-4" id="text-9-3-6">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #c586c0;">#[test]</span>
<span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">evaluator_bootstrap_member</span>() {
    <span style="color: #569cd6;">let</span> <span style="color: #569cd6;">mut</span> <span style="color: #9cdcfe;">state</span> = <span style="color: #4ec9b0;">MajState</span>::new();
    <span style="color: #c586c0;">multi_eval_test!</span>(
        state;
        (<span style="color: #ce9178;">"(member (quote a) (quote (x y z a b c)))"</span>,
         <span style="color: #ce9178;">"(a b c)"</span>);
        (<span style="color: #ce9178;">"(member (quote x) (quote (x y z a b c)))"</span>,
         <span style="color: #ce9178;">"(x y z a b c)"</span>);
        (<span style="color: #ce9178;">"(member (quote c) (quote (x y z a b c)))"</span>,
         <span style="color: #ce9178;">"(c)"</span>);
        (<span style="color: #ce9178;">"(letfn ((equal (x y)</span>
<span style="color: #ce9178;">                    (= x y)))</span>
<span style="color: #ce9178;">            (member 1 (quote (5 6 7 1 2 3))))"</span>,
         <span style="color: #ce9178;">"(1 2 3)"</span>);
        (<span style="color: #ce9178;">"(member (quote n) (quote (x y z a b c)))"</span>,
         <span style="color: #ce9178;">"nil"</span>);
    );
}
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgc1334c6" class="outline-3">
<h3 id="orgc1334c6"><span class="section-number-3">9.4.</span> <span class="todo TODO">TODO</span> Aplicação de primitivas</h3>
<div class="outline-text-3" id="text-9-4">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #c586c0;">#[test]</span>
<span style="color: #c586c0;">#[ignore]</span>
<span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">evaluator_primitives_application</span>() {
    <span style="color: #c586c0;">unimplemented!</span>();
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org5800ef1" class="outline-3">
<h3 id="org5800ef1"><span class="section-number-3">9.5.</span> <span class="todo TODO">TODO</span> Expansão de macros</h3>
<div class="outline-text-3" id="text-9-5">
</div>
<div id="outline-container-org390e9bc" class="outline-4">
<h4 id="org390e9bc"><span class="section-number-4">9.5.1.</span> <code>cond</code></h4>
<div class="outline-text-4" id="text-9-5-1">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #c586c0;">#[test]</span>
<span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">macros_cond</span>() {
    <span style="color: #569cd6;">let</span> <span style="color: #569cd6;">mut</span> <span style="color: #9cdcfe;">state</span> = <span style="color: #4ec9b0;">MajState</span>::new();
    <span style="color: #c586c0;">multi_macroexpand_1_test!</span> {
        state;
        (<span style="color: #ce9178;">"(cond (a b)</span>
<span style="color: #ce9178;">                (t c))"</span>,
         <span style="color: #ce9178;">"(if a (do b) (cond (t c)))"</span>);
        (<span style="color: #ce9178;">"(cond ((numberp x) x))"</span>,
         <span style="color: #ce9178;">"(if (numberp x) (do x) nil)"</span>);
    };
    <span style="color: #c586c0;">multi_eval_test!</span> {
        state;
        (<span style="color: #ce9178;">"(let ((x 1))</span>
<span style="color: #ce9178;">            (cond ((zerop x) 0)</span>
<span style="color: #ce9178;">                  ((&lt; x 1) (- x))</span>
<span style="color: #ce9178;">                  (t x)))"</span>,
         <span style="color: #ce9178;">"1"</span>);
        (<span style="color: #ce9178;">"(let ((x 0))</span>
<span style="color: #ce9178;">            (cond ((zerop x) 0)</span>
<span style="color: #ce9178;">                  ((&lt; x 1) (- x))</span>
<span style="color: #ce9178;">                  (t x)))"</span>,
         <span style="color: #ce9178;">"0"</span>);
        (<span style="color: #ce9178;">"(cond (t (quote a)))"</span>, <span style="color: #ce9178;">"a"</span>);
        (<span style="color: #ce9178;">"(cond ((eq (quote a)</span>
<span style="color: #ce9178;">                     (quote b))</span>
<span style="color: #ce9178;">                 (quote ok)))"</span>,
         <span style="color: #ce9178;">"nil"</span>);
    };
}
</pre>
</div>
</div>
</div>
