10-testes.org
*** ~defn~

#+begin_src rust
#[test]
fn macros_defn() {
    let mut state = MajState::new();
    multi_macroexpand_1_test! {
        state;
        ("(defn name lambda-list body1 body2)",
         "(def name (fn lambda-list body1 body2))");
        ("(defn identity (x) x)",
         "(def identity (fn (x) x))");
    }
    multi_eval_test! {
        state;
        ("(defn identity (x) x)", "identity");
        ("(closurep identity)",   "t");
        ("identity", "(lit closure nil (x) (x))");
    }
}
#+end_src

*** ~defmac~

#+begin_src rust
#[test]
fn macros_defmac() {
    let mut state = MajState::new();
    multi_macroexpand_1_test! {
        state;
        ("(defmac name lambda-list body1 body2)",
         "(def name (mac lambda-list body1 body2))");
        ("(defmac call (f) (quasiquote ((unquote f))))",
         "(def call (mac (f) (quasiquote ((unquote f)))))");
    }
    multi_eval_test! {
        state;
        ("(defmac call (f) (quasiquote ((unquote f))))",
         "call");
        ("(macrop call)",   "t");
        ("(defn foo () 1)", "foo");
        ("(call foo)", "1");
    }
}
#+end_src

*** ~let~ e ~let*~

#+begin_src rust
#[test]
fn macros_let_letstar() {
    let mut state = MajState::new();
    multi_macroexpand_1_test! {
        state;
        ("(let ((x 1)  (y 2))
            (+ x y))",
         "((fn (y x) (+ x y)) 2 1)");
        ("(let* ((x 1)  (y (1+ x)))
            (+ x y))",
         "(let ((x 1)) (let* ((y (1+ x))) (+ x y)))");
        ("(let* ((x (* 2 3))
                 (y (1+ x))
                 (z (+ y 3)))
            (+ x y z))",
         "(let ((x (* 2 3))) (let* ((y (1+ x)) (z (+ y 3))) (+ x y z)))");
    }
    multi_eval_test! {
        state;
        ("(let ((x 1)  (y 2))
            (+ x y))",
         "3");
        ("(let* ((x (* 2 3))
                 (y (1+ x))
                 (z (+ y 3)))
            (+ x y z))",
         "23");
    }
}
#+end_src

*** ~letfn~ e ~letfn*~

#+begin_src rust
#[test]
fn macros_letfn_letfnstar() {
    let mut state = MajState::new();
    multi_macroexpand_1_test! {
        state;
        ("(letfn ((foo (x) (+ 1 2 x))
                  (bar (x) x))
            (foo 5))",
         "((fn (bar foo) (foo 5)) (fn (x) x) (fn (x) (+ 1 2 x)))");
        ("(letfn* ((foo (x) (+ 1 2 x))
                   (bar (x) (foo x)))
            (bar 5))",
         "(letfn ((foo (x) (+ 1 2 x))) (letfn* ((bar (x) (foo x))) (bar 5)))");
    }
    multi_eval_test! {
        state;
        ("(letfn ((foo (x) (+ 1 2 x)))
            (foo 5))",
         "8");
        ("(letfn* ((foo (x) (+ 1 2 x))
                   (bar (x) (foo x)))
            (bar 5))",
         "8");
    };
}
#+end_src

*** ~when~ e ~unless~

#+begin_src rust
#[test]
fn macros_when_unless() {
    let mut state = MajState::new();
    multi_macroexpand_1_test! {
        state;
        ("(when t
            (print \"Hello\")
            (+ 2 3))",
         "(if t (do (print \"Hello\") (+ 2 3)) nil)");
        ("(unless t
            (print \"Hello\")
            (+ 2 3))",
         "(if (not t) (do (print \"Hello\") (+ 2 3)) nil)");
    }
    multi_eval_test! {
        state;
        ("(when t (+ 2 3))",         "5");
        ("(when (= 2 3) (+ 2 3))",   "nil");
        ("(unless t (+ 2 3))",       "nil");
        ("(unless (= 2 3) (+ 2 3))", "5");
    }
}
#+end_src

*** ~until~

#+begin_src rust
#[test]
fn macros_until() {
    let mut state = MajState::new();
    multi_macroexpand_1_test! {
        state;
        ("(until (>= x 5)
            (set x (1+ x)))",
         "(while (not (>= x 5)) (set x (1+ x)))");
    }
    multi_eval_test! {
        state;
        ("(let ((x 0))
            (until (>= x 5)
              (set x (1+ x)))
            x)",
         "5");
    }
}
#+end_src

*** TODO ~repeat~

#+begin_src rust
#[test]
#[ignore]
fn macros_repeat() {
    // Needs a macroexpand-1 macro which accepts
    // generated-symbol regex
    unimplemented!();
}
#+end_src

