doc/html/10-testes.html

<div id="outline-container-org57a2649" class="outline-4">
<h4 id="org57a2649"><span class="section-number-4">9.5.2.</span> <code>defn</code></h4>
<div class="outline-text-4" id="text-9-5-2">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #c586c0;">#[test]</span>
<span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">macros_defn</span>() {
    <span style="color: #569cd6;">let</span> <span style="color: #569cd6;">mut</span> <span style="color: #9cdcfe;">state</span> = <span style="color: #4ec9b0;">MajState</span>::new();
    <span style="color: #c586c0;">multi_macroexpand_1_test!</span> {
        state;
        (<span style="color: #ce9178;">"(defn name lambda-list body1 body2)"</span>,
         <span style="color: #ce9178;">"(def name (fn lambda-list body1 body2))"</span>);
        (<span style="color: #ce9178;">"(defn identity (x) x)"</span>,
         <span style="color: #ce9178;">"(def identity (fn (x) x))"</span>);
    }
    <span style="color: #c586c0;">multi_eval_test!</span> {
        state;
        (<span style="color: #ce9178;">"(defn identity (x) x)"</span>, <span style="color: #ce9178;">"identity"</span>);
        (<span style="color: #ce9178;">"(closurep identity)"</span>,   <span style="color: #ce9178;">"t"</span>);
        (<span style="color: #ce9178;">"identity"</span>, <span style="color: #ce9178;">"(lit closure nil (x) (x))"</span>);
    }
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org8035a01" class="outline-4">
<h4 id="org8035a01"><span class="section-number-4">9.5.3.</span> <code>defmac</code></h4>
<div class="outline-text-4" id="text-9-5-3">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #c586c0;">#[test]</span>
<span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">macros_defmac</span>() {
    <span style="color: #569cd6;">let</span> <span style="color: #569cd6;">mut</span> <span style="color: #9cdcfe;">state</span> = <span style="color: #4ec9b0;">MajState</span>::new();
    <span style="color: #c586c0;">multi_macroexpand_1_test!</span> {
        state;
        (<span style="color: #ce9178;">"(defmac name lambda-list body1 body2)"</span>,
         <span style="color: #ce9178;">"(def name (mac lambda-list body1 body2))"</span>);
        (<span style="color: #ce9178;">"(defmac call (f) (quasiquote ((unquote f))))"</span>,
         <span style="color: #ce9178;">"(def call (mac (f) (quasiquote ((unquote f)))))"</span>);
    }
    <span style="color: #c586c0;">multi_eval_test!</span> {
        state;
        (<span style="color: #ce9178;">"(defmac call (f) (quasiquote ((unquote f))))"</span>,
         <span style="color: #ce9178;">"call"</span>);
        (<span style="color: #ce9178;">"(macrop call)"</span>,   <span style="color: #ce9178;">"t"</span>);
        (<span style="color: #ce9178;">"(defn foo () 1)"</span>, <span style="color: #ce9178;">"foo"</span>);
        (<span style="color: #ce9178;">"(call foo)"</span>, <span style="color: #ce9178;">"1"</span>);
    }
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orgeb64a03" class="outline-4">
<h4 id="orgeb64a03"><span class="section-number-4">9.5.4.</span> <code>let</code> e <code>let*</code></h4>
<div class="outline-text-4" id="text-9-5-4">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #c586c0;">#[test]</span>
<span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">macros_let_letstar</span>() {
    <span style="color: #569cd6;">let</span> <span style="color: #569cd6;">mut</span> <span style="color: #9cdcfe;">state</span> = <span style="color: #4ec9b0;">MajState</span>::new();
    <span style="color: #c586c0;">multi_macroexpand_1_test!</span> {
        state;
        (<span style="color: #ce9178;">"(let ((x 1)  (y 2))</span>
<span style="color: #ce9178;">            (+ x y))"</span>,
         <span style="color: #ce9178;">"((fn (y x) (+ x y)) 2 1)"</span>);
        (<span style="color: #ce9178;">"(let* ((x 1)  (y (1+ x)))</span>
<span style="color: #ce9178;">            (+ x y))"</span>,
         <span style="color: #ce9178;">"(let ((x 1)) (let* ((y (1+ x))) (+ x y)))"</span>);
        (<span style="color: #ce9178;">"(let* ((x (* 2 3))</span>
<span style="color: #ce9178;">                 (y (1+ x))</span>
<span style="color: #ce9178;">                 (z (+ y 3)))</span>
<span style="color: #ce9178;">            (+ x y z))"</span>,
         <span style="color: #ce9178;">"(let ((x (* 2 3))) (let* ((y (1+ x)) (z (+ y 3))) (+ x y z)))"</span>);
    }
    <span style="color: #c586c0;">multi_eval_test!</span> {
        state;
        (<span style="color: #ce9178;">"(let ((x 1)  (y 2))</span>
<span style="color: #ce9178;">            (+ x y))"</span>,
         <span style="color: #ce9178;">"3"</span>);
        (<span style="color: #ce9178;">"(let* ((x (* 2 3))</span>
<span style="color: #ce9178;">                 (y (1+ x))</span>
<span style="color: #ce9178;">                 (z (+ y 3)))</span>
<span style="color: #ce9178;">            (+ x y z))"</span>,
         <span style="color: #ce9178;">"23"</span>);
    }
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orgad66abc" class="outline-4">
<h4 id="orgad66abc"><span class="section-number-4">9.5.5.</span> <code>letfn</code> e <code>letfn*</code></h4>
<div class="outline-text-4" id="text-9-5-5">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #c586c0;">#[test]</span>
<span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">macros_letfn_letfnstar</span>() {
    <span style="color: #569cd6;">let</span> <span style="color: #569cd6;">mut</span> <span style="color: #9cdcfe;">state</span> = <span style="color: #4ec9b0;">MajState</span>::new();
    <span style="color: #c586c0;">multi_macroexpand_1_test!</span> {
        state;
        (<span style="color: #ce9178;">"(letfn ((foo (x) (+ 1 2 x))</span>
<span style="color: #ce9178;">                  (bar (x) x))</span>
<span style="color: #ce9178;">            (foo 5))"</span>,
         <span style="color: #ce9178;">"((fn (bar foo) (foo 5)) (fn (x) x) (fn (x) (+ 1 2 x)))"</span>);
        (<span style="color: #ce9178;">"(letfn* ((foo (x) (+ 1 2 x))</span>
<span style="color: #ce9178;">                   (bar (x) (foo x)))</span>
<span style="color: #ce9178;">            (bar 5))"</span>,
         <span style="color: #ce9178;">"(letfn ((foo (x) (+ 1 2 x))) (letfn* ((bar (x) (foo x))) (bar 5)))"</span>);
    }
    <span style="color: #c586c0;">multi_eval_test!</span> {
        state;
        (<span style="color: #ce9178;">"(letfn ((foo (x) (+ 1 2 x)))</span>
<span style="color: #ce9178;">            (foo 5))"</span>,
         <span style="color: #ce9178;">"8"</span>);
        (<span style="color: #ce9178;">"(letfn* ((foo (x) (+ 1 2 x))</span>
<span style="color: #ce9178;">                   (bar (x) (foo x)))</span>
<span style="color: #ce9178;">            (bar 5))"</span>,
         <span style="color: #ce9178;">"8"</span>);
    };
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org3d9362e" class="outline-4">
<h4 id="org3d9362e"><span class="section-number-4">9.5.6.</span> <code>when</code> e <code>unless</code></h4>
<div class="outline-text-4" id="text-9-5-6">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #c586c0;">#[test]</span>
<span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">macros_when_unless</span>() {
    <span style="color: #569cd6;">let</span> <span style="color: #569cd6;">mut</span> <span style="color: #9cdcfe;">state</span> = <span style="color: #4ec9b0;">MajState</span>::new();
    <span style="color: #c586c0;">multi_macroexpand_1_test!</span> {
        state;
        (<span style="color: #ce9178;">"(when t</span>
<span style="color: #ce9178;">            (print \"Hello\")</span>
<span style="color: #ce9178;">            (+ 2 3))"</span>,
         <span style="color: #ce9178;">"(if t (do (print \"Hello\") (+ 2 3)) nil)"</span>);
        (<span style="color: #ce9178;">"(unless t</span>
<span style="color: #ce9178;">            (print \"Hello\")</span>
<span style="color: #ce9178;">            (+ 2 3))"</span>,
         <span style="color: #ce9178;">"(if (not t) (do (print \"Hello\") (+ 2 3)) nil)"</span>);
    }
    <span style="color: #c586c0;">multi_eval_test!</span> {
        state;
        (<span style="color: #ce9178;">"(when t (+ 2 3))"</span>,         <span style="color: #ce9178;">"5"</span>);
        (<span style="color: #ce9178;">"(when (= 2 3) (+ 2 3))"</span>,   <span style="color: #ce9178;">"nil"</span>);
        (<span style="color: #ce9178;">"(unless t (+ 2 3))"</span>,       <span style="color: #ce9178;">"nil"</span>);
        (<span style="color: #ce9178;">"(unless (= 2 3) (+ 2 3))"</span>, <span style="color: #ce9178;">"5"</span>);
    }
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org2cae259" class="outline-4">
<h4 id="org2cae259"><span class="section-number-4">9.5.7.</span> <code>until</code></h4>
<div class="outline-text-4" id="text-9-5-7">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #c586c0;">#[test]</span>
<span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">macros_until</span>() {
    <span style="color: #569cd6;">let</span> <span style="color: #569cd6;">mut</span> <span style="color: #9cdcfe;">state</span> = <span style="color: #4ec9b0;">MajState</span>::new();
    <span style="color: #c586c0;">multi_macroexpand_1_test!</span> {
        state;
        (<span style="color: #ce9178;">"(until (&gt;= x 5)</span>
<span style="color: #ce9178;">            (set x (1+ x)))"</span>,
         <span style="color: #ce9178;">"(while (not (&gt;= x 5)) (set x (1+ x)))"</span>);
    }
    <span style="color: #c586c0;">multi_eval_test!</span> {
        state;
        (<span style="color: #ce9178;">"(let ((x 0))</span>
<span style="color: #ce9178;">            (until (&gt;= x 5)</span>
<span style="color: #ce9178;">              (set x (1+ x)))</span>
<span style="color: #ce9178;">            x)"</span>,
         <span style="color: #ce9178;">"5"</span>);
    }
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org383652d" class="outline-4">
<h4 id="org383652d"><span class="section-number-4">9.5.8.</span> <span class="todo TODO">TODO</span> <code>repeat</code></h4>
<div class="outline-text-4" id="text-9-5-8">
<div class="org-src-container">
<pre class="src src-rust"><span style="color: #c586c0;">#[test]</span>
<span style="color: #c586c0;">#[ignore]</span>
<span style="color: #569cd6;">fn</span> <span style="color: #dcdcaa;">macros_repeat</span>() {
    <span style="color: #6a9955;">// </span><span style="color: #6a9955;">Needs a macroexpand-1 macro which accepts</span>
    <span style="color: #6a9955;">// </span><span style="color: #6a9955;">generated-symbol regex</span>
    <span style="color: #c586c0;">unimplemented!</span>();
}
</pre>
</div>
</div>
</div>
